MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C58L0AGL2000A/mcu.h
typedef struct stc_flash_if_ficr_field
{
  __IO uint32_t RDYIE      : 1;
  __IO uint32_t HANGIE     : 1;
  __IO uint32_t ERRIE      : 1;
} stc_flash_if_ficr_field_t;

typedef struct stc_flash_if_fisr_field
{
  __IO uint32_t RDYIF      : 1;
  __IO uint32_t HANGIF     : 1;
  __IO uint32_t ERRIF      : 1;
} stc_flash_if_fisr_field_t;

typedef struct stc_flash_if_ficlr_field
{
  __IO uint32_t RDYIC      : 1;
  __IO uint32_t HANGIC     : 1;
  __IO uint32_t ERRIC      : 1;
} stc_flash_if_ficlr_field_t;

typedef struct stc_flash_if_dfctrlr_field
{
  __IO uint32_t DFE        : 1;
  __IO uint32_t RME        : 1;
       uint32_t RESERVED1  : 14;
  __IO uint32_t WKEY       : 16;
} stc_flash_if_dfctrlr_field_t;

typedef struct stc_flash_if_crtrmm_field
{
  __IO uint32_t TRMM       : 10;
       uint32_t RESERVED1  : 6;
  __IO uint32_t TTRMM      : 5;
} stc_flash_if_crtrmm_field_t;

typedef struct stc_flash_if_fgpdm1_field
{
  __IO uint32_t GPD1       : 32;
} stc_flash_if_fgpdm1_field_t;

typedef struct stc_flash_if_fgpdm2_field
{
  __IO uint32_t GPD2       : 32;
} stc_flash_if_fgpdm2_field_t;

typedef struct stc_flash_if_fgpdm3_field
{
  __IO uint32_t GPD3       : 32;
} stc_flash_if_fgpdm3_field_t;

typedef struct stc_flash_if_fgpdm4_field
{
  __IO uint32_t GPD4       : 32;
} stc_flash_if_fgpdm4_field_t;

/******************************************************************************
 * DUALFLASH_IF_MODULE
 ******************************************************************************/
/* DUALFLASH_IF_MODULE register bit fields */
typedef struct stc_dualflash_if_dfaszr_field
{
  __IO uint32_t DASZ       : 2;
} stc_dualflash_if_dfaszr_field_t;

typedef struct stc_dualflash_if_dfrwtr_field
{
  __IO uint32_t DRWT       : 2;
} stc_dualflash_if_dfrwtr_field_t;

typedef struct stc_dualflash_if_dfstr_field
{
  __IO uint32_t DFRDY      : 1;
  __IO uint32_t DFHNG      : 1;
  __IO uint32_t DFERR      : 1;
} stc_dualflash_if_dfstr_field_t;

/******************************************************************************
 * UNIQUE_ID_MODULE
 ******************************************************************************/
/* UNIQUE_ID_MODULE register bit fields */
typedef struct stc_unique_id_uidr0_field
{
       uint32_t RESERVED0  : 4;
  __IO uint32_t UID        :28;
} stc_unique_id_uidr0_field_t;

typedef struct stc_unique_id_uidr1_field
{
  __IO uint32_t UID        :13;
} stc_unique_id_uidr1_field_t;

/******************************************************************************
 * ECC_CAPTURE_MODULE
 ******************************************************************************/
/* ECC_CAPTURE_MODULE register bit fields */
typedef struct stc_ecc_capture_ferrad_field
{
  __IO uint32_t ERRAD      :23;
} stc_ecc_capture_ferrad_field_t;

/******************************************************************************
 * Clock_Reset_MODULE
 ******************************************************************************/
/* Clock_Reset_MODULE register bit fields */
typedef struct stc_crg_scm_ctl_field
{
       uint32_t RESERVED1  : 1;
  __IO uint32_t MOSCE      : 1;
       uint32_t RESERVED2  : 1;
  __IO uint32_t SOSCE      : 1;
  __IO uint32_t PLLE       : 1;
  __IO uint32_t RCS        : 3;
} stc_crg_scm_ctl_field_t;

typedef struct stc_crg_scm_str_field
{
       uint32_t RESERVED1  : 1;
  __IO uint32_t MORDY      : 1;
       uint32_t RESERVED2  : 1;
  __IO uint32_t SORDY      : 1;
  __IO uint32_t PLRDY      : 1;
  __IO uint32_t RCM0       : 1;
  __IO uint32_t RCM1       : 1;
  __IO uint32_t RCM2       : 1;
} stc_crg_scm_str_field_t;

typedef struct stc_crg_rst_str_field
{
  __IO uint32_t PONR       : 1;
  __IO uint32_t INITX      : 1;
  __IO uint32_t LVDH       : 1;
       uint32_t RESERVED1  : 1;
  __IO uint32_t SWDT       : 1;
  __IO uint32_t HWDT       : 1;
  __IO uint32_t CSVR       : 1;
  __IO uint32_t FCSR       : 1;
  __IO uint32_t SRST       : 1;
} stc_crg_rst_str_field_t;

typedef struct stc_crg_bsc_psr_field
{
  __IO uint32_t BSR0       : 1;
  __IO uint32_t BSR1       : 1;
  __IO uint32_t BSR2       : 1;
} stc_crg_bsc_psr_field_t;

typedef struct stc_crg_apbc0_psr_field
{
  __IO uint32_t APBC00     : 1;
  __IO uint32_t APBC01     : 1;
} stc_crg_apbc0_psr_field_t;

typedef struct stc_crg_apbc1_psr_field
{
  __IO uint32_t APBC10     : 1;
  __IO uint32_t APBC11     : 1;
       uint32_t RESERVED1  : 2;
  __IO uint32_t APBC1RST   : 1;
       uint32_t RESERVED2  : 2;
  __IO uint32_t APBC1EN    : 1;
} stc_crg_apbc1_psr_field_t;

typedef struct stc_crg_apbc2_psr_field
{
  __IO uint32_t APBC20     : 1;
  __IO uint32_t APBC21     : 1;
       uint32_t RESERVED1  : 2;
  __IO uint32_t APBC2RST   : 1;
       uint32_t RESERVED2  : 2;
  __IO uint32_t APBC2EN    : 1;
} stc_crg_apbc2_psr_field_t;

typedef struct stc_crg_swc_psr_field
{
  __IO uint32_t SWDS0      : 1;
  __IO uint32_t SWDS1      : 1;
} stc_crg_swc_psr_field_t;

typedef struct stc_crg_ttc_psr_field
{
  __IO uint32_t TTC        : 2;
} stc_crg_ttc_psr_field_t;

typedef struct stc_crg_csw_tmr_field
{
  __IO uint32_t MOWT0      : 1;
  __IO uint32_t MOWT1      : 1;
  __IO uint32_t MOWT2      : 1;
  __IO uint32_t MOWT3      : 1;
  __IO uint32_t SOWT0      : 1;
  __IO uint32_t SOWT1      : 1;
  __IO uint32_t SOWT2      : 1;
  __IO uint32_t SOWT3      : 1;
} stc_crg_csw_tmr_field_t;

typedef struct stc_crg_psw_tmr_field
{
  __IO uint32_t POWT0      : 1;
  __IO uint32_t POWT1      : 1;
  __IO uint32_t POWT2      : 1;
       uint32_t RESERVED1  : 1;
  __IO uint32_t PINC       : 1;
} stc_crg_psw_tmr_field_t;

typedef struct stc_crg_pll_ctl1_field
{
  __IO uint32_t PLLM0      : 1;
  __IO uint32_t PLLM1      : 1;
  __IO uint32_t PLLM2      : 1;
  __IO uint32_t PLLM3      : 1;
  __IO uint32_t PLLK0      : 1;
  __IO uint32_t PLLK1      : 1;
  __IO uint32_t PLLK2      : 1;
  __IO uint32_t PLLK3      : 1;
} stc_crg_pll_ctl1_field_t;

typedef struct stc_crg_pll_ctl2_field
{
  __IO uint32_t PLLN0      : 1;
  __IO uint32_t PLLN1      : 1;
  __IO uint32_t PLLN2      : 1;
  __IO uint32_t PLLN3      : 1;
  __IO uint32_t PLLN4      : 1;
  __IO uint32_t PLLN5      : 1;
} stc_crg_pll_ctl2_field_t;

typedef struct stc_crg_csv_ctl_field
{
  __IO uint32_t MCSVE      : 1;
  __IO uint32_t SCSVE      : 1;
       uint32_t RESERVED1  : 6;
  __IO uint32_t FCSDE      : 1;
  __IO uint32_t FCSRE      : 1;
       uint32_t RESERVED2  : 2;
  __IO uint32_t FCD0       : 1;
  __IO uint32_t FCD1       : 1;
  __IO uint32_t FCD2       : 1;
} stc_crg_csv_ctl_field_t;

typedef struct stc_crg_csv_str_field
{
  __IO uint32_t MCMF       : 1;
  __IO uint32_t SCMF       : 1;
} stc_crg_csv_str_field_t;

typedef struct stc_crg_dbwdt_ctl_field
{
       uint32_t RESERVED1  : 5;
  __IO uint32_t DPSWBE     : 1;
       uint32_t RESERVED2  : 1;
  __IO uint32_t DPHWBE     : 1;
} stc_crg_dbwdt_ctl_field_t;

typedef struct stc_crg_int_enr_field
{
  __IO uint32_t MCSE       : 1;
  __IO uint32_t SCSE       : 1;
  __IO uint32_t PCSE       : 1;
       uint32_t RESERVED1  : 2;
  __IO uint32_t FCSE       : 1;
} stc_crg_int_enr_field_t;

typedef struct stc_crg_int_str_field
{
  __IO uint32_t MCSI       : 1;
  __IO uint32_t SCSI       : 1;
  __IO uint32_t PCSI       : 1;
       uint32_t RESERVED1  : 2;
  __IO uint32_t FCSI       : 1;
} stc_crg_int_str_field_t;

typedef struct stc_crg_int_clr_field
{
  __IO uint32_t MCSC       : 1;
  __IO uint32_t SCSC       : 1;
  __IO uint32_t PCSC       : 1;
       uint32_t RESERVED1  : 2;
  __IO uint32_t FCSC       : 1;
} stc_crg_int_clr_field_t;

