MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C58L0AGL2000A/mcu.h
typedef struct stc_gpio_epfr09_field
{
  __IO uint32_t QAIN0S     : 2;
  __IO uint32_t QBIN0S     : 2;
  __IO uint32_t QZIN0S     : 2;
  __IO uint32_t QAIN1S     : 2;
  __IO uint32_t QBIN1S     : 2;
  __IO uint32_t QZIN1S     : 2;
  __IO uint32_t ADTRG0S    : 4;
  __IO uint32_t ADTRG1S    : 4;
  __IO uint32_t ADTRG2S    : 4;
  __IO uint32_t CRX0S      : 2;
  __IO uint32_t CTX0E      : 2;
  __IO uint32_t CRX1S      : 2;
  __IO uint32_t CTX1E      : 2;
} stc_gpio_epfr09_field_t;

typedef struct stc_gpio_epfr10_field
{
  __IO uint32_t UEDEFB     : 1;
  __IO uint32_t UEDTHB     : 1;
  __IO uint32_t UECLKE     : 1;
  __IO uint32_t UEWEXE     : 1;
  __IO uint32_t UEDQME     : 1;
  __IO uint32_t UEOEXE     : 1;
  __IO uint32_t UEFLSE     : 1;
  __IO uint32_t UECS1E     : 1;
  __IO uint32_t UECS2E     : 1;
  __IO uint32_t UECS3E     : 1;
  __IO uint32_t UECS4E     : 1;
  __IO uint32_t UECS5E     : 1;
  __IO uint32_t UECS6E     : 1;
  __IO uint32_t UECS7E     : 1;
  __IO uint32_t UEAOOE     : 1;
  __IO uint32_t UEA08E     : 1;
  __IO uint32_t UEA09E     : 1;
  __IO uint32_t UEA10E     : 1;
  __IO uint32_t UEA11E     : 1;
  __IO uint32_t UEA12E     : 1;
  __IO uint32_t UEA13E     : 1;
  __IO uint32_t UEA14E     : 1;
  __IO uint32_t UEA15E     : 1;
  __IO uint32_t UEA16E     : 1;
  __IO uint32_t UEA17E     : 1;
  __IO uint32_t UEA18E     : 1;
  __IO uint32_t UEA19E     : 1;
  __IO uint32_t UEA20E     : 1;
  __IO uint32_t UEA21E     : 1;
  __IO uint32_t UEA22E     : 1;
  __IO uint32_t UEA23E     : 1;
  __IO uint32_t UEA24E     : 1;
} stc_gpio_epfr10_field_t;

typedef struct stc_gpio_epfr11_field
{
  __IO uint32_t UEALEE     : 1;
  __IO uint32_t UECS0E     : 1;
  __IO uint32_t UEA01E     : 1;
  __IO uint32_t UEA02E     : 1;
  __IO uint32_t UEA03E     : 1;
  __IO uint32_t UEA04E     : 1;
  __IO uint32_t UEA05E     : 1;
  __IO uint32_t UEA06E     : 1;
  __IO uint32_t UEA07E     : 1;
  __IO uint32_t UED00B     : 1;
  __IO uint32_t UED01B     : 1;
  __IO uint32_t UED02B     : 1;
  __IO uint32_t UED03B     : 1;
  __IO uint32_t UED04B     : 1;
  __IO uint32_t UED05B     : 1;
  __IO uint32_t UED06B     : 1;
  __IO uint32_t UED07B     : 1;
  __IO uint32_t UED08B     : 1;
  __IO uint32_t UED09B     : 1;
  __IO uint32_t UED10B     : 1;
  __IO uint32_t UED11B     : 1;
  __IO uint32_t UED12B     : 1;
  __IO uint32_t UED13B     : 1;
  __IO uint32_t UED14B     : 1;
  __IO uint32_t UED15B     : 1;
  __IO uint32_t UERLC      : 1;
} stc_gpio_epfr11_field_t;

typedef struct stc_gpio_epfr12_field
{
       uint32_t RESERVED1  : 2;
  __IO uint32_t TIOA8E     : 2;
  __IO uint32_t TIOB8S     : 2;
       uint32_t RESERVED2  : 2;
  __IO uint32_t TIOA9S     : 2;
  __IO uint32_t TIOA9E     : 2;
  __IO uint32_t TIOB9S     : 2;
       uint32_t RESERVED3  : 4;
  __IO uint32_t TIOA10E    : 2;
  __IO uint32_t TIOB10S    : 2;
       uint32_t RESERVED4  : 2;
  __IO uint32_t TIOA11S    : 2;
  __IO uint32_t TIOA11E    : 2;
  __IO uint32_t TIOB11S    : 2;
} stc_gpio_epfr12_field_t;

typedef struct stc_gpio_epfr13_field
{
       uint32_t RESERVED1  : 2;
  __IO uint32_t TIOA12E    : 2;
  __IO uint32_t TIOB12S    : 2;
       uint32_t RESERVED2  : 2;
  __IO uint32_t TIOA13S    : 2;
  __IO uint32_t TIOA13E    : 2;
  __IO uint32_t TIOB13S    : 2;
       uint32_t RESERVED3  : 4;
  __IO uint32_t TIOA14E    : 2;
  __IO uint32_t TIOB14S    : 2;
       uint32_t RESERVED4  : 2;
  __IO uint32_t TIOA15S    : 2;
  __IO uint32_t TIOA15E    : 2;
  __IO uint32_t TIOB15S    : 2;
} stc_gpio_epfr13_field_t;

typedef struct stc_gpio_epfr14_field
{
  __IO uint32_t QAIN2S     : 2;
  __IO uint32_t QBIN2S     : 2;
  __IO uint32_t QZIN2S     : 2;
       uint32_t RESERVED1  : 12;
       uint32_t RESERVED2  : 14;
} stc_gpio_epfr14_field_t;

typedef struct stc_gpio_epfr15_field
{
  __IO uint32_t EINT16S    : 2;
  __IO uint32_t EINT17S    : 2;
  __IO uint32_t EINT18S    : 2;
  __IO uint32_t EINT19S    : 2;
  __IO uint32_t EINT20S    : 2;
  __IO uint32_t EINT21S    : 2;
  __IO uint32_t EINT22S    : 2;
  __IO uint32_t EINT23S    : 2;
  __IO uint32_t EINT24S    : 2;
  __IO uint32_t EINT25S    : 2;
  __IO uint32_t EINT26S    : 2;
  __IO uint32_t EINT27S    : 2;
  __IO uint32_t EINT28S    : 2;
  __IO uint32_t EINT29S    : 2;
  __IO uint32_t EINT30S    : 2;
  __IO uint32_t EINT31S    : 2;
} stc_gpio_epfr15_field_t;

typedef struct stc_gpio_epfr16_field
{
  __IO uint32_t SCS6B      : 2;
  __IO uint32_t SCS7B      : 2;
  __IO uint32_t SIN8S      : 2;
  __IO uint32_t SOT8B      : 2;
  __IO uint32_t SCK8B      : 2;
  __IO uint32_t SIN9S      : 2;
  __IO uint32_t SOT9B      : 2;
  __IO uint32_t SCK9B      : 2;
  __IO uint32_t SIN10S     : 2;
  __IO uint32_t SOT10B     : 2;
  __IO uint32_t SCK10B     : 2;
  __IO uint32_t SIN11S     : 2;
  __IO uint32_t SOT11B     : 2;
  __IO uint32_t SCK11B     : 2;
  __IO uint32_t SFMPAC     : 1;
  __IO uint32_t SFMPBC     : 1;
} stc_gpio_epfr16_field_t;

typedef struct stc_gpio_epfr17_field
{
       uint32_t RESERVED1  : 4;
  __IO uint32_t SIN12S     : 2;
  __IO uint32_t SOT12B     : 2;
  __IO uint32_t SCK12B     : 2;
  __IO uint32_t SIN13S     : 2;
  __IO uint32_t SOT13B     : 2;
  __IO uint32_t SCK13B     : 2;
  __IO uint32_t SIN14S     : 2;
  __IO uint32_t SOT14B     : 2;
  __IO uint32_t SCK14B     : 2;
  __IO uint32_t SIN15S     : 2;
  __IO uint32_t SOT15B     : 2;
  __IO uint32_t SCK15B     : 2;
} stc_gpio_epfr17_field_t;

typedef struct stc_gpio_epfr18_field
{
  __IO uint32_t CECR0B     : 2;
  __IO uint32_t CECR1B     : 2;
  __IO uint32_t QAIN3S     : 2;
  __IO uint32_t QBIN3S     : 2;
  __IO uint32_t QZIN3S     : 2;
       uint32_t RESERVED1  : 4;
  __IO uint32_t SDCLKE     : 2;
  __IO uint32_t SDCMDB     : 2;
  __IO uint32_t SDDATA0B   : 2;
  __IO uint32_t SDDATA1B   : 2;
  __IO uint32_t SDDATA2B   : 2;
  __IO uint32_t SDDATA3B   : 2;
  __IO uint32_t SDCDS      : 2;
  __IO uint32_t SDWPS      : 2;
} stc_gpio_epfr18_field_t;

typedef struct stc_gpio_epfr20_field
{
  __IO uint32_t UESMCKE    : 1;
  __IO uint32_t UESMCEE    : 1;
  __IO uint32_t UERASE     : 1;
  __IO uint32_t UECASE     : 1;
  __IO uint32_t UEDWEXE    : 1;
  __IO uint32_t UECSXE     : 1;
  __IO uint32_t UEDQM2E    : 1;
  __IO uint32_t UEDQM3E    : 1;
  __IO uint32_t UEDTHHB    : 1;
  __IO uint32_t UED16B     : 1;
  __IO uint32_t UED17B     : 1;
  __IO uint32_t UED18B     : 1;
  __IO uint32_t UED19B     : 1;
  __IO uint32_t UED20B     : 1;
  __IO uint32_t UED21B     : 1;
  __IO uint32_t UED22B     : 1;
  __IO uint32_t UED23B     : 1;
  __IO uint32_t UED24B     : 1;
  __IO uint32_t UED25B     : 1;
  __IO uint32_t UED26B     : 1;
  __IO uint32_t UED27B     : 1;
  __IO uint32_t UED28B     : 1;
  __IO uint32_t UED29B     : 1;
  __IO uint32_t UED30B     : 1;
  __IO uint32_t UED31B     : 1;
} stc_gpio_epfr20_field_t;

typedef struct stc_gpio_epfr23_field
{
  __IO uint32_t SCS60E     : 2;
  __IO uint32_t SCS61E     : 2;
  __IO uint32_t SCS62E     : 2;
  __IO uint32_t SCS63E     : 2;
  __IO uint32_t SCS70E     : 2;
  __IO uint32_t SCS71E     : 2;
  __IO uint32_t SCS72E     : 2;
  __IO uint32_t SCS73E     : 2;
} stc_gpio_epfr23_field_t;

typedef struct stc_gpio_epfr24_field
{
  __IO uint32_t I2SM4_MCLK0S: 2;
  __IO uint32_t I2SM4_MCLK0E: 2;
  __IO uint32_t I2SM4_SCK0B: 2;
  __IO uint32_t I2SM4_WS0B : 2;
  __IO uint32_t I2SM4_SDI0S: 2;
  __IO uint32_t I2SM4_SDO0E: 2;
} stc_gpio_epfr24_field_t;

typedef struct stc_gpio_epfr25_field
{
  __IO uint32_t MCRX2S     : 2;
  __IO uint32_t MCTX2E     : 2;
} stc_gpio_epfr25_field_t;

