MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C58L0AGL2000A/mcu.h
/******************************************************************************
 * MFS_MODULE(UART)
 ******************************************************************************/
/* MFS_MODULE(UART) register bit fields */
typedef struct stc_mfs_uart_rdr_field
{
       uint16_t RESERVED1  : 8;
  __IO uint16_t AD         : 1;
       uint16_t RESERVED2  : 7;
} stc_mfs_uart_rdr_field_t;

typedef struct stc_mfs_uart_tdr_field
{
       uint16_t RESERVED1  : 8;
  __IO uint16_t AD         : 1;
       uint16_t RESERVED2  : 7;
} stc_mfs_uart_tdr_field_t;

/******************************************************************************
 * MFS_MODULE(CSIO)
 ******************************************************************************/
/* MFS_MODULE(CSIO) register bit fields */
typedef struct stc_mfs_csio_scstr10_field
{
  __IO uint16_t CSHD0      : 1;
  __IO uint16_t CSHD1      : 1;
  __IO uint16_t CSHD2      : 1;
  __IO uint16_t CSHD3      : 1;
  __IO uint16_t CSHD4      : 1;
  __IO uint16_t CSHD5      : 1;
  __IO uint16_t CSHD6      : 1;
  __IO uint16_t CSHD7      : 1;
  __IO uint16_t CSSU0      : 1;
  __IO uint16_t CSSU1      : 1;
  __IO uint16_t CSSU2      : 1;
  __IO uint16_t CSSU3      : 1;
  __IO uint16_t CSSU4      : 1;
  __IO uint16_t CSSU5      : 1;
  __IO uint16_t CSSU6      : 1;
  __IO uint16_t CSSU7      : 1;
} stc_mfs_csio_scstr10_field_t;

typedef struct stc_mfs_csio_scstr0_field
{
  __IO  uint8_t CSHD0      : 1;
  __IO  uint8_t CSHD1      : 1;
  __IO  uint8_t CSHD2      : 1;
  __IO  uint8_t CSHD3      : 1;
  __IO  uint8_t CSHD4      : 1;
  __IO  uint8_t CSHD5      : 1;
  __IO  uint8_t CSHD6      : 1;
  __IO  uint8_t CSHD7      : 1;
} stc_mfs_csio_scstr0_field_t;

typedef struct stc_mfs_csio_scstr1_field
{
  __IO  uint8_t CSSU0      : 1;
  __IO  uint8_t CSSU1      : 1;
  __IO  uint8_t CSSU2      : 1;
  __IO  uint8_t CSSU3      : 1;
  __IO  uint8_t CSSU4      : 1;
  __IO  uint8_t CSSU5      : 1;
  __IO  uint8_t CSSU6      : 1;
  __IO  uint8_t CSSU7      : 1;
} stc_mfs_csio_scstr1_field_t;

typedef struct stc_mfs_csio_scstr32_field
{
  __IO uint16_t CSDS0      : 1;
  __IO uint16_t CSDS1      : 1;
  __IO uint16_t CSDS2      : 1;
  __IO uint16_t CSDS3      : 1;
  __IO uint16_t CSDS4      : 1;
  __IO uint16_t CSDS5      : 1;
  __IO uint16_t CSDS6      : 1;
  __IO uint16_t CSDS7      : 1;
  __IO uint16_t CSDS8      : 1;
  __IO uint16_t CSDS9      : 1;
  __IO uint16_t CSDS10     : 1;
  __IO uint16_t CSDS11     : 1;
  __IO uint16_t CSDS12     : 1;
  __IO uint16_t CSDS13     : 1;
  __IO uint16_t CSDS14     : 1;
  __IO uint16_t CSDS15     : 1;
} stc_mfs_csio_scstr32_field_t;

typedef struct stc_mfs_csio_scstr2_field
{
  __IO  uint8_t CSDS0      : 1;
  __IO  uint8_t CSDS1      : 1;
  __IO  uint8_t CSDS2      : 1;
  __IO  uint8_t CSDS3      : 1;
  __IO  uint8_t CSDS4      : 1;
  __IO  uint8_t CSDS5      : 1;
  __IO  uint8_t CSDS6      : 1;
  __IO  uint8_t CSDS7      : 1;
} stc_mfs_csio_scstr2_field_t;

typedef struct stc_mfs_csio_scstr3_field
{
  __IO  uint8_t CSDS8      : 1;
  __IO  uint8_t CSDS9      : 1;
  __IO  uint8_t CSDS10     : 1;
  __IO  uint8_t CSDS11     : 1;
  __IO  uint8_t CSDS12     : 1;
  __IO  uint8_t CSDS13     : 1;
  __IO  uint8_t CSDS14     : 1;
  __IO  uint8_t CSDS15     : 1;
} stc_mfs_csio_scstr3_field_t;

typedef struct stc_mfs_csio_sacsr_field
{
  __IO uint16_t TMRE       : 1;
  __IO uint16_t TDIV       : 4;
       uint16_t RESERVED1  : 1;
  __IO uint16_t TSYNE      : 1;
  __IO uint16_t TINTE      : 1;
  __IO uint16_t TINT       : 1;
       uint16_t RESERVED2  : 2;
  __IO uint16_t CSE        : 1;
  __IO uint16_t CSEIE      : 1;
  __IO uint16_t TBEEN      : 1;
       uint16_t RESERVED3  : 2;
} stc_mfs_csio_sacsr_field_t;

typedef struct stc_mfs_csio_sacsr0_field
{
  __IO  uint8_t TMRE       : 1;
  __IO  uint8_t TDIV       : 4;
        uint8_t RESERVED1  : 1;
  __IO  uint8_t TSYNE      : 1;
  __IO  uint8_t TINTE      : 1;
} stc_mfs_csio_sacsr0_field_t;

typedef struct stc_mfs_csio_sacsr1_field
{
  __IO  uint8_t TINT       : 1;
        uint8_t RESERVED1  : 2;
  __IO  uint8_t CSE        : 1;
  __IO  uint8_t CSEIE      : 1;
  __IO  uint8_t TBEEN      : 1;
        uint8_t RESERVED2  : 2;
} stc_mfs_csio_sacsr1_field_t;

typedef struct stc_mfs_csio_stmr_field
{
  __IO uint16_t TM0        : 1;
  __IO uint16_t TM1        : 1;
  __IO uint16_t TM2        : 1;
  __IO uint16_t TM3        : 1;
  __IO uint16_t TM4        : 1;
  __IO uint16_t TM5        : 1;
  __IO uint16_t TM6        : 1;
  __IO uint16_t TM7        : 1;
  __IO uint16_t TM8        : 1;
  __IO uint16_t TM9        : 1;
  __IO uint16_t TM10       : 1;
  __IO uint16_t TM11       : 1;
  __IO uint16_t TM12       : 1;
  __IO uint16_t TM13       : 1;
  __IO uint16_t TM14       : 1;
  __IO uint16_t TM15       : 1;
} stc_mfs_csio_stmr_field_t;

typedef struct stc_mfs_csio_stmr0_field
{
  __IO  uint8_t TM0        : 1;
  __IO  uint8_t TM1        : 1;
  __IO  uint8_t TM2        : 1;
  __IO  uint8_t TM3        : 1;
  __IO  uint8_t TM4        : 1;
  __IO  uint8_t TM5        : 1;
  __IO  uint8_t TM6        : 1;
  __IO  uint8_t TM7        : 1;
} stc_mfs_csio_stmr0_field_t;

typedef struct stc_mfs_csio_stmr1_field
{
  __IO  uint8_t TM8        : 1;
  __IO  uint8_t TM9        : 1;
  __IO  uint8_t TM10       : 1;
  __IO  uint8_t TM11       : 1;
  __IO  uint8_t TM12       : 1;
  __IO  uint8_t TM13       : 1;
  __IO  uint8_t TM14       : 1;
  __IO  uint8_t TM15       : 1;
} stc_mfs_csio_stmr1_field_t;

typedef struct stc_mfs_csio_stmcr_field
{
  __IO uint16_t TC0        : 1;
  __IO uint16_t TC1        : 1;
  __IO uint16_t TC2        : 1;
  __IO uint16_t TC3        : 1;
  __IO uint16_t TC4        : 1;
  __IO uint16_t TC5        : 1;
  __IO uint16_t TC6        : 1;
  __IO uint16_t TC7        : 1;
  __IO uint16_t TC8        : 1;
  __IO uint16_t TC9        : 1;
  __IO uint16_t TC10       : 1;
  __IO uint16_t TC11       : 1;
  __IO uint16_t TC12       : 1;
  __IO uint16_t TC13       : 1;
  __IO uint16_t TC14       : 1;
  __IO uint16_t TC15       : 1;
} stc_mfs_csio_stmcr_field_t;

typedef struct stc_mfs_csio_stmcr0_field
{
  __IO  uint8_t TC0        : 1;
  __IO  uint8_t TC1        : 1;
  __IO  uint8_t TC2        : 1;
  __IO  uint8_t TC3        : 1;
  __IO  uint8_t TC4        : 1;
  __IO  uint8_t TC5        : 1;
  __IO  uint8_t TC6        : 1;
  __IO  uint8_t TC7        : 1;
} stc_mfs_csio_stmcr0_field_t;

typedef struct stc_mfs_csio_stmcr1_field
{
  __IO  uint8_t TC8        : 1;
  __IO  uint8_t TC9        : 1;
  __IO  uint8_t TC10       : 1;
  __IO  uint8_t TC11       : 1;
  __IO  uint8_t TC12       : 1;
  __IO  uint8_t TC13       : 1;
  __IO  uint8_t TC14       : 1;
  __IO  uint8_t TC15       : 1;
} stc_mfs_csio_stmcr1_field_t;

