MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C58L0AGL2000A/mcu.h
typedef struct stc_can_intpnd2_field
{
  __IO uint16_t INTPND17   : 1;
  __IO uint16_t INTPND18   : 1;
  __IO uint16_t INTPND19   : 1;
  __IO uint16_t INTPND20   : 1;
  __IO uint16_t INTPND21   : 1;
  __IO uint16_t INTPND22   : 1;
  __IO uint16_t INTPND23   : 1;
  __IO uint16_t INTPND24   : 1;
  __IO uint16_t INTPND25   : 1;
  __IO uint16_t INTPND26   : 1;
  __IO uint16_t INTPND27   : 1;
  __IO uint16_t INTPND28   : 1;
  __IO uint16_t INTPND29   : 1;
  __IO uint16_t INTPND30   : 1;
  __IO uint16_t INTPND31   : 1;
  __IO uint16_t INTPND32   : 1;
} stc_can_intpnd2_field_t;

typedef struct stc_can_msgval_field
{
  __IO uint32_t MSGVAL1    : 1;
  __IO uint32_t MSGVAL2    : 1;
  __IO uint32_t MSGVAL3    : 1;
  __IO uint32_t MSGVAL4    : 1;
  __IO uint32_t MSGVAL5    : 1;
  __IO uint32_t MSGVAL6    : 1;
  __IO uint32_t MSGVAL7    : 1;
  __IO uint32_t MSGVAL8    : 1;
  __IO uint32_t MSGVAL9    : 1;
  __IO uint32_t MSGVAL10   : 1;
  __IO uint32_t MSGVAL11   : 1;
  __IO uint32_t MSGVAL12   : 1;
  __IO uint32_t MSGVAL13   : 1;
  __IO uint32_t MSGVAL14   : 1;
  __IO uint32_t MSGVAL15   : 1;
  __IO uint32_t MSGVAL16   : 1;
  __IO uint32_t MSGVAL17   : 1;
  __IO uint32_t MSGVAL18   : 1;
  __IO uint32_t MSGVAL19   : 1;
  __IO uint32_t MSGVAL20   : 1;
  __IO uint32_t MSGVAL21   : 1;
  __IO uint32_t MSGVAL22   : 1;
  __IO uint32_t MSGVAL23   : 1;
  __IO uint32_t MSGVAL24   : 1;
  __IO uint32_t MSGVAL25   : 1;
  __IO uint32_t MSGVAL26   : 1;
  __IO uint32_t MSGVAL27   : 1;
  __IO uint32_t MSGVAL28   : 1;
  __IO uint32_t MSGVAL29   : 1;
  __IO uint32_t MSGVAL30   : 1;
  __IO uint32_t MSGVAL31   : 1;
  __IO uint32_t MSGVAL32   : 1;
} stc_can_msgval_field_t;

typedef struct stc_can_msgval1_field
{
  __IO uint16_t MSGVAL1    : 1;
  __IO uint16_t MSGVAL2    : 1;
  __IO uint16_t MSGVAL3    : 1;
  __IO uint16_t MSGVAL4    : 1;
  __IO uint16_t MSGVAL5    : 1;
  __IO uint16_t MSGVAL6    : 1;
  __IO uint16_t MSGVAL7    : 1;
  __IO uint16_t MSGVAL8    : 1;
  __IO uint16_t MSGVAL9    : 1;
  __IO uint16_t MSGVAL10   : 1;
  __IO uint16_t MSGVAL11   : 1;
  __IO uint16_t MSGVAL12   : 1;
  __IO uint16_t MSGVAL13   : 1;
  __IO uint16_t MSGVAL14   : 1;
  __IO uint16_t MSGVAL15   : 1;
  __IO uint16_t MSGVAL16   : 1;
} stc_can_msgval1_field_t;

typedef struct stc_can_msgval2_field
{
  __IO uint16_t MSGVAL17   : 1;
  __IO uint16_t MSGVAL18   : 1;
  __IO uint16_t MSGVAL19   : 1;
  __IO uint16_t MSGVAL20   : 1;
  __IO uint16_t MSGVAL21   : 1;
  __IO uint16_t MSGVAL22   : 1;
  __IO uint16_t MSGVAL23   : 1;
  __IO uint16_t MSGVAL24   : 1;
  __IO uint16_t MSGVAL25   : 1;
  __IO uint16_t MSGVAL26   : 1;
  __IO uint16_t MSGVAL27   : 1;
  __IO uint16_t MSGVAL28   : 1;
  __IO uint16_t MSGVAL29   : 1;
  __IO uint16_t MSGVAL30   : 1;
  __IO uint16_t MSGVAL31   : 1;
  __IO uint16_t MSGVAL32   : 1;
} stc_can_msgval2_field_t;

/******************************************************************************
 * ETHERNET_MAC_MODULE
 ******************************************************************************/
/* ETHERNET_MAC_MODULE register bit fields */
typedef struct stc_ethernet_mac_mcr_field
{
       uint32_t RESERVED1  : 2;
  __IO uint32_t RE         : 1;
  __IO uint32_t TE         : 1;
  __IO uint32_t DC         : 1;
  __IO uint32_t BL         : 2;
  __IO uint32_t ACS        : 1;
  __IO uint32_t LUD        : 1;
  __IO uint32_t DR         : 1;
  __IO uint32_t IPC        : 1;
  __IO uint32_t DM         : 1;
  __IO uint32_t LM         : 1;
  __IO uint32_t DO         : 1;
  __IO uint32_t FES        : 1;
  __IO uint32_t PS         : 1;
  __IO uint32_t DCRS       : 1;
  __IO uint32_t IFG        : 3;
  __IO uint32_t JE         : 1;
  __IO uint32_t BE         : 1;
  __IO uint32_t JD         : 1;
  __IO uint32_t WD         : 1;
  __IO uint32_t TC         : 1;
  __IO uint32_t CST        : 1;
} stc_ethernet_mac_mcr_field_t;

typedef struct stc_ethernet_mac_mffr_field
{
  __IO uint32_t PR         : 1;
  __IO uint32_t HUC        : 1;
  __IO uint32_t HMC        : 1;
  __IO uint32_t DAIF       : 1;
  __IO uint32_t PM         : 1;
  __IO uint32_t DB         : 1;
  __IO uint32_t PCF        : 2;
  __IO uint32_t SAIF       : 1;
  __IO uint32_t SAF        : 1;
  __IO uint32_t HPF        : 1;
       uint32_t RESERVED1  : 20;
  __IO uint32_t RA         : 1;
} stc_ethernet_mac_mffr_field_t;

typedef struct stc_ethernet_mac_mhtrh_field
{
  __IO uint32_t HTH        : 32;
} stc_ethernet_mac_mhtrh_field_t;

typedef struct stc_ethernet_mac_mhtrl_field
{
  __IO uint32_t HTL        : 32;
} stc_ethernet_mac_mhtrl_field_t;

typedef struct stc_ethernet_mac_gar_field
{
  __IO uint32_t GB         : 1;
  __IO uint32_t GW         : 1;
  __IO uint32_t CR         : 4;
  __IO uint32_t GR         : 5;
  __IO uint32_t PA         : 5;
} stc_ethernet_mac_gar_field_t;

typedef struct stc_ethernet_mac_gdr_field
{
  __IO uint32_t GD         : 16;
} stc_ethernet_mac_gdr_field_t;

typedef struct stc_ethernet_mac_fcr_field
{
  __IO uint32_t FCB_BPA    : 1;
  __IO uint32_t TFE        : 1;
  __IO uint32_t RFE        : 1;
  __IO uint32_t UP         : 1;
  __IO uint32_t PLT        : 2;
       uint32_t RESERVED1  : 1;
  __IO uint32_t DZPQ       : 1;
       uint32_t RESERVED2  : 8;
  __IO uint32_t PT         : 16;
} stc_ethernet_mac_fcr_field_t;

typedef struct stc_ethernet_mac_vtr_field
{
  __IO uint32_t VL         : 16;
  __IO uint32_t ETV        : 1;
} stc_ethernet_mac_vtr_field_t;

typedef struct stc_ethernet_mac_rwffr_field
{
  __IO uint32_t RWFFR      : 32;
} stc_ethernet_mac_rwffr_field_t;

typedef struct stc_ethernet_mac_pmtr_field
{
  __IO uint32_t PD         : 1;
  __IO uint32_t MPE        : 1;
  __IO uint32_t WFE        : 1;
       uint32_t RESERVED1  : 2;
  __IO uint32_t MPR        : 1;
  __IO uint32_t WPR        : 1;
       uint32_t RESERVED2  : 2;
  __IO uint32_t GU         : 1;
       uint32_t RESERVED3  : 21;
  __IO uint32_t RWFFRPR    : 1;
} stc_ethernet_mac_pmtr_field_t;

typedef struct stc_ethernet_mac_lpicsr_field
{
  __IO uint32_t TLPIEN     : 1;
  __IO uint32_t TLPIEX     : 1;
  __IO uint32_t RLPIEN     : 1;
  __IO uint32_t RLPIEX     : 1;
       uint32_t RESERVED1  : 4;
  __IO uint32_t TLPIST     : 1;
  __IO uint32_t RLPIST     : 1;
       uint32_t RESERVED2  : 6;
  __IO uint32_t LPIEN      : 1;
  __IO uint32_t PLS        : 1;
  __IO uint32_t PLSEN      : 1;
  __IO uint32_t LPITXA     : 1;
} stc_ethernet_mac_lpicsr_field_t;

typedef struct stc_ethernet_mac_lpitcr_field
{
  __IO uint32_t TWT        : 16;
  __IO uint32_t LIT        : 10;
} stc_ethernet_mac_lpitcr_field_t;

typedef struct stc_ethernet_mac_isr_field
{
  __IO uint32_t RGIS       : 1;
       uint32_t RESERVED1  : 2;
  __IO uint32_t PIS        : 1;
  __IO uint32_t MIS        : 1;
  __IO uint32_t RIS        : 1;
  __IO uint32_t TIS        : 1;
  __IO uint32_t COIS       : 1;
       uint32_t RESERVED2  : 1;
  __IO uint32_t TSIS       : 1;
  __IO uint32_t LPIIS      : 1;
} stc_ethernet_mac_isr_field_t;

typedef struct stc_ethernet_mac_imr_field
{
  __IO uint32_t RGIM       : 1;
       uint32_t RESERVED1  : 2;
  __IO uint32_t PIM        : 1;
       uint32_t RESERVED2  : 5;
  __IO uint32_t TSIM       : 1;
  __IO uint32_t LPIIM      : 1;
} stc_ethernet_mac_imr_field_t;

typedef struct stc_ethernet_mac_mar0h_field
{
  __IO uint32_t A0         : 16;
       uint32_t RESERVED1  : 15;
  __IO uint32_t MO         : 1;
} stc_ethernet_mac_mar0h_field_t;

typedef struct stc_ethernet_mac_mar0l_field
{
  __IO uint32_t A0         : 32;
} stc_ethernet_mac_mar0l_field_t;

typedef struct stc_ethernet_mac_marh_field
{
  __IO uint32_t A          : 16;
       uint32_t RESERVED1  : 8;
  __IO uint32_t MBC        : 6;
  __IO uint32_t SA         : 1;
  __IO uint32_t AE         : 1;
} stc_ethernet_mac_marh_field_t;

typedef struct stc_ethernet_mac_marl_field
{
  __IO uint32_t A          : 32;
} stc_ethernet_mac_marl_field_t;

