MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C58L0AGL2000A/mcu.h
typedef struct stc_sdif_sacmdest_field
{
  __IO uint16_t ACMD12NOEX: 1;
  __IO uint16_t ACMDTOERR : 1;
  __IO uint16_t ACMDCRCERR: 1;
  __IO uint16_t ACMDEBERR : 1;
  __IO uint16_t ACMDIDXERR: 1;
       uint16_t RESERVED1 : 2;
  __IO uint16_t CMDND12ERR: 1;
       uint16_t RESERVED2 : 8;
} stc_sdif_sacmdest_field_t;

typedef struct stc_sdif_shctl2_field
{
  __IO uint16_t UHSMDSEL  : 3;
  __IO uint16_t V18SGNEN  : 1;
  __IO uint16_t DRVSEL    : 2;
  __IO uint16_t DOTUING   : 1;
  __IO uint16_t SMPCLKSEK : 1;
       uint16_t RESERVED1 : 6;
  __IO uint16_t ASYINTEN  : 1;
  __IO uint16_t PREVALEN  : 1;
} stc_sdif_shctl2_field_t;

typedef struct stc_sdif_capblty0_field
{
  __IO uint16_t TOCLKFREQ : 6;
       uint16_t RESERVED1 : 1;
  __IO uint16_t TOCLKUNIT : 1;
  __IO uint16_t SDBASECLK : 8;
} stc_sdif_capblty0_field_t;

typedef struct stc_sdif_capblty1_field
{
  __IO uint16_t MAXBLCKLEN: 2;
  __IO uint16_t EMBD8BIT  : 1;
  __IO uint16_t ADMA2SPT  : 1;
       uint16_t RESERVED1 : 1;
  __IO uint16_t HGHSPDSPT : 1;
  __IO uint16_t SDMASPT   : 1;
  __IO uint16_t LWPWRSPT  : 1;
  __IO uint16_t V33SPT    : 1;
  __IO uint16_t V30SPT    : 1;
  __IO uint16_t V18SPT    : 1;
       uint16_t RESERVED2 : 1;
  __IO uint16_t BUS64SPT  : 1;
  __IO uint16_t ASYINTSPT : 1;
  __IO uint16_t STOPTYPE  : 2;
} stc_sdif_capblty1_field_t;

typedef struct stc_sdif_capblty2_field
{
  __IO uint16_t SDR50SPT  : 1;
  __IO uint16_t SDR104SPT : 1;
  __IO uint16_t DDR50SPT  : 1;
       uint16_t RESERVED1 : 1;
  __IO uint16_t DRVTPASPT : 1;
  __IO uint16_t DRVTPBSPT : 1;
  __IO uint16_t DRVTPCSPT : 1;
       uint16_t RESERVED2 : 1;
  __IO uint16_t TMCNTRETN : 4;
       uint16_t RESERVED3 : 1;
  __IO uint16_t USETNSDR50: 1;
  __IO uint16_t RETNMODE  : 2;
} stc_sdif_capblty2_field_t;

typedef struct stc_sdif_capblty3_field
{
  __IO uint16_t CLKMULTPL : 8;
       uint16_t RESERVED1 : 8;
} stc_sdif_capblty3_field_t;

typedef struct stc_sdif_mxccapy0_field
{
  __IO uint16_t V33MAXCUR : 8;
  __IO uint16_t V30MAXCUR : 8;
} stc_sdif_mxccapy0_field_t;

typedef struct stc_sdif_mxccapy1_field
{
  __IO uint16_t V18MAXCUR : 8;
       uint16_t RESERVED1 : 8;
} stc_sdif_mxccapy1_field_t;

typedef struct stc_sdif_mxccapy2_field
{
       uint16_t RESERVED1 : 16;
} stc_sdif_mxccapy2_field_t;

typedef struct stc_sdif_mxccapy3_field
{
       uint16_t RESERVED1 : 16;
} stc_sdif_mxccapy3_field_t;

typedef struct stc_sdif_feacest_field
{
  __IO uint16_t FEVNT12ND : 1;
  __IO uint16_t FEVNTTO   : 1;
  __IO uint16_t FEVNTCRC  : 1;
  __IO uint16_t FEVNTEB   : 1;
  __IO uint16_t FEVNTIDX  : 1;
       uint16_t RESERVED1 : 2;
  __IO uint16_t FEVNTCMD12: 1;
       uint16_t RESERVED2 : 8;
} stc_sdif_feacest_field_t;

typedef struct stc_sdif_sfeeist_field
{
  __IO uint16_t FETOERR   : 1;
  __IO uint16_t FECRCERR  : 1;
  __IO uint16_t FEEBERR   : 1;
  __IO uint16_t FEIDXERR  : 1;
  __IO uint16_t FEDTOTERR : 1;
  __IO uint16_t FEDTCRCERR: 1;
  __IO uint16_t FEDTEBERR : 1;
  __IO uint16_t FECRLTERR : 1;
  __IO uint16_t FEA12ERR  : 1;
  __IO uint16_t FEADMAERR : 1;
  __IO uint16_t FETUNEERR : 1;
       uint16_t RESERVED1 : 1;
  __IO uint16_t FEACKERR  : 1;
  __IO uint16_t FEA19ERR  : 1;
  __IO uint16_t FEAHBMSERR: 1;
       uint16_t RESERVED2 : 1;
} stc_sdif_sfeeist_field_t;

typedef struct stc_sdif_admaest_field
{
  __IO uint8_t ADMAERRS  : 2;
  __IO uint8_t ADMALENME : 1;
       uint8_t RESERVED1 : 5;
} stc_sdif_admaest_field_t;

typedef struct stc_sdif_sadsa0_field
{
  __IO uint16_t ADR1500   : 16;
} stc_sdif_sadsa0_field_t;

typedef struct stc_sdif_sadsa1_field
{
  __IO uint16_t ADR3116   : 16;
} stc_sdif_sadsa1_field_t;

typedef struct stc_sdif_sadsa2_field
{
  __IO uint16_t ADR4732   : 16;
} stc_sdif_sadsa2_field_t;

typedef struct stc_sdif_sadsa3_field
{
  __IO uint16_t ADR6348   : 16;
} stc_sdif_sadsa3_field_t;

typedef struct stc_sdif_sprval0_field
{
  __IO uint16_t SCFSELVAL : 10;
  __IO uint16_t CGSELVAL  : 1;
       uint16_t RESERVED1 : 2;
  __IO uint16_t DSSELVAL  : 2;
} stc_sdif_sprval0_field_t;

typedef struct stc_sdif_sprval1_field
{
  __IO uint16_t SCFSELVAL : 10;
  __IO uint16_t CGSELVAL  : 1;
       uint16_t RESERVED1 : 2;
  __IO uint16_t DSSELVAL  : 2;
} stc_sdif_sprval1_field_t;

typedef struct stc_sdif_sprval2_field
{
  __IO uint16_t SCFSELVAL : 10;
  __IO uint16_t CGSELVAL  : 1;
       uint16_t RESERVED1 : 2;
  __IO uint16_t DSSELVAL  : 2;
} stc_sdif_sprval2_field_t;

typedef struct stc_sdif_sprval3_field
{
  __IO uint16_t SCFSELVAL : 10;
  __IO uint16_t CGSELVAL  : 1;
       uint16_t RESERVED1 : 2;
  __IO uint16_t DSSELVAL  : 2;
} stc_sdif_sprval3_field_t;

typedef struct stc_sdif_sprval4_field
{
  __IO uint16_t SCFSELVAL : 10;
  __IO uint16_t CGSELVAL  : 1;
       uint16_t RESERVED1 : 2;
  __IO uint16_t DSSELVAL  : 2;
} stc_sdif_sprval4_field_t;

typedef struct stc_sdif_sprval5_field
{
  __IO uint16_t SCFSELVAL : 10;
  __IO uint16_t CGSELVAL  : 1;
       uint16_t RESERVED1 : 2;
  __IO uint16_t DSSELVAL  : 2;
} stc_sdif_sprval5_field_t;

typedef struct stc_sdif_sprval6_field
{
  __IO uint16_t SCFSELVAL : 10;
  __IO uint16_t CGSELVAL  : 1;
       uint16_t RESERVED1 : 2;
  __IO uint16_t DSSELVAL  : 2;
} stc_sdif_sprval6_field_t;

typedef struct stc_sdif_sprval7_field
{
  __IO uint16_t SCFSELVAL : 10;
  __IO uint16_t CGSELVAL  : 1;
       uint16_t RESERVED1 : 2;
  __IO uint16_t DSSELVAL  : 2;
} stc_sdif_sprval7_field_t;

typedef struct stc_sdif_sshbctll_field
{
  __IO uint16_t CLCKPIN   : 3;
       uint16_t RESERVED1 : 1;
  __IO uint16_t INTINPIN  : 2;
       uint16_t RESERVED2 : 2;
  __IO uint16_t BUSWDPRST : 7;
       uint16_t RESERVED3 : 1;
} stc_sdif_sshbctll_field_t;

typedef struct stc_sdif_sshbctlh_field
{
  __IO uint16_t CLCKPINSEL: 3;
       uint16_t RESERVED1 : 1;
  __IO uint16_t INTPINSEL : 3;
       uint16_t RESERVED2 : 1;
  __IO uint16_t BEPWRCTL  : 7;
       uint16_t RESERVED3 : 1;
} stc_sdif_sshbctlh_field_t;


typedef struct stc_sdif_sslist_field
{
  __IO uint16_t SLOTINTSGN: 8;
       uint16_t RESERVED1 : 8;
} stc_sdif_sslist_field_t;

typedef struct stc_sdif_shctlv_field
{
  __IO uint16_t SPECVERNUM: 8;
  __IO uint16_t VNDVERNUM : 8;
} stc_sdif_shctlv_field_t;

typedef struct stc_sdif_ahbcfgl_field
{
  __IO uint16_t INCRSEL   : 3;
  __IO uint16_t SINEN     : 1;
  __IO uint16_t BSLOCK    : 1;
  __IO uint16_t BSLOCKSEL : 1;
  __IO uint16_t ENDIANSEL : 1;
       uint16_t RESERVED1 : 9;
} stc_sdif_ahbcfgl_field_t;

typedef struct stc_sdif_ahbcfgh_field
{
       uint16_t RESERVED1 : 16;
} stc_sdif_ahbcfgh_field_t;

typedef struct stc_sdif_spwswcl_field
{
  __IO uint16_t ATPWRSWEN : 1;
  __IO uint16_t IOREGSEL  : 1;
       uint16_t RESERVED1 : 14;
} stc_sdif_spwswcl_field_t;

