MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C58L0AGL2000A/mcu.h
/******************************************************************************
 * LCR_MODULE
 ******************************************************************************/
/* Low-speed CR prescaler registers */
typedef struct
{
  union {
    __IO  uint8_t LCR_PRSLD;
    stc_lcr_lcr_prsld_field_t LCR_PRSLD_f;
  };
}FM4_LCR_TypeDef;

/******************************************************************************
 * CLK_GATING_MODULE
 ******************************************************************************/
/* CLK_GATING registers */
typedef struct
{
  union {
    __IO uint32_t CKEN0;
    stc_clk_gating_cken0_field_t CKEN0_f;
  };
  union {
    __IO uint32_t MRST0;
    stc_clk_gating_mrst0_field_t MRST0_f;
  };
       uint8_t RESERVED1[8];
  union {
    __IO uint32_t CKEN1;
    stc_clk_gating_cken1_field_t CKEN1_f;
  };
  union {
    __IO uint32_t MRST1;
    stc_clk_gating_mrst1_field_t MRST1_f;
  };
       uint8_t RESERVED3[8];
  union {
    __IO uint32_t CKEN2;
    stc_clk_gating_cken2_field_t CKEN2_f;
  };
  union {
    __IO uint32_t MRST2;
    stc_clk_gating_mrst2_field_t MRST2_f;
  };
}FM4_CLK_GATING_TypeDef;

/******************************************************************************
 * PLL_CONTROL_MODULE
 ******************************************************************************/
/* PLL_CONTROL registers */
typedef struct
{
  __IO uint32_t SSCTL1;
  __IO uint32_t SSCTL2;
}FM4_PLL_CONTROL_TypeDef;

/******************************************************************************
 * I2SPRE_MODULE
 ******************************************************************************/
/* I2SPRE registers */
typedef struct
{
  union {
    __IO uint32_t ICCR;
    stc_i2spre_iccr_field_t ICCR_f;
  };
  union {
    __IO uint32_t IPCR1;
    stc_i2spre_ipcr1_field_t IPCR1_f;
  };
  union {
    __IO uint32_t IPCR2;
    stc_i2spre_ipcr2_field_t IPCR2_f;
  };
  union {
    __IO uint32_t IPCR3;
    stc_i2spre_ipcr3_field_t IPCR3_f;
  };
  union {
    __IO uint32_t IPCR4;
    stc_i2spre_ipcr4_field_t IPCR4_f;
  };
  union {
    __IO uint32_t IP_STR;
    stc_i2spre_ip_str_field_t IP_STR_f;
  };
  union {
    __IO uint32_t IPINT_ENR;
    stc_i2spre_ipint_enr_field_t IPINT_ENR_f;
  };
  union {
    __IO uint32_t IPINT_CLR;
    stc_i2spre_ipint_clr_field_t IPINT_CLR_f;
  };
  union {
    __IO uint32_t IPINT_STR;
    stc_i2spre_ipint_str_field_t IPINT_STR_f;
  };
  union {
    __IO uint32_t IPCR5;
    stc_i2spre_ipcr5_field_t IPCR5_f;
  };
}FM4_I2SPRE_TypeDef;

/******************************************************************************
 * EXBUS_MODULE
 ******************************************************************************/
/* External bus interface registers */
typedef struct
{
  union {
    __IO uint32_t MODE0;
    stc_exbus_mode_field_t MODE0_f;
  };
  union {
    __IO uint32_t MODE1;
    stc_exbus_mode_field_t MODE1_f;
  };
  union {
    __IO uint32_t MODE2;
    stc_exbus_mode_field_t MODE2_f;
  };
  union {
    __IO uint32_t MODE3;
    stc_exbus_mode_field_t MODE3_f;
  };
  union {
    __IO uint32_t MODE4;
    stc_exbus_mode_field_t MODE4_f;
  };
  union {
    __IO uint32_t MODE5;
    stc_exbus_mode_field_t MODE5_f;
  };
  union {
    __IO uint32_t MODE6;
    stc_exbus_mode_field_t MODE6_f;
  };
  union {
    __IO uint32_t MODE7;
    stc_exbus_mode_field_t MODE7_f;
  };
  union {
    __IO uint32_t TIM0;
    stc_exbus_tim_field_t TIM0_f;
  };
  __IO uint32_t TIM1;
  union {
    __IO uint32_t TIM2;
    stc_exbus_tim_field_t TIM2_f;
  };
  union {
    __IO uint32_t TIM3;
    stc_exbus_tim_field_t TIM3_f;
  };
  union {
    __IO uint32_t TIM4;
    stc_exbus_tim_field_t TIM4_f;
  };
  union {
    __IO uint32_t TIM5;
    stc_exbus_tim_field_t TIM5_f;
  };
  union {
    __IO uint32_t TIM6;
    stc_exbus_tim_field_t TIM6_f;
  };
  union {
    __IO uint32_t TIM7;
    stc_exbus_tim_field_t TIM7_f;
  };
  union {
    __IO uint32_t AREA0;
    stc_exbus_area_field_t AREA0_f;
  };
  union {
    __IO uint32_t AREA1;
    stc_exbus_area_field_t AREA1_f;
  };
  union {
    __IO uint32_t AREA2;
    stc_exbus_area_field_t AREA2_f;
  };
  union {
    __IO uint32_t AREA3;
    stc_exbus_area_field_t AREA3_f;
  };
  union {
    __IO uint32_t AREA4;
    stc_exbus_area_field_t AREA4_f;
  };
  union {
    __IO uint32_t AREA5;
    stc_exbus_area_field_t AREA5_f;
  };
  union {
    __IO uint32_t AREA6;
    stc_exbus_area_field_t AREA6_f;
  };
  union {
    __IO uint32_t AREA7;
    stc_exbus_area_field_t AREA7_f;
  };
  union {
    __IO uint32_t ATIM0;
    stc_exbus_atim_field_t ATIM0_f;
  };
  union {
    __IO uint32_t ATIM1;
    stc_exbus_atim_field_t ATIM1_f;
  };
  union {
    __IO uint32_t ATIM2;
    stc_exbus_atim_field_t ATIM2_f;
  };
  union {
    __IO uint32_t ATIM3;
    stc_exbus_atim_field_t ATIM3_f;
  };
  union {
    __IO uint32_t ATIM4;
    stc_exbus_atim_field_t ATIM4_f;
  };
  union {
    __IO uint32_t ATIM5;
    stc_exbus_atim_field_t ATIM5_f;
  };
  union {
    __IO uint32_t ATIM6;
    stc_exbus_atim_field_t ATIM6_f;
  };
  union {
    __IO uint32_t ATIM7;
    stc_exbus_atim_field_t ATIM7_f;
  };
    uint8_t RESERVED1[128];
  union {
    __IO uint32_t SDMODE;
    stc_exbus_sdmode_field_t SDMODE_f;
  };
  union {
    __IO uint32_t REFTIM;
    stc_exbus_reftim_field_t REFTIM_f;
  };
  union {
    __IO uint32_t PWRDWN;
    stc_exbus_pwrdwn_field_t PWRDWN_f;
  };
  union {
    __IO uint32_t SDTIM;
    stc_exbus_sdtim_field_t SDTIM_f;
  };
  union {
    __IO uint32_t SDCMD;
    stc_exbus_sdcmd_field_t SDCMD_f;
  };
    uint8_t RESERVED2[236];
  union {
    __IO uint32_t MEMCERR;
    stc_exbus_memcerr_field_t MEMCERR_f;
  };
    uint8_t RESERVED3[252];
  union {
    __IO uint32_t DCLKR;
    stc_exbus_dclkr_field_t DCLKR_f;
  };
  union {
    __IO uint32_t EST;
    stc_exbus_est_field_t EST_f;
  };
  union {
    __IO uint32_t WEAD;
    stc_exbus_wead_field_t WEAD_f;
  };
  union {
    __IO uint32_t ESCLR;
    stc_exbus_esclr_field_t ESCLR_f;
  };
  union {
    __IO uint32_t AMODE;
    stc_exbus_amode_field_t AMODE_f;
  };
}FM4_EXBUS_TypeDef;

