MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C58L0AGL2000A/mcu.h
/******************************************************************************
 * CAN_MODULE
 ******************************************************************************/
/* CAN channel 0 registers */
typedef struct
{
  union {
    __IO uint16_t CTRLR;
    stc_can_ctrlr_field_t CTRLR_f;
  };
  union {
    __IO uint16_t STATR;
    stc_can_statr_field_t STATR_f;
  };
  union {
    __IO uint16_t ERRCNT;
    stc_can_errcnt_field_t ERRCNT_f;
  };
  union {
    __IO uint16_t BTR;
    stc_can_btr_field_t BTR_f;
  };
  union {
    __IO uint16_t INTR;
    stc_can_intr_field_t INTR_f;
  };
  union {
    __IO uint16_t TESTR;
    stc_can_testr_field_t TESTR_f;
  };
  union {
    __IO uint16_t BRPER;
    stc_can_brper_field_t BRPER_f;
  };
        uint8_t RESERVED0[2];
  union {
    __IO uint16_t IF1CREQ;
    stc_can_if1creq_field_t IF1CREQ_f;
  };
  union {
    __IO uint16_t IF1CMSK;
    stc_can_if1cmsk_field_t IF1CMSK_f;
  };
  union {
    union {
      __IO uint32_t IF1MSK;
      stc_can_if1msk_field_t IF1MSK_f;
    };
    struct {
      __IO uint16_t IF1MSK1;
      union {
        __IO uint16_t IF1MSK2;
        stc_can_if1msk2_field_t IF1MSK2_f;
      };
    };
  };
  union {
    union {
      __IO uint32_t IF1ARB;
      stc_can_if1arb_field_t IF1ARB_f;
    };
    struct {
      __IO uint16_t IF1ARB1;
      union {
        __IO uint16_t IF1ARB2;
        stc_can_if1arb2_field_t IF1ARB2_f;
      };
    };
  };
  union {
    __IO uint16_t IF1MCTR;
    stc_can_if1mctr_field_t IF1MCTR_f;
  };
        uint8_t RESERVED1[2];
  union {
    __IO uint32_t IF1DTA_L;
    struct {
      __IO uint16_t IF1DTA1_L;
      __IO uint16_t IF1DTA2_L;
    };
  };
  union {
    __IO uint32_t IF1DTB_L;
    struct {
      __IO uint16_t IF1DTB1_L;
      __IO uint16_t IF1DTB2_L;
    };
  };
        uint8_t RESERVED2[8];
  union {
    __IO uint32_t IF1DTA_B;
    struct {
      __IO uint16_t IF1DTA2_B;
      __IO uint16_t IF1DTA1_B;
    };
  };
  union {
    __IO uint32_t IF1DTB_B;
    struct {
      __IO uint16_t IF1DTB2_B;
      __IO uint16_t IF1DTB1_B;
    };
  };
        uint8_t RESERVED3[8];
  union {
    __IO uint16_t IF2CREQ;
    stc_can_if2creq_field_t IF2CREQ_f;
  };
  union {
    __IO uint16_t IF2CMSK;
    stc_can_if2cmsk_field_t IF2CMSK_f;
  };
  union {
    union {
      __IO uint32_t IF2MSK;
      stc_can_if2msk_field_t IF2MSK_f;
    };
    struct {
      __IO uint16_t IF2MSK1;
      union {
        __IO uint16_t IF2MSK2;
        stc_can_if2msk2_field_t IF2MSK2_f;
      };
    };
  };
  union {
    __IO uint32_t IF2ARB;
    struct {
      __IO uint16_t IF2ARB1;
      union {
        __IO uint16_t IF2ARB2;
        stc_can_if2arb2_field_t IF2ARB2_f;
      };
    };
  };
  union {
    __IO uint16_t IF2MCTR;
    stc_can_if2mctr_field_t IF2MCTR_f;
  };
        uint8_t RESERVED4[2];
  union {
    __IO uint32_t IF2DTA_L;
    struct {
      __IO uint16_t IF2DTA1_L;
      __IO uint16_t IF2DTA2_L;
    };
  };
  union {
    __IO uint32_t IF2DTB_L;
    struct {
      __IO uint16_t IF2DTB1_L;
      __IO uint16_t IF2DTB2_L;
    };
  };
        uint8_t RESERVED5[8];
  union {
    __IO uint32_t IF2DTA_B;
    struct {
      __IO uint16_t IF2DTA2_B;
      __IO uint16_t IF2DTA1_B;
    };
  };
  union {
    __IO uint32_t IF2DTB_B;
    struct {
      __IO uint16_t IF2DTB2_B;
      __IO uint16_t IF2DTB1_B;
    };
  };
        uint8_t RESERVED6[24];
  union {
    union {
      __IO uint32_t TREQR;
      stc_can_treqr_field_t TREQR_f;
    };
    struct {
      union {
        __IO uint16_t TREQR1;
        stc_can_treqr1_field_t TREQR1_f;
      };
      union {
        __IO uint16_t TREQR2;
        stc_can_treqr2_field_t TREQR2_f;
      };
    };
  };
        uint8_t RESERVED7[12];
  union {
    union {
      __IO uint32_t NEWDT;
      stc_can_newdt_field_t NEWDT_f;
    };
    struct {
      union {
        __IO uint16_t NEWDT1;
        stc_can_newdt1_field_t NEWDT1_f;
      };
      __IO uint16_t NEWDT2;
    };
  };
        uint8_t RESERVED8[12];
  union {
    union {
      __IO uint32_t INTPND;
      stc_can_intpnd_field_t INTPND_f;
    };
    struct {
      union {
        __IO uint16_t INTPND1;
        stc_can_intpnd1_field_t INTPND1_f;
      };
      union {
        __IO uint16_t INTPND2;
        stc_can_intpnd2_field_t INTPND2_f;
      };
    };
  };
        uint8_t RESERVED9[12];
  union {
    union {
      __IO uint32_t MSGVAL;
      stc_can_msgval_field_t MSGVAL_f;
    };
    struct {
      union {
        __IO uint16_t MSGVAL1;
        stc_can_msgval1_field_t MSGVAL1_f;
      };
      union {
        __IO uint16_t MSGVAL2;
        stc_can_msgval2_field_t MSGVAL2_f;
      };
    };
  };
}FM4_CAN_TypeDef;

/******************************************************************************
 * ETHERNET_MAC_MODULE
 ******************************************************************************/
/* ETHERNET_MAC registers */
typedef struct
{
  union {
    __IO uint32_t MCR;
    stc_ethernet_mac_mcr_field_t MCR_f;
  };
  union {
    __IO uint32_t MFFR;
    stc_ethernet_mac_mffr_field_t MFFR_f;
  };
  union {
    __IO uint32_t MHTRH;
    stc_ethernet_mac_mhtrh_field_t MHTRH_f;
  };
  union {
    __IO uint32_t MHTRL;
    stc_ethernet_mac_mhtrl_field_t MHTRL_f;
  };
  union {
    __IO uint32_t GAR;
    stc_ethernet_mac_gar_field_t GAR_f;
  };
  union {
    __IO uint32_t GDR;
    stc_ethernet_mac_gdr_field_t GDR_f;
  };
  union {
    __IO uint32_t FCR;
    stc_ethernet_mac_fcr_field_t FCR_f;
  };
  union {
    __IO uint32_t VTR;
    stc_ethernet_mac_vtr_field_t VTR_f;
  };
        uint8_t RESERVED1[8];
  union {
    __IO uint32_t RWFFR;
    stc_ethernet_mac_rwffr_field_t RWFFR_f;
  };
  union {
    __IO uint32_t PMTR;
    stc_ethernet_mac_pmtr_field_t PMTR_f;
  };
  union {
    __IO uint32_t LPICSR;
    stc_ethernet_mac_lpicsr_field_t LPICSR_f;
  };
  union {
    __IO uint32_t LPITCR;
    stc_ethernet_mac_lpitcr_field_t LPITCR_f;
  };
  union {
    __IO uint32_t ISR;
    stc_ethernet_mac_isr_field_t ISR_f;
  };
  union {
    __IO uint32_t IMR;
    stc_ethernet_mac_imr_field_t IMR_f;
  };
  union {
    __IO uint32_t MAR0H;
    stc_ethernet_mac_mar0h_field_t MAR0H_f;
  };
  union {
    __IO uint32_t MAR0L;
    stc_ethernet_mac_mar0l_field_t MAR0L_f;
  };
  union {
    __IO uint32_t MAR1H;
    stc_ethernet_mac_marh_field_t MAR1H_f;
  };
  union {
    __IO uint32_t MAR1L;
    stc_ethernet_mac_marl_field_t MAR1L_f;
  };
  union {
    __IO uint32_t MAR2H;
    stc_ethernet_mac_marh_field_t MAR2H_f;
  };
  union {
    __IO uint32_t MAR2L;
    stc_ethernet_mac_marl_field_t MAR2L_f;
  };
  union {
    __IO uint32_t MAR3H;
    stc_ethernet_mac_marh_field_t MAR3H_f;
  };
  union {
    __IO uint32_t MAR3L;
    stc_ethernet_mac_marl_field_t MAR3L_f;
  };
  union {
    __IO uint32_t MAR4H;
    stc_ethernet_mac_marh_field_t MAR4H_f;
  };
  union {
    __IO uint32_t MAR4L;
    stc_ethernet_mac_marl_field_t MAR4L_f;
  };
  union {
    __IO uint32_t MAR5H;
    stc_ethernet_mac_marh_field_t MAR5H_f;
  };
  union {
    __IO uint32_t MAR5L;
    stc_ethernet_mac_marl_field_t MAR5L_f;
  };
  union {
    __IO uint32_t MAR6H;
    stc_ethernet_mac_marh_field_t MAR6H_f;
  };
  union {
    __IO uint32_t MAR6L;
    stc_ethernet_mac_marl_field_t MAR6L_f;
  };
  union {
    __IO uint32_t MAR7H;
    stc_ethernet_mac_marh_field_t MAR7H_f;
  };
  union {
    __IO uint32_t MAR7L;
    stc_ethernet_mac_marl_field_t MAR7L_f;
  };
  union {
    __IO uint32_t MAR8H;
    stc_ethernet_mac_marh_field_t MAR8H_f;
  };
  union {
    __IO uint32_t MAR8L;
    stc_ethernet_mac_marl_field_t MAR8L_f;
  };
  union {
    __IO uint32_t MAR9H;
    stc_ethernet_mac_marh_field_t MAR9H_f;
  };
  union {
    __IO uint32_t MAR9L;
    stc_ethernet_mac_marl_field_t MAR9L_f;
  };
  union {
    __IO uint32_t MAR10H;
    stc_ethernet_mac_marh_field_t MAR10H_f;
  };
  union {
    __IO uint32_t MAR10L;
    stc_ethernet_mac_marl_field_t MAR10L_f;
  };
  union {
    __IO uint32_t MAR11H;
    stc_ethernet_mac_marh_field_t MAR11H_f;
  };
  union {
    __IO uint32_t MAR11L;
    stc_ethernet_mac_marl_field_t MAR11L_f;
  };
  union {
    __IO uint32_t MAR12H;
    stc_ethernet_mac_marh_field_t MAR12H_f;
  };
  union {
    __IO uint32_t MAR12L;
    stc_ethernet_mac_marl_field_t MAR12L_f;
  };
  union {
    __IO uint32_t MAR13H;
    stc_ethernet_mac_marh_field_t MAR13H_f;
  };
  union {
    __IO uint32_t MAR13L;
    stc_ethernet_mac_marl_field_t MAR13L_f;
  };
  union {
    __IO uint32_t MAR14H;
    stc_ethernet_mac_marh_field_t MAR14H_f;
  };
  union {
    __IO uint32_t MAR14L;
    stc_ethernet_mac_marl_field_t MAR14L_f;
  };
  union {
    __IO uint32_t MAR15H;
    stc_ethernet_mac_marh_field_t MAR15H_f;
  };
  union {
    __IO uint32_t MAR15L;
    stc_ethernet_mac_marl_field_t MAR15L_f;
  };
        uint8_t RESERVED2[24];
  union {
    __IO uint32_t RGSR;
    stc_ethernet_mac_rgsr_field_t RGSR_f;
  };
        uint8_t RESERVED3[36];
  __IO uint32_t mmc_cntl;
  __IO uint32_t mmc_intr_rx;
  __IO uint32_t mmc_intr_tx;
  __IO uint32_t mmc_intr_mask_rx;
  __IO uint32_t mmc_intr_mask_tx;
  __IO uint32_t txoctetcount_gb;
  __IO uint32_t txframecount_gb;
  __IO uint32_t txbroadcastframes_g;
  __IO uint32_t txmulticastframes_g;
  __IO uint32_t tx64octets_gb;
  __IO uint32_t tx65to127octets_gb;
  __IO uint32_t tx128to255octets_gb;
  __IO uint32_t tx256to511octets_gb;
  __IO uint32_t tx512to1023octets_gb;
  __IO uint32_t tx1024tomaxoctets_gb;
  __IO uint32_t txunicastframes_gb;
  __IO uint32_t txmulticastframes_gb;
  __IO uint32_t txbroadcastframes_gb;
  __IO uint32_t txunderflowerror;
  __IO uint32_t txsinglecol_g;
  __IO uint32_t txmulticol_g;
  __IO uint32_t txdeferred;
  __IO uint32_t txlatecol;
  __IO uint32_t txexesscol;
  __IO uint32_t txcarriererror;
  __IO uint32_t txoctetcount_g;
  __IO uint32_t txframecount_g;
  __IO uint32_t txexecessdef_g;
  __IO uint32_t txpauseframes;
  __IO uint32_t txvlanframes_g;
        uint8_t RESERVED4[8];
  __IO uint32_t rxframecount_gb;
  __IO uint32_t rxoctetcount_gb;
  __IO uint32_t rxoctetcount_g;
  __IO uint32_t rxbroadcastframes_g;
  __IO uint32_t rxmulticastframes_g;
  __IO uint32_t rxcrcerror;
  __IO uint32_t rxallignmenterror;
  __IO uint32_t rxrunterror;
  __IO uint32_t rxjabbererror;
  __IO uint32_t rxundersize_g;
  __IO uint32_t rxoversize_g;
  __IO uint32_t rx64octets_gb;
  __IO uint32_t rx65to127octets_gb;
  __IO uint32_t rx128to255octets_gb;
  __IO uint32_t rx256to511octets_gb;
  __IO uint32_t rx512to1023octets_gb;
  __IO uint32_t rx1024tomaxoctets_gb;
  __IO uint32_t rxunicastframes_g;
  __IO uint32_t rxlengtherror;
  __IO uint32_t rxoutofrangetype;
  __IO uint32_t rxpauseframes;
  __IO uint32_t rxfifooverflow;
  __IO uint32_t rxvlanframes_gb;
  __IO uint32_t rxwatchdogerror;
        uint8_t RESERVED5[32];
  __IO uint32_t mmc_ipc_intr_mask_rx;
        uint8_t RESERVED6[4];
  __IO uint32_t mmc_ipc_intr_rx;
        uint8_t RESERVED7[4];
  __IO uint32_t rxipv4_gd_frms;
  __IO uint32_t rxipv4_hdrerr_frms;
  __IO uint32_t rxipv4_nopay_frms;
  __IO uint32_t rxipv4_frag_frms;
  __IO uint32_t rxipv4_udsbl_frms;
  __IO uint32_t rxipv6_gd_frms;
  __IO uint32_t rxipv6_hdrerr_frms;
  __IO uint32_t rxipv6_nopay_frms;
  __IO uint32_t rxudp_gd_frms;
  __IO uint32_t rxudp_err_frms;
  __IO uint32_t rxtcp_gd_frms;
  __IO uint32_t rxtcp_err_frms;
  __IO uint32_t rxicmp_gd_frms;
  __IO uint32_t rxicmp_err_frms;
        uint8_t RESERVED8[8];
  __IO uint32_t rxipv4_gd_octets;
  __IO uint32_t rxipv4_hdrerr_octets;
  __IO uint32_t rxipv4_nopay_octets;
  __IO uint32_t rxipv4_frag_octets;
  __IO uint32_t rxipv4_udsbl_octets;
  __IO uint32_t rxipv6_gd_octets;
  __IO uint32_t rxipv6_hdrerr_octets;
  __IO uint32_t rxipv6_nopay_octets;
  __IO uint32_t rxudp_gd_octets;
  __IO uint32_t rxudp_err_octets;
  __IO uint32_t rxtcp_gd_octets;
  __IO uint32_t rxtcp_err_octets;
  __IO uint32_t rxicmp_gd_octets;
  __IO uint32_t rxicmp_err_octets;
        uint8_t RESERVED9[1144];
  union {
    __IO uint32_t TSCR;
    stc_ethernet_mac_tscr_field_t TSCR_f;
  };
  union {
    __IO uint32_t SSIR;
    stc_ethernet_mac_ssir_field_t SSIR_f;
  };
  union {
    __IO uint32_t STSR;
    stc_ethernet_mac_stsr_field_t STSR_f;
  };
  union {
    __IO uint32_t STNR;
    stc_ethernet_mac_stnr_field_t STNR_f;
  };
  union {
    __IO uint32_t STSUR;
    stc_ethernet_mac_stsur_field_t STSUR_f;
  };
  union {
    __IO uint32_t STNUR;
    stc_ethernet_mac_stnur_field_t STNUR_f;
  };
  union {
    __IO uint32_t TSAR;
    stc_ethernet_mac_tsar_field_t TSAR_f;
  };
  union {
    __IO uint32_t TTSR;
    stc_ethernet_mac_ttsr_field_t TTSR_f;
  };
  union {
    __IO uint32_t TTNR;
    stc_ethernet_mac_ttnr_field_t TTNR_f;
  };
  union {
    __IO uint32_t STHWSR;
    stc_ethernet_mac_sthwsr_field_t STHWSR_f;
  };
  union {
    __IO uint32_t TSR;
    stc_ethernet_mac_tsr_field_t TSR_f;
  };
  union {
    __IO uint32_t PPSCR;
    stc_ethernet_mac_ppscr_field_t PPSCR_f;
  };
  union {
    __IO uint32_t ATNR;
    stc_ethernet_mac_atnr_field_t ATNR_f;
  };
  union {
    __IO uint32_t ATSR;
    stc_ethernet_mac_atsr_field_t ATSR_f;
  };
        uint8_t RESERVED10[200];
  union {
    __IO uint32_t MAR16H;
    stc_ethernet_mac_marh_field_t MAR16H_f;
  };
  union {
    __IO uint32_t MAR16L;
    stc_ethernet_mac_marl_field_t MAR16L_f;
  };
  union {
    __IO uint32_t MAR17H;
    stc_ethernet_mac_marh_field_t MAR17H_f;
  };
  union {
    __IO uint32_t MAR17L;
    stc_ethernet_mac_marl_field_t MAR17L_f;
  };
  union {
    __IO uint32_t MAR18H;
    stc_ethernet_mac_marh_field_t MAR18H_f;
  };
  union {
    __IO uint32_t MAR18L;
    stc_ethernet_mac_marl_field_t MAR18L_f;
  };
  union {
    __IO uint32_t MAR19H;
    stc_ethernet_mac_marh_field_t MAR19H_f;
  };
  union {
    __IO uint32_t MAR19L;
    stc_ethernet_mac_marl_field_t MAR19L_f;
  };
  union {
    __IO uint32_t MAR20H;
    stc_ethernet_mac_marh_field_t MAR20H_f;
  };
  union {
    __IO uint32_t MAR20L;
    stc_ethernet_mac_marl_field_t MAR20L_f;
  };
  union {
    __IO uint32_t MAR21H;
    stc_ethernet_mac_marh_field_t MAR21H_f;
  };
  union {
    __IO uint32_t MAR21L;
    stc_ethernet_mac_marl_field_t MAR21L_f;
  };
  union {
    __IO uint32_t MAR22H;
    stc_ethernet_mac_marh_field_t MAR22H_f;
  };
  union {
    __IO uint32_t MAR22L;
    stc_ethernet_mac_marl_field_t MAR22L_f;
  };
  union {
    __IO uint32_t MAR23H;
    stc_ethernet_mac_marh_field_t MAR23H_f;
  };
  union {
    __IO uint32_t MAR23L;
    stc_ethernet_mac_marl_field_t MAR23L_f;
  };
  union {
    __IO uint32_t MAR24H;
    stc_ethernet_mac_marh_field_t MAR24H_f;
  };
  union {
    __IO uint32_t MAR24L;
    stc_ethernet_mac_marl_field_t MAR24L_f;
  };
  union {
    __IO uint32_t MAR25H;
    stc_ethernet_mac_marh_field_t MAR25H_f;
  };
  union {
    __IO uint32_t MAR25L;
    stc_ethernet_mac_marl_field_t MAR25L_f;
  };
  union {
    __IO uint32_t MAR26H;
    stc_ethernet_mac_marh_field_t MAR26H_f;
  };
  union {
    __IO uint32_t MAR26L;
    stc_ethernet_mac_marl_field_t MAR26L_f;
  };
  union {
    __IO uint32_t MAR27H;
    stc_ethernet_mac_marh_field_t MAR27H_f;
  };
  union {
    __IO uint32_t MAR27L;
    stc_ethernet_mac_marl_field_t MAR27L_f;
  };
  union {
    __IO uint32_t MAR28H;
    stc_ethernet_mac_marh_field_t MAR28H_f;
  };
  union {
    __IO uint32_t MAR28L;
    stc_ethernet_mac_marl_field_t MAR28L_f;
  };
  union {
    __IO uint32_t MAR29H;
    stc_ethernet_mac_marh_field_t MAR29H_f;
  };
  union {
    __IO uint32_t MAR29L;
    stc_ethernet_mac_marl_field_t MAR29L_f;
  };
  union {
    __IO uint32_t MAR30H;
    stc_ethernet_mac_marh_field_t MAR30H_f;
  };
  union {
    __IO uint32_t MAR30L;
    stc_ethernet_mac_marl_field_t MAR30L_f;
  };
  union {
    __IO uint32_t MAR31H;
    stc_ethernet_mac_marh_field_t MAR31H_f;
  };
  union {
    __IO uint32_t MAR31L;
    stc_ethernet_mac_marl_field_t MAR31L_f;
  };
        uint8_t RESERVED11[1920];
  union {
    __IO uint32_t BMR;
    stc_ethernet_mac_bmr_field_t BMR_f;
  };
  union {
    __IO uint32_t TPDR;
    stc_ethernet_mac_tpdr_field_t TPDR_f;
  };
  union {
    __IO uint32_t RPDR;
    stc_ethernet_mac_rpdr_field_t RPDR_f;
  };
  union {
    __IO uint32_t RDLAR;
    stc_ethernet_mac_rdlar_field_t RDLAR_f;
  };
  union {
    __IO uint32_t TDLAR;
    stc_ethernet_mac_tdlar_field_t TDLAR_f;
  };
  union {
    __IO uint32_t SR;
    stc_ethernet_mac_sr_field_t SR_f;
  };
  union {
    __IO uint32_t OMR;
    stc_ethernet_mac_omr_field_t OMR_f;
  };
  union {
    __IO uint32_t IER;
    stc_ethernet_mac_ier_field_t IER_f;
  };
  union {
    __IO uint32_t MFBOCR;
    stc_ethernet_mac_mfbocr_field_t MFBOCR_f;
  };
  union {
    __IO uint32_t RIWTR;
    stc_ethernet_mac_riwtr_field_t RIWTR_f;
  };
        uint8_t RESERVED12[4];
  union {
    __IO uint32_t AHBSR;
    stc_ethernet_mac_ahbsr_field_t AHBSR_f;
  };
        uint8_t RESERVED13[24];
  union {
    __IO uint32_t CHTDR;
    stc_ethernet_mac_chtdr_field_t CHTDR_f;
  };
  union {
    __IO uint32_t CHRDR;
    stc_ethernet_mac_chrdr_field_t CHRDR_f;
  };
  union {
    __IO uint32_t CHTBAR;
    stc_ethernet_mac_chtbar_field_t CHTBAR_f;
  };
  union {
    __IO uint32_t CHRBAR;
    stc_ethernet_mac_chrbar_field_t CHRBAR_f;
  };
}FM4_ETHERNET_MAC_TypeDef;

