MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C58L0AGL2000A/mcu.h
#define bFM4_INTREQ_IRQ022MON_WAVEINT3         *((volatile unsigned char*)(0x42624B8CUL))
#define bFM4_INTREQ_IRQ023MON_WAVEINT0         *((volatile unsigned char*)(0x42624C00UL))
#define bFM4_INTREQ_IRQ023MON_WAVEINT1         *((volatile unsigned char*)(0x42624C04UL))
#define bFM4_INTREQ_IRQ023MON_WAVEINT2         *((volatile unsigned char*)(0x42624C08UL))
#define bFM4_INTREQ_IRQ023MON_WAVEINT3         *((volatile unsigned char*)(0x42624C0CUL))
#define bFM4_INTREQ_IRQ024MON_FRT_PEAK_INT0    *((volatile unsigned char*)(0x42624C80UL))
#define bFM4_INTREQ_IRQ024MON_FRT_PEAK_INT1    *((volatile unsigned char*)(0x42624C84UL))
#define bFM4_INTREQ_IRQ024MON_FRT_PEAK_INT2    *((volatile unsigned char*)(0x42624C88UL))
#define bFM4_INTREQ_IRQ025MON_FRT_ZERO_INT0    *((volatile unsigned char*)(0x42624D00UL))
#define bFM4_INTREQ_IRQ025MON_FRT_ZERO_INT1    *((volatile unsigned char*)(0x42624D04UL))
#define bFM4_INTREQ_IRQ025MON_FRT_ZERO_INT2    *((volatile unsigned char*)(0x42624D08UL))
#define bFM4_INTREQ_IRQ026MON_ICUINT0          *((volatile unsigned char*)(0x42624D80UL))
#define bFM4_INTREQ_IRQ026MON_ICUINT1          *((volatile unsigned char*)(0x42624D84UL))
#define bFM4_INTREQ_IRQ026MON_ICUINT2          *((volatile unsigned char*)(0x42624D88UL))
#define bFM4_INTREQ_IRQ026MON_ICUINT3          *((volatile unsigned char*)(0x42624D8CUL))
#define bFM4_INTREQ_IRQ027MON_OCUINT0          *((volatile unsigned char*)(0x42624E00UL))
#define bFM4_INTREQ_IRQ027MON_OCUINT1          *((volatile unsigned char*)(0x42624E04UL))
#define bFM4_INTREQ_IRQ027MON_OCUINT2          *((volatile unsigned char*)(0x42624E08UL))
#define bFM4_INTREQ_IRQ027MON_OCUINT3          *((volatile unsigned char*)(0x42624E0CUL))
#define bFM4_INTREQ_IRQ027MON_OCUINT4          *((volatile unsigned char*)(0x42624E10UL))
#define bFM4_INTREQ_IRQ027MON_OCUINT5          *((volatile unsigned char*)(0x42624E14UL))
#define bFM4_INTREQ_IRQ028MON_FRT_PEAK_INT0    *((volatile unsigned char*)(0x42624E80UL))
#define bFM4_INTREQ_IRQ028MON_FRT_PEAK_INT1    *((volatile unsigned char*)(0x42624E84UL))
#define bFM4_INTREQ_IRQ028MON_FRT_PEAK_INT2    *((volatile unsigned char*)(0x42624E88UL))
#define bFM4_INTREQ_IRQ029MON_FRT_ZERO_INT0    *((volatile unsigned char*)(0x42624F00UL))
#define bFM4_INTREQ_IRQ029MON_FRT_ZERO_INT1    *((volatile unsigned char*)(0x42624F04UL))
#define bFM4_INTREQ_IRQ029MON_FRT_ZERO_INT2    *((volatile unsigned char*)(0x42624F08UL))
#define bFM4_INTREQ_IRQ030MON_ICUINT0          *((volatile unsigned char*)(0x42624F80UL))
#define bFM4_INTREQ_IRQ030MON_ICUINT1          *((volatile unsigned char*)(0x42624F84UL))
#define bFM4_INTREQ_IRQ030MON_ICUINT2          *((volatile unsigned char*)(0x42624F88UL))
#define bFM4_INTREQ_IRQ030MON_ICUINT3          *((volatile unsigned char*)(0x42624F8CUL))
#define bFM4_INTREQ_IRQ031MON_OCUINT0          *((volatile unsigned char*)(0x42625000UL))
#define bFM4_INTREQ_IRQ031MON_OCUINT1          *((volatile unsigned char*)(0x42625004UL))
#define bFM4_INTREQ_IRQ031MON_OCUINT2          *((volatile unsigned char*)(0x42625008UL))
#define bFM4_INTREQ_IRQ031MON_OCUINT3          *((volatile unsigned char*)(0x4262500CUL))
#define bFM4_INTREQ_IRQ031MON_OCUINT4          *((volatile unsigned char*)(0x42625010UL))
#define bFM4_INTREQ_IRQ031MON_OCUINT5          *((volatile unsigned char*)(0x42625014UL))
#define bFM4_INTREQ_IRQ032MON_FRT_PEAK_INT0    *((volatile unsigned char*)(0x42625080UL))
#define bFM4_INTREQ_IRQ032MON_FRT_PEAK_INT1    *((volatile unsigned char*)(0x42625084UL))
#define bFM4_INTREQ_IRQ032MON_FRT_PEAK_INT2    *((volatile unsigned char*)(0x42625088UL))
#define bFM4_INTREQ_IRQ033MON_FRT_ZERO_INT0    *((volatile unsigned char*)(0x42625100UL))
#define bFM4_INTREQ_IRQ033MON_FRT_ZERO_INT1    *((volatile unsigned char*)(0x42625104UL))
#define bFM4_INTREQ_IRQ033MON_FRT_ZERO_INT2    *((volatile unsigned char*)(0x42625108UL))
#define bFM4_INTREQ_IRQ034MON_ICUINT0          *((volatile unsigned char*)(0x42625180UL))
#define bFM4_INTREQ_IRQ034MON_ICUINT1          *((volatile unsigned char*)(0x42625184UL))
#define bFM4_INTREQ_IRQ034MON_ICUINT2          *((volatile unsigned char*)(0x42625188UL))
#define bFM4_INTREQ_IRQ034MON_ICUINT3          *((volatile unsigned char*)(0x4262518CUL))
#define bFM4_INTREQ_IRQ035MON_OCUINT0          *((volatile unsigned char*)(0x42625200UL))
#define bFM4_INTREQ_IRQ035MON_OCUINT1          *((volatile unsigned char*)(0x42625204UL))
#define bFM4_INTREQ_IRQ035MON_OCUINT2          *((volatile unsigned char*)(0x42625208UL))
#define bFM4_INTREQ_IRQ035MON_OCUINT3          *((volatile unsigned char*)(0x4262520CUL))
#define bFM4_INTREQ_IRQ035MON_OCUINT4          *((volatile unsigned char*)(0x42625210UL))
#define bFM4_INTREQ_IRQ035MON_OCUINT5          *((volatile unsigned char*)(0x42625214UL))
#define bFM4_INTREQ_IRQ036MON_PPGINT0          *((volatile unsigned char*)(0x42625280UL))
#define bFM4_INTREQ_IRQ036MON_PPGINT1          *((volatile unsigned char*)(0x42625284UL))
#define bFM4_INTREQ_IRQ036MON_PPGINT2          *((volatile unsigned char*)(0x42625288UL))
#define bFM4_INTREQ_IRQ037MON_PPGINT0          *((volatile unsigned char*)(0x42625300UL))
#define bFM4_INTREQ_IRQ037MON_PPGINT1          *((volatile unsigned char*)(0x42625304UL))
#define bFM4_INTREQ_IRQ037MON_PPGINT2          *((volatile unsigned char*)(0x42625308UL))
#define bFM4_INTREQ_IRQ038MON_PPGINT0          *((volatile unsigned char*)(0x42625380UL))
#define bFM4_INTREQ_IRQ038MON_PPGINT1          *((volatile unsigned char*)(0x42625384UL))
#define bFM4_INTREQ_IRQ038MON_PPGINT2          *((volatile unsigned char*)(0x42625388UL))
#define bFM4_INTREQ_IRQ039MON_BTINT0           *((volatile unsigned char*)(0x42625400UL))
#define bFM4_INTREQ_IRQ039MON_BTINT1           *((volatile unsigned char*)(0x42625404UL))
#define bFM4_INTREQ_IRQ040MON_BTINT0           *((volatile unsigned char*)(0x42625480UL))
#define bFM4_INTREQ_IRQ040MON_BTINT1           *((volatile unsigned char*)(0x42625484UL))
#define bFM4_INTREQ_IRQ041MON_BTINT0           *((volatile unsigned char*)(0x42625500UL))
#define bFM4_INTREQ_IRQ041MON_BTINT1           *((volatile unsigned char*)(0x42625504UL))
#define bFM4_INTREQ_IRQ042MON_BTINT0           *((volatile unsigned char*)(0x42625580UL))
#define bFM4_INTREQ_IRQ042MON_BTINT1           *((volatile unsigned char*)(0x42625584UL))
#define bFM4_INTREQ_IRQ043MON_BTINT0           *((volatile unsigned char*)(0x42625600UL))
#define bFM4_INTREQ_IRQ043MON_BTINT1           *((volatile unsigned char*)(0x42625604UL))
#define bFM4_INTREQ_IRQ044MON_BTINT0           *((volatile unsigned char*)(0x42625680UL))
#define bFM4_INTREQ_IRQ044MON_BTINT1           *((volatile unsigned char*)(0x42625684UL))
#define bFM4_INTREQ_IRQ045MON_BTINT0           *((volatile unsigned char*)(0x42625700UL))
#define bFM4_INTREQ_IRQ045MON_BTINT1           *((volatile unsigned char*)(0x42625704UL))
#define bFM4_INTREQ_IRQ046MON_BTINT0           *((volatile unsigned char*)(0x42625780UL))
#define bFM4_INTREQ_IRQ046MON_BTINT1           *((volatile unsigned char*)(0x42625784UL))
#define bFM4_INTREQ_IRQ047MON_TIMINT1          *((volatile unsigned char*)(0x42625800UL))
#define bFM4_INTREQ_IRQ047MON_TIMINT2          *((volatile unsigned char*)(0x42625804UL))
#define bFM4_INTREQ_IRQ048MON_WCINT            *((volatile unsigned char*)(0x42625880UL))
#define bFM4_INTREQ_IRQ049MON_BMEMCS           *((volatile unsigned char*)(0x42625900UL))
#define bFM4_INTREQ_IRQ050MON_RTCINT           *((volatile unsigned char*)(0x42625980UL))
#define bFM4_INTREQ_IRQ051MON_EXTINT           *((volatile unsigned char*)(0x42625A00UL))
#define bFM4_INTREQ_IRQ052MON_EXTINT           *((volatile unsigned char*)(0x42625A80UL))
#define bFM4_INTREQ_IRQ053MON_EXTINT           *((volatile unsigned char*)(0x42625B00UL))
#define bFM4_INTREQ_IRQ054MON_EXTINT           *((volatile unsigned char*)(0x42625B80UL))
#define bFM4_INTREQ_IRQ055MON_EXTINT           *((volatile unsigned char*)(0x42625C00UL))
#define bFM4_INTREQ_IRQ056MON_EXTINT           *((volatile unsigned char*)(0x42625C80UL))
#define bFM4_INTREQ_IRQ057MON_EXTINT           *((volatile unsigned char*)(0x42625D00UL))
#define bFM4_INTREQ_IRQ058MON_EXTINT           *((volatile unsigned char*)(0x42625D80UL))
#define bFM4_INTREQ_IRQ059MON_MOSCINT          *((volatile unsigned char*)(0x42625E00UL))
#define bFM4_INTREQ_IRQ059MON_SOSCINT          *((volatile unsigned char*)(0x42625E04UL))
#define bFM4_INTREQ_IRQ059MON_MPLLINT          *((volatile unsigned char*)(0x42625E08UL))
#define bFM4_INTREQ_IRQ059MON_UPLLINT          *((volatile unsigned char*)(0x42625E0CUL))
#define bFM4_INTREQ_IRQ059MON_IPLLINT          *((volatile unsigned char*)(0x42625E10UL))
#define bFM4_INTREQ_IRQ060MON_MFSRINT          *((volatile unsigned char*)(0x42625E80UL))
#define bFM4_INTREQ_IRQ061MON_MFSINT0          *((volatile unsigned char*)(0x42625F00UL))
#define bFM4_INTREQ_IRQ061MON_MFSINT1          *((volatile unsigned char*)(0x42625F04UL))
#define bFM4_INTREQ_IRQ062MON_MFSRINT          *((volatile unsigned char*)(0x42625F80UL))
#define bFM4_INTREQ_IRQ063MON_MFSINT0          *((volatile unsigned char*)(0x42626000UL))
#define bFM4_INTREQ_IRQ063MON_MFSINT1          *((volatile unsigned char*)(0x42626004UL))
#define bFM4_INTREQ_IRQ064MON_MFSRINT          *((volatile unsigned char*)(0x42626080UL))
#define bFM4_INTREQ_IRQ065MON_MFSINT0          *((volatile unsigned char*)(0x42626100UL))
#define bFM4_INTREQ_IRQ065MON_MFSINT1          *((volatile unsigned char*)(0x42626104UL))
#define bFM4_INTREQ_IRQ066MON_MFSRINT          *((volatile unsigned char*)(0x42626180UL))
#define bFM4_INTREQ_IRQ067MON_MFSINT0          *((volatile unsigned char*)(0x42626200UL))
#define bFM4_INTREQ_IRQ067MON_MFSINT1          *((volatile unsigned char*)(0x42626204UL))
#define bFM4_INTREQ_IRQ068MON_MFSRINT          *((volatile unsigned char*)(0x42626280UL))
#define bFM4_INTREQ_IRQ069MON_MFSINT0          *((volatile unsigned char*)(0x42626300UL))
#define bFM4_INTREQ_IRQ069MON_MFSINT1          *((volatile unsigned char*)(0x42626304UL))
#define bFM4_INTREQ_IRQ070MON_MFSRINT          *((volatile unsigned char*)(0x42626380UL))
#define bFM4_INTREQ_IRQ071MON_MFSINT0          *((volatile unsigned char*)(0x42626400UL))
#define bFM4_INTREQ_IRQ071MON_MFSINT1          *((volatile unsigned char*)(0x42626404UL))
#define bFM4_INTREQ_IRQ072MON_MFSRINT          *((volatile unsigned char*)(0x42626480UL))
#define bFM4_INTREQ_IRQ073MON_MFSINT0          *((volatile unsigned char*)(0x42626500UL))
#define bFM4_INTREQ_IRQ073MON_MFSINT1          *((volatile unsigned char*)(0x42626504UL))
#define bFM4_INTREQ_IRQ074MON_MFSRINT          *((volatile unsigned char*)(0x42626580UL))
#define bFM4_INTREQ_IRQ075MON_MFSINT0          *((volatile unsigned char*)(0x42626600UL))
#define bFM4_INTREQ_IRQ075MON_MFSINT1          *((volatile unsigned char*)(0x42626604UL))
#define bFM4_INTREQ_IRQ076MON_ADCINT0          *((volatile unsigned char*)(0x42626680UL))
#define bFM4_INTREQ_IRQ076MON_ADCINT1          *((volatile unsigned char*)(0x42626684UL))
#define bFM4_INTREQ_IRQ076MON_ADCINT2          *((volatile unsigned char*)(0x42626688UL))
#define bFM4_INTREQ_IRQ076MON_ADCINT3          *((volatile unsigned char*)(0x4262668CUL))
#define bFM4_INTREQ_IRQ076MON_ADCINT4          *((volatile unsigned char*)(0x42626690UL))
#define bFM4_INTREQ_IRQ077MON_ADCINT0          *((volatile unsigned char*)(0x42626700UL))
#define bFM4_INTREQ_IRQ077MON_ADCINT1          *((volatile unsigned char*)(0x42626704UL))
#define bFM4_INTREQ_IRQ077MON_ADCINT2          *((volatile unsigned char*)(0x42626708UL))
#define bFM4_INTREQ_IRQ077MON_ADCINT3          *((volatile unsigned char*)(0x4262670CUL))
#define bFM4_INTREQ_IRQ077MON_ADCINT4          *((volatile unsigned char*)(0x42626710UL))
#define bFM4_INTREQ_IRQ078MON_USB_DRQ_INT0     *((volatile unsigned char*)(0x42626780UL))
#define bFM4_INTREQ_IRQ078MON_USB_DRQ_INT1     *((volatile unsigned char*)(0x42626784UL))
#define bFM4_INTREQ_IRQ078MON_USB_DRQ_INT2     *((volatile unsigned char*)(0x42626788UL))
#define bFM4_INTREQ_IRQ078MON_USB_DRQ_INT3     *((volatile unsigned char*)(0x4262678CUL))
#define bFM4_INTREQ_IRQ078MON_USB_DRQ_INT4     *((volatile unsigned char*)(0x42626790UL))
#define bFM4_INTREQ_IRQ079MON_USB_INT0         *((volatile unsigned char*)(0x42626800UL))
#define bFM4_INTREQ_IRQ079MON_USB_INT1         *((volatile unsigned char*)(0x42626804UL))
#define bFM4_INTREQ_IRQ079MON_USB_INT2         *((volatile unsigned char*)(0x42626808UL))
#define bFM4_INTREQ_IRQ079MON_USB_INT3         *((volatile unsigned char*)(0x4262680CUL))
#define bFM4_INTREQ_IRQ079MON_USB_INT4         *((volatile unsigned char*)(0x42626810UL))
#define bFM4_INTREQ_IRQ079MON_USB_INT5         *((volatile unsigned char*)(0x42626814UL))
#define bFM4_INTREQ_IRQ080MON_CANINT           *((volatile unsigned char*)(0x42626880UL))
#define bFM4_INTREQ_IRQ081MON_CANINT           *((volatile unsigned char*)(0x42626900UL))
#define bFM4_INTREQ_IRQ081MON_CANDEINT         *((volatile unsigned char*)(0x42626904UL))
#define bFM4_INTREQ_IRQ081MON_CANSEINT         *((volatile unsigned char*)(0x42626908UL))
#define bFM4_INTREQ_IRQ081MON_CAN0INT          *((volatile unsigned char*)(0x4262690CUL))
#define bFM4_INTREQ_IRQ081MON_CAN1INT          *((volatile unsigned char*)(0x42626910UL))
#define bFM4_INTREQ_IRQ083MON_DMACINT          *((volatile unsigned char*)(0x42626A00UL))
#define bFM4_INTREQ_IRQ084MON_DMACINT          *((volatile unsigned char*)(0x42626A80UL))
#define bFM4_INTREQ_IRQ085MON_DMACINT          *((volatile unsigned char*)(0x42626B00UL))
#define bFM4_INTREQ_IRQ086MON_DMACINT          *((volatile unsigned char*)(0x42626B80UL))
#define bFM4_INTREQ_IRQ087MON_DMACINT          *((volatile unsigned char*)(0x42626C00UL))
#define bFM4_INTREQ_IRQ088MON_DMACINT          *((volatile unsigned char*)(0x42626C80UL))
#define bFM4_INTREQ_IRQ089MON_DMACINT          *((volatile unsigned char*)(0x42626D00UL))
#define bFM4_INTREQ_IRQ090MON_DMACINT          *((volatile unsigned char*)(0x42626D80UL))
#define bFM4_INTREQ_IRQ091MON_DSTCINT0         *((volatile unsigned char*)(0x42626E00UL))
#define bFM4_INTREQ_IRQ091MON_DSTCINT1         *((volatile unsigned char*)(0x42626E04UL))
#define bFM4_INTREQ_IRQ092MON_EXTINT0          *((volatile unsigned char*)(0x42626E80UL))
#define bFM4_INTREQ_IRQ092MON_EXTINT1          *((volatile unsigned char*)(0x42626E84UL))
#define bFM4_INTREQ_IRQ092MON_EXTINT2          *((volatile unsigned char*)(0x42626E88UL))
#define bFM4_INTREQ_IRQ092MON_EXTINT3          *((volatile unsigned char*)(0x42626E8CUL))
#define bFM4_INTREQ_IRQ093MON_EXTINT0          *((volatile unsigned char*)(0x42626F00UL))
#define bFM4_INTREQ_IRQ093MON_EXTINT1          *((volatile unsigned char*)(0x42626F04UL))
#define bFM4_INTREQ_IRQ093MON_EXTINT2          *((volatile unsigned char*)(0x42626F08UL))
#define bFM4_INTREQ_IRQ093MON_EXTINT3          *((volatile unsigned char*)(0x42626F0CUL))
#define bFM4_INTREQ_IRQ094MON_EXTINT0          *((volatile unsigned char*)(0x42626F80UL))
#define bFM4_INTREQ_IRQ094MON_EXTINT1          *((volatile unsigned char*)(0x42626F84UL))
#define bFM4_INTREQ_IRQ094MON_EXTINT2          *((volatile unsigned char*)(0x42626F88UL))
#define bFM4_INTREQ_IRQ094MON_EXTINT3          *((volatile unsigned char*)(0x42626F8CUL))
#define bFM4_INTREQ_IRQ095MON_EXTINT0          *((volatile unsigned char*)(0x42627000UL))
#define bFM4_INTREQ_IRQ095MON_EXTINT1          *((volatile unsigned char*)(0x42627004UL))
#define bFM4_INTREQ_IRQ095MON_EXTINT2          *((volatile unsigned char*)(0x42627008UL))
#define bFM4_INTREQ_IRQ095MON_EXTINT3          *((volatile unsigned char*)(0x4262700CUL))
#define bFM4_INTREQ_IRQ096MON_QUDINT0          *((volatile unsigned char*)(0x42627080UL))
#define bFM4_INTREQ_IRQ096MON_QUDINT1          *((volatile unsigned char*)(0x42627084UL))
#define bFM4_INTREQ_IRQ096MON_QUDINT2          *((volatile unsigned char*)(0x42627088UL))
#define bFM4_INTREQ_IRQ096MON_QUDINT3          *((volatile unsigned char*)(0x4262708CUL))
#define bFM4_INTREQ_IRQ096MON_QUDINT4          *((volatile unsigned char*)(0x42627090UL))
#define bFM4_INTREQ_IRQ096MON_QUDINT5          *((volatile unsigned char*)(0x42627094UL))
#define bFM4_INTREQ_IRQ097MON_QUDINT0          *((volatile unsigned char*)(0x42627100UL))
#define bFM4_INTREQ_IRQ097MON_QUDINT1          *((volatile unsigned char*)(0x42627104UL))
#define bFM4_INTREQ_IRQ097MON_QUDINT2          *((volatile unsigned char*)(0x42627108UL))
#define bFM4_INTREQ_IRQ097MON_QUDINT3          *((volatile unsigned char*)(0x4262710CUL))
#define bFM4_INTREQ_IRQ097MON_QUDINT4          *((volatile unsigned char*)(0x42627110UL))
#define bFM4_INTREQ_IRQ097MON_QUDINT5          *((volatile unsigned char*)(0x42627114UL))
#define bFM4_INTREQ_IRQ098MON_BTINT0           *((volatile unsigned char*)(0x42627180UL))
#define bFM4_INTREQ_IRQ098MON_BTINT1           *((volatile unsigned char*)(0x42627184UL))
#define bFM4_INTREQ_IRQ099MON_BTINT0           *((volatile unsigned char*)(0x42627200UL))
#define bFM4_INTREQ_IRQ099MON_BTINT1           *((volatile unsigned char*)(0x42627204UL))
#define bFM4_INTREQ_IRQ100MON_BTINT0           *((volatile unsigned char*)(0x42627280UL))
#define bFM4_INTREQ_IRQ100MON_BTINT1           *((volatile unsigned char*)(0x42627284UL))
#define bFM4_INTREQ_IRQ101MON_BTINT0           *((volatile unsigned char*)(0x42627300UL))
#define bFM4_INTREQ_IRQ101MON_BTINT1           *((volatile unsigned char*)(0x42627304UL))
#define bFM4_INTREQ_IRQ102MON_BTINT0           *((volatile unsigned char*)(0x42627380UL))
#define bFM4_INTREQ_IRQ102MON_BTINT1           *((volatile unsigned char*)(0x42627384UL))
#define bFM4_INTREQ_IRQ102MON_BTINT2           *((volatile unsigned char*)(0x42627388UL))
#define bFM4_INTREQ_IRQ102MON_BTINT3           *((volatile unsigned char*)(0x4262738CUL))
#define bFM4_INTREQ_IRQ102MON_BTINT4           *((volatile unsigned char*)(0x42627390UL))
#define bFM4_INTREQ_IRQ102MON_BTINT5           *((volatile unsigned char*)(0x42627394UL))
#define bFM4_INTREQ_IRQ102MON_BTINT6           *((volatile unsigned char*)(0x42627398UL))
#define bFM4_INTREQ_IRQ102MON_BTINT7           *((volatile unsigned char*)(0x4262739CUL))
#define bFM4_INTREQ_IRQ103MON_MFSRINT          *((volatile unsigned char*)(0x42627400UL))
#define bFM4_INTREQ_IRQ104MON_MFSINT0          *((volatile unsigned char*)(0x42627480UL))
#define bFM4_INTREQ_IRQ104MON_MFSINT1          *((volatile unsigned char*)(0x42627484UL))
#define bFM4_INTREQ_IRQ105MON_MFSRINT          *((volatile unsigned char*)(0x42627500UL))
#define bFM4_INTREQ_IRQ106MON_MFSINT0          *((volatile unsigned char*)(0x42627580UL))
#define bFM4_INTREQ_IRQ106MON_MFSINT1          *((volatile unsigned char*)(0x42627584UL))
#define bFM4_INTREQ_IRQ107MON_MFSRINT          *((volatile unsigned char*)(0x42627600UL))
#define bFM4_INTREQ_IRQ108MON_MFSINT0          *((volatile unsigned char*)(0x42627680UL))
#define bFM4_INTREQ_IRQ108MON_MFSINT1          *((volatile unsigned char*)(0x42627684UL))
#define bFM4_INTREQ_IRQ109MON_MFSRINT          *((volatile unsigned char*)(0x42627700UL))
#define bFM4_INTREQ_IRQ110MON_MFSINT0          *((volatile unsigned char*)(0x42627780UL))
#define bFM4_INTREQ_IRQ110MON_MFSINT1          *((volatile unsigned char*)(0x42627784UL))
#define bFM4_INTREQ_IRQ111MON_ADCINT0          *((volatile unsigned char*)(0x42627800UL))
#define bFM4_INTREQ_IRQ111MON_ADCINT1          *((volatile unsigned char*)(0x42627804UL))
#define bFM4_INTREQ_IRQ111MON_ADCINT2          *((volatile unsigned char*)(0x42627808UL))
#define bFM4_INTREQ_IRQ111MON_ADCINT3          *((volatile unsigned char*)(0x4262780CUL))
#define bFM4_INTREQ_IRQ111MON_ADCINT4          *((volatile unsigned char*)(0x42627810UL))
#define bFM4_INTREQ_IRQ112MON_I2SDINT0         *((volatile unsigned char*)(0x42627880UL))
#define bFM4_INTREQ_IRQ112MON_I2SDINT1         *((volatile unsigned char*)(0x42627884UL))
#define bFM4_INTREQ_IRQ112MON_QSPIDINT0        *((volatile unsigned char*)(0x42627888UL))
#define bFM4_INTREQ_IRQ112MON_QSPIDINT1        *((volatile unsigned char*)(0x4262788CUL))
#define bFM4_INTREQ_IRQ112MON_PCRCDINT         *((volatile unsigned char*)(0x42627890UL))
#define bFM4_INTREQ_IRQ112MON_CANDINT          *((volatile unsigned char*)(0x42627894UL))
#define bFM4_INTREQ_IRQ113MON_USB_DRQ_INT0     *((volatile unsigned char*)(0x42627900UL))
#define bFM4_INTREQ_IRQ113MON_USB_DRQ_INT1     *((volatile unsigned char*)(0x42627904UL))
#define bFM4_INTREQ_IRQ113MON_USB_DRQ_INT2     *((volatile unsigned char*)(0x42627908UL))
#define bFM4_INTREQ_IRQ113MON_USB_DRQ_INT3     *((volatile unsigned char*)(0x4262790CUL))
#define bFM4_INTREQ_IRQ113MON_USB_DRQ_INT4     *((volatile unsigned char*)(0x42627910UL))
#define bFM4_INTREQ_IRQ113MON_RCEC0INT         *((volatile unsigned char*)(0x42627914UL))
#define bFM4_INTREQ_IRQ114MON_USB_INT0         *((volatile unsigned char*)(0x42627980UL))
#define bFM4_INTREQ_IRQ114MON_USB_INT1         *((volatile unsigned char*)(0x42627984UL))
#define bFM4_INTREQ_IRQ114MON_USB_INT2         *((volatile unsigned char*)(0x42627988UL))
#define bFM4_INTREQ_IRQ114MON_USB_INT3         *((volatile unsigned char*)(0x4262798CUL))
#define bFM4_INTREQ_IRQ114MON_USB_INT4         *((volatile unsigned char*)(0x42627990UL))
#define bFM4_INTREQ_IRQ114MON_USB_INT5         *((volatile unsigned char*)(0x42627994UL))
#define bFM4_INTREQ_IRQ114MON_RCEC1INT         *((volatile unsigned char*)(0x42627998UL))
#define bFM4_INTREQ_IRQ115MON_QSPIINT0         *((volatile unsigned char*)(0x42627A00UL))
#define bFM4_INTREQ_IRQ115MON_QSPIINT1         *((volatile unsigned char*)(0x42627A04UL))
#define bFM4_INTREQ_IRQ115MON_QSPIINT2         *((volatile unsigned char*)(0x42627A08UL))
#define bFM4_INTREQ_IRQ117MON_I2SINT           *((volatile unsigned char*)(0x42627B00UL))
#define bFM4_INTREQ_IRQ117MON_PRGCRC           *((volatile unsigned char*)(0x42627B04UL))
#define bFM4_INTREQ_IRQ118MON_SDINT0           *((volatile unsigned char*)(0x42627B80UL))
#define bFM4_INTREQ_IRQ118MON_SDINT1           *((volatile unsigned char*)(0x42627B84UL))
#define bFM4_INTREQ_IRQ119MON_FLINT            *((volatile unsigned char*)(0x42627C00UL))
#define bFM4_INTREQ_IRQ120MON_MFSRINT          *((volatile unsigned char*)(0x42627C80UL))
#define bFM4_INTREQ_IRQ121MON_MFSINT0          *((volatile unsigned char*)(0x42627D00UL))
#define bFM4_INTREQ_IRQ121MON_MFSINT1          *((volatile unsigned char*)(0x42627D04UL))
#define bFM4_INTREQ_IRQ122MON_MFSRINT          *((volatile unsigned char*)(0x42627D80UL))
#define bFM4_INTREQ_IRQ123MON_MFSINT0          *((volatile unsigned char*)(0x42627E00UL))
#define bFM4_INTREQ_IRQ123MON_MFSINT1          *((volatile unsigned char*)(0x42627E04UL))
#define bFM4_INTREQ_IRQ124MON_MFSRINT          *((volatile unsigned char*)(0x42627E80UL))
#define bFM4_INTREQ_IRQ125MON_MFSINT0          *((volatile unsigned char*)(0x42627F00UL))
#define bFM4_INTREQ_IRQ125MON_MFSINT1          *((volatile unsigned char*)(0x42627F04UL))
#define bFM4_INTREQ_IRQ126MON_MFSRINT          *((volatile unsigned char*)(0x42627F80UL))
#define bFM4_INTREQ_IRQ127MON_MFSINT0          *((volatile unsigned char*)(0x42628000UL))
#define bFM4_INTREQ_IRQ127MON_MFSINT1          *((volatile unsigned char*)(0x42628004UL))

