MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C58L0AGL2000A/mcu.h
#define bFM4_GPIO_PDIRC_P5                     *((volatile unsigned char*)(0x42DE6614UL))
#define bFM4_GPIO_PDIRC_P6                     *((volatile unsigned char*)(0x42DE6618UL))
#define bFM4_GPIO_PDIRC_P7                     *((volatile unsigned char*)(0x42DE661CUL))
#define bFM4_GPIO_PDIRC_P8                     *((volatile unsigned char*)(0x42DE6620UL))
#define bFM4_GPIO_PDIRC_P9                     *((volatile unsigned char*)(0x42DE6624UL))
#define bFM4_GPIO_PDIRC_PA                     *((volatile unsigned char*)(0x42DE6628UL))
#define bFM4_GPIO_PDIRC_PB                     *((volatile unsigned char*)(0x42DE662CUL))
#define bFM4_GPIO_PDIRC_PC                     *((volatile unsigned char*)(0x42DE6630UL))
#define bFM4_GPIO_PDIRC_PD                     *((volatile unsigned char*)(0x42DE6634UL))
#define bFM4_GPIO_PDIRC_PE                     *((volatile unsigned char*)(0x42DE6638UL))
#define bFM4_GPIO_PDIRC_PF                     *((volatile unsigned char*)(0x42DE663CUL))
#define bFM4_GPIO_PDIRD_P0                     *((volatile unsigned char*)(0x42DE6680UL))
#define bFM4_GPIO_PDIRD_P1                     *((volatile unsigned char*)(0x42DE6684UL))
#define bFM4_GPIO_PDIRD_P2                     *((volatile unsigned char*)(0x42DE6688UL))
#define bFM4_GPIO_PDIRE_P0                     *((volatile unsigned char*)(0x42DE6700UL))
#define bFM4_GPIO_PDIRE_P2                     *((volatile unsigned char*)(0x42DE6708UL))
#define bFM4_GPIO_PDIRE_P3                     *((volatile unsigned char*)(0x42DE670CUL))
#define bFM4_GPIO_PDIRF_P0                     *((volatile unsigned char*)(0x42DE6780UL))
#define bFM4_GPIO_PDIRF_P1                     *((volatile unsigned char*)(0x42DE6784UL))
#define bFM4_GPIO_PDIRF_P2                     *((volatile unsigned char*)(0x42DE6788UL))
#define bFM4_GPIO_PDIRF_P3                     *((volatile unsigned char*)(0x42DE678CUL))
#define bFM4_GPIO_PDIRF_P4                     *((volatile unsigned char*)(0x42DE6790UL))
#define bFM4_GPIO_PDIRF_P5                     *((volatile unsigned char*)(0x42DE6794UL))
#define bFM4_GPIO_PDIRF_P6                     *((volatile unsigned char*)(0x42DE6798UL))
#define bFM4_GPIO_PDIRF_P7                     *((volatile unsigned char*)(0x42DE679CUL))
#define bFM4_GPIO_PDIRF_P8                     *((volatile unsigned char*)(0x42DE67A0UL))
#define bFM4_GPIO_PDIRF_P9                     *((volatile unsigned char*)(0x42DE67A4UL))
#define bFM4_GPIO_PDIRF_PA                     *((volatile unsigned char*)(0x42DE67A8UL))
#define bFM4_GPIO_PDIRF_PB                     *((volatile unsigned char*)(0x42DE67ACUL))
#define bFM4_GPIO_PDIRF_PC                     *((volatile unsigned char*)(0x42DE67B0UL))
#define bFM4_GPIO_PDOR0_P0                     *((volatile unsigned char*)(0x42DE8000UL))
#define bFM4_GPIO_PDOR0_P1                     *((volatile unsigned char*)(0x42DE8004UL))
#define bFM4_GPIO_PDOR0_P2                     *((volatile unsigned char*)(0x42DE8008UL))
#define bFM4_GPIO_PDOR0_P3                     *((volatile unsigned char*)(0x42DE800CUL))
#define bFM4_GPIO_PDOR0_P4                     *((volatile unsigned char*)(0x42DE8010UL))
#define bFM4_GPIO_PDOR0_P5                     *((volatile unsigned char*)(0x42DE8014UL))
#define bFM4_GPIO_PDOR0_P6                     *((volatile unsigned char*)(0x42DE8018UL))
#define bFM4_GPIO_PDOR0_P7                     *((volatile unsigned char*)(0x42DE801CUL))
#define bFM4_GPIO_PDOR0_P8                     *((volatile unsigned char*)(0x42DE8020UL))
#define bFM4_GPIO_PDOR0_P9                     *((volatile unsigned char*)(0x42DE8024UL))
#define bFM4_GPIO_PDOR0_PA                     *((volatile unsigned char*)(0x42DE8028UL))
#define bFM4_GPIO_PDOR0_PB                     *((volatile unsigned char*)(0x42DE802CUL))
#define bFM4_GPIO_PDOR0_PC                     *((volatile unsigned char*)(0x42DE8030UL))
#define bFM4_GPIO_PDOR0_PD                     *((volatile unsigned char*)(0x42DE8034UL))
#define bFM4_GPIO_PDOR0_PE                     *((volatile unsigned char*)(0x42DE8038UL))
#define bFM4_GPIO_PDOR1_P0                     *((volatile unsigned char*)(0x42DE8080UL))
#define bFM4_GPIO_PDOR1_P1                     *((volatile unsigned char*)(0x42DE8084UL))
#define bFM4_GPIO_PDOR1_P2                     *((volatile unsigned char*)(0x42DE8088UL))
#define bFM4_GPIO_PDOR1_P3                     *((volatile unsigned char*)(0x42DE808CUL))
#define bFM4_GPIO_PDOR1_P4                     *((volatile unsigned char*)(0x42DE8090UL))
#define bFM4_GPIO_PDOR1_P5                     *((volatile unsigned char*)(0x42DE8094UL))
#define bFM4_GPIO_PDOR1_P6                     *((volatile unsigned char*)(0x42DE8098UL))
#define bFM4_GPIO_PDOR1_P7                     *((volatile unsigned char*)(0x42DE809CUL))
#define bFM4_GPIO_PDOR1_P8                     *((volatile unsigned char*)(0x42DE80A0UL))
#define bFM4_GPIO_PDOR1_P9                     *((volatile unsigned char*)(0x42DE80A4UL))
#define bFM4_GPIO_PDOR1_PA                     *((volatile unsigned char*)(0x42DE80A8UL))
#define bFM4_GPIO_PDOR1_PB                     *((volatile unsigned char*)(0x42DE80ACUL))
#define bFM4_GPIO_PDOR1_PC                     *((volatile unsigned char*)(0x42DE80B0UL))
#define bFM4_GPIO_PDOR1_PD                     *((volatile unsigned char*)(0x42DE80B4UL))
#define bFM4_GPIO_PDOR1_PE                     *((volatile unsigned char*)(0x42DE80B8UL))
#define bFM4_GPIO_PDOR1_PF                     *((volatile unsigned char*)(0x42DE80BCUL))
#define bFM4_GPIO_PDOR2_P0                     *((volatile unsigned char*)(0x42DE8100UL))
#define bFM4_GPIO_PDOR2_P1                     *((volatile unsigned char*)(0x42DE8104UL))
#define bFM4_GPIO_PDOR2_P2                     *((volatile unsigned char*)(0x42DE8108UL))
#define bFM4_GPIO_PDOR2_P3                     *((volatile unsigned char*)(0x42DE810CUL))
#define bFM4_GPIO_PDOR2_P4                     *((volatile unsigned char*)(0x42DE8110UL))
#define bFM4_GPIO_PDOR2_P5                     *((volatile unsigned char*)(0x42DE8114UL))
#define bFM4_GPIO_PDOR2_P6                     *((volatile unsigned char*)(0x42DE8118UL))
#define bFM4_GPIO_PDOR2_P7                     *((volatile unsigned char*)(0x42DE811CUL))
#define bFM4_GPIO_PDOR2_P8                     *((volatile unsigned char*)(0x42DE8120UL))
#define bFM4_GPIO_PDOR2_P9                     *((volatile unsigned char*)(0x42DE8124UL))
#define bFM4_GPIO_PDOR2_PA                     *((volatile unsigned char*)(0x42DE8128UL))
#define bFM4_GPIO_PDOR3_P0                     *((volatile unsigned char*)(0x42DE8180UL))
#define bFM4_GPIO_PDOR3_P1                     *((volatile unsigned char*)(0x42DE8184UL))
#define bFM4_GPIO_PDOR3_P2                     *((volatile unsigned char*)(0x42DE8188UL))
#define bFM4_GPIO_PDOR3_P3                     *((volatile unsigned char*)(0x42DE818CUL))
#define bFM4_GPIO_PDOR3_P4                     *((volatile unsigned char*)(0x42DE8190UL))
#define bFM4_GPIO_PDOR3_P5                     *((volatile unsigned char*)(0x42DE8194UL))
#define bFM4_GPIO_PDOR3_P6                     *((volatile unsigned char*)(0x42DE8198UL))
#define bFM4_GPIO_PDOR3_P7                     *((volatile unsigned char*)(0x42DE819CUL))
#define bFM4_GPIO_PDOR3_P8                     *((volatile unsigned char*)(0x42DE81A0UL))
#define bFM4_GPIO_PDOR3_P9                     *((volatile unsigned char*)(0x42DE81A4UL))
#define bFM4_GPIO_PDOR3_PA                     *((volatile unsigned char*)(0x42DE81A8UL))
#define bFM4_GPIO_PDOR3_PB                     *((volatile unsigned char*)(0x42DE81ACUL))
#define bFM4_GPIO_PDOR3_PC                     *((volatile unsigned char*)(0x42DE81B0UL))
#define bFM4_GPIO_PDOR3_PD                     *((volatile unsigned char*)(0x42DE81B4UL))
#define bFM4_GPIO_PDOR3_PE                     *((volatile unsigned char*)(0x42DE81B8UL))
#define bFM4_GPIO_PDOR4_P0                     *((volatile unsigned char*)(0x42DE8200UL))
#define bFM4_GPIO_PDOR4_P1                     *((volatile unsigned char*)(0x42DE8204UL))
#define bFM4_GPIO_PDOR4_P2                     *((volatile unsigned char*)(0x42DE8208UL))
#define bFM4_GPIO_PDOR4_P3                     *((volatile unsigned char*)(0x42DE820CUL))
#define bFM4_GPIO_PDOR4_P4                     *((volatile unsigned char*)(0x42DE8210UL))
#define bFM4_GPIO_PDOR4_P5                     *((volatile unsigned char*)(0x42DE8214UL))
#define bFM4_GPIO_PDOR4_P6                     *((volatile unsigned char*)(0x42DE8218UL))
#define bFM4_GPIO_PDOR4_P7                     *((volatile unsigned char*)(0x42DE821CUL))
#define bFM4_GPIO_PDOR4_P8                     *((volatile unsigned char*)(0x42DE8220UL))
#define bFM4_GPIO_PDOR4_P9                     *((volatile unsigned char*)(0x42DE8224UL))
#define bFM4_GPIO_PDOR4_PA                     *((volatile unsigned char*)(0x42DE8228UL))
#define bFM4_GPIO_PDOR4_PB                     *((volatile unsigned char*)(0x42DE822CUL))
#define bFM4_GPIO_PDOR4_PC                     *((volatile unsigned char*)(0x42DE8230UL))
#define bFM4_GPIO_PDOR4_PD                     *((volatile unsigned char*)(0x42DE8234UL))
#define bFM4_GPIO_PDOR4_PE                     *((volatile unsigned char*)(0x42DE8238UL))
#define bFM4_GPIO_PDOR5_P0                     *((volatile unsigned char*)(0x42DE8280UL))
#define bFM4_GPIO_PDOR5_P1                     *((volatile unsigned char*)(0x42DE8284UL))
#define bFM4_GPIO_PDOR5_P2                     *((volatile unsigned char*)(0x42DE8288UL))
#define bFM4_GPIO_PDOR5_P3                     *((volatile unsigned char*)(0x42DE828CUL))
#define bFM4_GPIO_PDOR5_P4                     *((volatile unsigned char*)(0x42DE8290UL))
#define bFM4_GPIO_PDOR5_P5                     *((volatile unsigned char*)(0x42DE8294UL))
#define bFM4_GPIO_PDOR5_P6                     *((volatile unsigned char*)(0x42DE8298UL))
#define bFM4_GPIO_PDOR5_P7                     *((volatile unsigned char*)(0x42DE829CUL))
#define bFM4_GPIO_PDOR5_P8                     *((volatile unsigned char*)(0x42DE82A0UL))
#define bFM4_GPIO_PDOR5_P9                     *((volatile unsigned char*)(0x42DE82A4UL))
#define bFM4_GPIO_PDOR5_PA                     *((volatile unsigned char*)(0x42DE82A8UL))
#define bFM4_GPIO_PDOR5_PB                     *((volatile unsigned char*)(0x42DE82ACUL))
#define bFM4_GPIO_PDOR5_PC                     *((volatile unsigned char*)(0x42DE82B0UL))
#define bFM4_GPIO_PDOR5_PD                     *((volatile unsigned char*)(0x42DE82B4UL))
#define bFM4_GPIO_PDOR5_PE                     *((volatile unsigned char*)(0x42DE82B8UL))
#define bFM4_GPIO_PDOR5_PF                     *((volatile unsigned char*)(0x42DE82BCUL))
#define bFM4_GPIO_PDOR6_P0                     *((volatile unsigned char*)(0x42DE8300UL))
#define bFM4_GPIO_PDOR6_P1                     *((volatile unsigned char*)(0x42DE8304UL))
#define bFM4_GPIO_PDOR6_P2                     *((volatile unsigned char*)(0x42DE8308UL))
#define bFM4_GPIO_PDOR6_P3                     *((volatile unsigned char*)(0x42DE830CUL))
#define bFM4_GPIO_PDOR6_P4                     *((volatile unsigned char*)(0x42DE8310UL))
#define bFM4_GPIO_PDOR6_P5                     *((volatile unsigned char*)(0x42DE8314UL))
#define bFM4_GPIO_PDOR6_P6                     *((volatile unsigned char*)(0x42DE8318UL))
#define bFM4_GPIO_PDOR6_P7                     *((volatile unsigned char*)(0x42DE831CUL))
#define bFM4_GPIO_PDOR6_P8                     *((volatile unsigned char*)(0x42DE8320UL))
#define bFM4_GPIO_PDOR6_P9                     *((volatile unsigned char*)(0x42DE8324UL))
#define bFM4_GPIO_PDOR6_PA                     *((volatile unsigned char*)(0x42DE8328UL))
#define bFM4_GPIO_PDOR6_PB                     *((volatile unsigned char*)(0x42DE832CUL))
#define bFM4_GPIO_PDOR6_PC                     *((volatile unsigned char*)(0x42DE8330UL))
#define bFM4_GPIO_PDOR6_PD                     *((volatile unsigned char*)(0x42DE8334UL))
#define bFM4_GPIO_PDOR6_PE                     *((volatile unsigned char*)(0x42DE8338UL))
#define bFM4_GPIO_PDOR7_P0                     *((volatile unsigned char*)(0x42DE8380UL))
#define bFM4_GPIO_PDOR7_P1                     *((volatile unsigned char*)(0x42DE8384UL))
#define bFM4_GPIO_PDOR7_P2                     *((volatile unsigned char*)(0x42DE8388UL))
#define bFM4_GPIO_PDOR7_P3                     *((volatile unsigned char*)(0x42DE838CUL))
#define bFM4_GPIO_PDOR7_P4                     *((volatile unsigned char*)(0x42DE8390UL))
#define bFM4_GPIO_PDOR7_P5                     *((volatile unsigned char*)(0x42DE8394UL))
#define bFM4_GPIO_PDOR7_P6                     *((volatile unsigned char*)(0x42DE8398UL))
#define bFM4_GPIO_PDOR7_P7                     *((volatile unsigned char*)(0x42DE839CUL))
#define bFM4_GPIO_PDOR7_P8                     *((volatile unsigned char*)(0x42DE83A0UL))
#define bFM4_GPIO_PDOR7_P9                     *((volatile unsigned char*)(0x42DE83A4UL))
#define bFM4_GPIO_PDOR7_PA                     *((volatile unsigned char*)(0x42DE83A8UL))
#define bFM4_GPIO_PDOR7_PB                     *((volatile unsigned char*)(0x42DE83ACUL))
#define bFM4_GPIO_PDOR7_PC                     *((volatile unsigned char*)(0x42DE83B0UL))
#define bFM4_GPIO_PDOR7_PD                     *((volatile unsigned char*)(0x42DE83B4UL))
#define bFM4_GPIO_PDOR7_PE                     *((volatile unsigned char*)(0x42DE83B8UL))
#define bFM4_GPIO_PDOR8_P0                     *((volatile unsigned char*)(0x42DE8400UL))
#define bFM4_GPIO_PDOR8_P1                     *((volatile unsigned char*)(0x42DE8404UL))
#define bFM4_GPIO_PDOR8_P2                     *((volatile unsigned char*)(0x42DE8408UL))
#define bFM4_GPIO_PDOR8_P3                     *((volatile unsigned char*)(0x42DE840CUL))
#define bFM4_GPIO_PDOR9_P0                     *((volatile unsigned char*)(0x42DE8480UL))
#define bFM4_GPIO_PDOR9_P1                     *((volatile unsigned char*)(0x42DE8484UL))
#define bFM4_GPIO_PDOR9_P2                     *((volatile unsigned char*)(0x42DE8488UL))
#define bFM4_GPIO_PDOR9_P3                     *((volatile unsigned char*)(0x42DE848CUL))
#define bFM4_GPIO_PDOR9_P4                     *((volatile unsigned char*)(0x42DE8490UL))
#define bFM4_GPIO_PDOR9_P5                     *((volatile unsigned char*)(0x42DE8494UL))
#define bFM4_GPIO_PDOR9_P6                     *((volatile unsigned char*)(0x42DE8498UL))
#define bFM4_GPIO_PDOR9_P7                     *((volatile unsigned char*)(0x42DE849CUL))
#define bFM4_GPIO_PDORA_P0                     *((volatile unsigned char*)(0x42DE8500UL))
#define bFM4_GPIO_PDORA_P1                     *((volatile unsigned char*)(0x42DE8504UL))
#define bFM4_GPIO_PDORA_P2                     *((volatile unsigned char*)(0x42DE8508UL))
#define bFM4_GPIO_PDORA_P3                     *((volatile unsigned char*)(0x42DE850CUL))
#define bFM4_GPIO_PDORA_P4                     *((volatile unsigned char*)(0x42DE8510UL))
#define bFM4_GPIO_PDORA_P5                     *((volatile unsigned char*)(0x42DE8514UL))
#define bFM4_GPIO_PDORA_P6                     *((volatile unsigned char*)(0x42DE8518UL))
#define bFM4_GPIO_PDORA_P7                     *((volatile unsigned char*)(0x42DE851CUL))
#define bFM4_GPIO_PDORA_P8                     *((volatile unsigned char*)(0x42DE8520UL))
#define bFM4_GPIO_PDORA_P9                     *((volatile unsigned char*)(0x42DE8524UL))
#define bFM4_GPIO_PDORA_PA                     *((volatile unsigned char*)(0x42DE8528UL))
#define bFM4_GPIO_PDORA_PB                     *((volatile unsigned char*)(0x42DE852CUL))
#define bFM4_GPIO_PDORA_PC                     *((volatile unsigned char*)(0x42DE8530UL))
#define bFM4_GPIO_PDORA_PD                     *((volatile unsigned char*)(0x42DE8534UL))
#define bFM4_GPIO_PDORA_PE                     *((volatile unsigned char*)(0x42DE8538UL))
#define bFM4_GPIO_PDORA_PF                     *((volatile unsigned char*)(0x42DE853CUL))
#define bFM4_GPIO_PDORB_P0                     *((volatile unsigned char*)(0x42DE8580UL))
#define bFM4_GPIO_PDORB_P1                     *((volatile unsigned char*)(0x42DE8584UL))
#define bFM4_GPIO_PDORB_P2                     *((volatile unsigned char*)(0x42DE8588UL))
#define bFM4_GPIO_PDORB_P3                     *((volatile unsigned char*)(0x42DE858CUL))
#define bFM4_GPIO_PDORB_P4                     *((volatile unsigned char*)(0x42DE8590UL))
#define bFM4_GPIO_PDORB_P5                     *((volatile unsigned char*)(0x42DE8594UL))
#define bFM4_GPIO_PDORB_P6                     *((volatile unsigned char*)(0x42DE8598UL))
#define bFM4_GPIO_PDORB_P7                     *((volatile unsigned char*)(0x42DE859CUL))
#define bFM4_GPIO_PDORB_P8                     *((volatile unsigned char*)(0x42DE85A0UL))
#define bFM4_GPIO_PDORB_P9                     *((volatile unsigned char*)(0x42DE85A4UL))
#define bFM4_GPIO_PDORB_PA                     *((volatile unsigned char*)(0x42DE85A8UL))
#define bFM4_GPIO_PDORB_PB                     *((volatile unsigned char*)(0x42DE85ACUL))
#define bFM4_GPIO_PDORB_PC                     *((volatile unsigned char*)(0x42DE85B0UL))
#define bFM4_GPIO_PDORB_PD                     *((volatile unsigned char*)(0x42DE85B4UL))
#define bFM4_GPIO_PDORB_PE                     *((volatile unsigned char*)(0x42DE85B8UL))
#define bFM4_GPIO_PDORB_PF                     *((volatile unsigned char*)(0x42DE85BCUL))
#define bFM4_GPIO_PDORC_P0                     *((volatile unsigned char*)(0x42DE8600UL))
#define bFM4_GPIO_PDORC_P1                     *((volatile unsigned char*)(0x42DE8604UL))
#define bFM4_GPIO_PDORC_P2                     *((volatile unsigned char*)(0x42DE8608UL))
#define bFM4_GPIO_PDORC_P3                     *((volatile unsigned char*)(0x42DE860CUL))
#define bFM4_GPIO_PDORC_P4                     *((volatile unsigned char*)(0x42DE8610UL))
#define bFM4_GPIO_PDORC_P5                     *((volatile unsigned char*)(0x42DE8614UL))
#define bFM4_GPIO_PDORC_P6                     *((volatile unsigned char*)(0x42DE8618UL))
#define bFM4_GPIO_PDORC_P7                     *((volatile unsigned char*)(0x42DE861CUL))
#define bFM4_GPIO_PDORC_P8                     *((volatile unsigned char*)(0x42DE8620UL))
#define bFM4_GPIO_PDORC_P9                     *((volatile unsigned char*)(0x42DE8624UL))
#define bFM4_GPIO_PDORC_PA                     *((volatile unsigned char*)(0x42DE8628UL))
#define bFM4_GPIO_PDORC_PB                     *((volatile unsigned char*)(0x42DE862CUL))
#define bFM4_GPIO_PDORC_PC                     *((volatile unsigned char*)(0x42DE8630UL))
#define bFM4_GPIO_PDORC_PD                     *((volatile unsigned char*)(0x42DE8634UL))
#define bFM4_GPIO_PDORC_PE                     *((volatile unsigned char*)(0x42DE8638UL))
#define bFM4_GPIO_PDORC_PF                     *((volatile unsigned char*)(0x42DE863CUL))
#define bFM4_GPIO_PDORD_P0                     *((volatile unsigned char*)(0x42DE8680UL))
#define bFM4_GPIO_PDORD_P1                     *((volatile unsigned char*)(0x42DE8684UL))
#define bFM4_GPIO_PDORD_P2                     *((volatile unsigned char*)(0x42DE8688UL))
#define bFM4_GPIO_PDORE_P0                     *((volatile unsigned char*)(0x42DE8700UL))
#define bFM4_GPIO_PDORE_P2                     *((volatile unsigned char*)(0x42DE8708UL))
#define bFM4_GPIO_PDORE_P3                     *((volatile unsigned char*)(0x42DE870CUL))
#define bFM4_GPIO_PDORF_P0                     *((volatile unsigned char*)(0x42DE8780UL))
#define bFM4_GPIO_PDORF_P1                     *((volatile unsigned char*)(0x42DE8784UL))
#define bFM4_GPIO_PDORF_P2                     *((volatile unsigned char*)(0x42DE8788UL))
#define bFM4_GPIO_PDORF_P3                     *((volatile unsigned char*)(0x42DE878CUL))
#define bFM4_GPIO_PDORF_P4                     *((volatile unsigned char*)(0x42DE8790UL))
#define bFM4_GPIO_PDORF_P5                     *((volatile unsigned char*)(0x42DE8794UL))
#define bFM4_GPIO_PDORF_P6                     *((volatile unsigned char*)(0x42DE8798UL))
#define bFM4_GPIO_PDORF_P7                     *((volatile unsigned char*)(0x42DE879CUL))
#define bFM4_GPIO_PDORF_P8                     *((volatile unsigned char*)(0x42DE87A0UL))
#define bFM4_GPIO_PDORF_P9                     *((volatile unsigned char*)(0x42DE87A4UL))
#define bFM4_GPIO_PDORF_PA                     *((volatile unsigned char*)(0x42DE87A8UL))
#define bFM4_GPIO_PDORF_PB                     *((volatile unsigned char*)(0x42DE87ACUL))
#define bFM4_GPIO_PDORF_PC                     *((volatile unsigned char*)(0x42DE87B0UL))
#define bFM4_GPIO_ADE_AN00                     *((volatile unsigned char*)(0x42DEA000UL))
#define bFM4_GPIO_ADE_AN01                     *((volatile unsigned char*)(0x42DEA004UL))
#define bFM4_GPIO_ADE_AN02                     *((volatile unsigned char*)(0x42DEA008UL))
#define bFM4_GPIO_ADE_AN03                     *((volatile unsigned char*)(0x42DEA00CUL))
#define bFM4_GPIO_ADE_AN04                     *((volatile unsigned char*)(0x42DEA010UL))
#define bFM4_GPIO_ADE_AN05                     *((volatile unsigned char*)(0x42DEA014UL))
#define bFM4_GPIO_ADE_AN06                     *((volatile unsigned char*)(0x42DEA018UL))
#define bFM4_GPIO_ADE_AN07                     *((volatile unsigned char*)(0x42DEA01CUL))
#define bFM4_GPIO_ADE_AN08                     *((volatile unsigned char*)(0x42DEA020UL))
#define bFM4_GPIO_ADE_AN09                     *((volatile unsigned char*)(0x42DEA024UL))
#define bFM4_GPIO_ADE_AN10                     *((volatile unsigned char*)(0x42DEA028UL))
#define bFM4_GPIO_ADE_AN11                     *((volatile unsigned char*)(0x42DEA02CUL))
#define bFM4_GPIO_ADE_AN12                     *((volatile unsigned char*)(0x42DEA030UL))
#define bFM4_GPIO_ADE_AN13                     *((volatile unsigned char*)(0x42DEA034UL))
#define bFM4_GPIO_ADE_AN14                     *((volatile unsigned char*)(0x42DEA038UL))
#define bFM4_GPIO_ADE_AN15                     *((volatile unsigned char*)(0x42DEA03CUL))
#define bFM4_GPIO_ADE_AN16                     *((volatile unsigned char*)(0x42DEA040UL))
#define bFM4_GPIO_ADE_AN17                     *((volatile unsigned char*)(0x42DEA044UL))
#define bFM4_GPIO_ADE_AN18                     *((volatile unsigned char*)(0x42DEA048UL))
#define bFM4_GPIO_ADE_AN19                     *((volatile unsigned char*)(0x42DEA04CUL))
#define bFM4_GPIO_ADE_AN20                     *((volatile unsigned char*)(0x42DEA050UL))
#define bFM4_GPIO_ADE_AN21                     *((volatile unsigned char*)(0x42DEA054UL))
#define bFM4_GPIO_ADE_AN22                     *((volatile unsigned char*)(0x42DEA058UL))
#define bFM4_GPIO_ADE_AN23                     *((volatile unsigned char*)(0x42DEA05CUL))
#define bFM4_GPIO_ADE_AN24                     *((volatile unsigned char*)(0x42DEA060UL))
#define bFM4_GPIO_ADE_AN25                     *((volatile unsigned char*)(0x42DEA064UL))
#define bFM4_GPIO_ADE_AN26                     *((volatile unsigned char*)(0x42DEA068UL))
#define bFM4_GPIO_ADE_AN27                     *((volatile unsigned char*)(0x42DEA06CUL))
#define bFM4_GPIO_ADE_AN28                     *((volatile unsigned char*)(0x42DEA070UL))
#define bFM4_GPIO_ADE_AN29                     *((volatile unsigned char*)(0x42DEA074UL))
#define bFM4_GPIO_ADE_AN30                     *((volatile unsigned char*)(0x42DEA078UL))
#define bFM4_GPIO_ADE_AN31                     *((volatile unsigned char*)(0x42DEA07CUL))
#define bFM4_GPIO_SPSR_MAINXC0                 *((volatile unsigned char*)(0x42DEB008UL))
#define bFM4_GPIO_SPSR_MAINXC1                 *((volatile unsigned char*)(0x42DEB00CUL))
#define bFM4_GPIO_SPSR_USB0C                   *((volatile unsigned char*)(0x42DEB010UL))
#define bFM4_GPIO_SPSR_USB1C                   *((volatile unsigned char*)(0x42DEB014UL))
#define bFM4_GPIO_EPFR00_NMIS                  *((volatile unsigned char*)(0x42DEC000UL))
#define bFM4_GPIO_EPFR00_CROUTE0               *((volatile unsigned char*)(0x42DEC004UL))
#define bFM4_GPIO_EPFR00_CROUTE1               *((volatile unsigned char*)(0x42DEC008UL))
