MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C58L0AGL2000A/mcu.h
/* MFS LIN channel 2 registers */
#define bFM4_MFS2_LIN_SMR_SOE                  *((volatile unsigned char*)(0x42704000UL))
#define bFM4_MFS2_LIN_SMR_SBL                  *((volatile unsigned char*)(0x4270400CUL))
#define bFM4_MFS2_LIN_SMR_WUCR                 *((volatile unsigned char*)(0x42704010UL))
#define bFM4_MFS2_LIN_SMR_MD0                  *((volatile unsigned char*)(0x42704014UL))
#define bFM4_MFS2_LIN_SMR_MD1                  *((volatile unsigned char*)(0x42704018UL))
#define bFM4_MFS2_LIN_SMR_MD2                  *((volatile unsigned char*)(0x4270401CUL))
#define bFM4_MFS2_LIN_SCR_TXE                  *((volatile unsigned char*)(0x42704020UL))
#define bFM4_MFS2_LIN_SCR_RXE                  *((volatile unsigned char*)(0x42704024UL))
#define bFM4_MFS2_LIN_SCR_TBIE                 *((volatile unsigned char*)(0x42704028UL))
#define bFM4_MFS2_LIN_SCR_TIE                  *((volatile unsigned char*)(0x4270402CUL))
#define bFM4_MFS2_LIN_SCR_RIE                  *((volatile unsigned char*)(0x42704030UL))
#define bFM4_MFS2_LIN_SCR_LBR                  *((volatile unsigned char*)(0x42704034UL))
#define bFM4_MFS2_LIN_SCR_MS                   *((volatile unsigned char*)(0x42704038UL))
#define bFM4_MFS2_LIN_SCR_UPCL                 *((volatile unsigned char*)(0x4270403CUL))
#define bFM4_MFS2_LIN_ESCR_DEL0                *((volatile unsigned char*)(0x42704080UL))
#define bFM4_MFS2_LIN_ESCR_DEL1                *((volatile unsigned char*)(0x42704084UL))
#define bFM4_MFS2_LIN_ESCR_LBL0                *((volatile unsigned char*)(0x42704088UL))
#define bFM4_MFS2_LIN_ESCR_LBL1                *((volatile unsigned char*)(0x4270408CUL))
#define bFM4_MFS2_LIN_ESCR_LBIE                *((volatile unsigned char*)(0x42704090UL))
#define bFM4_MFS2_LIN_ESCR_ESBL                *((volatile unsigned char*)(0x42704098UL))
#define bFM4_MFS2_LIN_SSR_TBI                  *((volatile unsigned char*)(0x427040A0UL))
#define bFM4_MFS2_LIN_SSR_TDRE                 *((volatile unsigned char*)(0x427040A4UL))
#define bFM4_MFS2_LIN_SSR_RDRF                 *((volatile unsigned char*)(0x427040A8UL))
#define bFM4_MFS2_LIN_SSR_ORE                  *((volatile unsigned char*)(0x427040ACUL))
#define bFM4_MFS2_LIN_SSR_FRE                  *((volatile unsigned char*)(0x427040B0UL))
#define bFM4_MFS2_LIN_SSR_LBD                  *((volatile unsigned char*)(0x427040B4UL))
#define bFM4_MFS2_LIN_SSR_REC                  *((volatile unsigned char*)(0x427040BCUL))
#define bFM4_MFS2_LIN_BGR_EXT                  *((volatile unsigned char*)(0x427041BCUL))
#define bFM4_MFS2_LIN_BGR1_EXT                 *((volatile unsigned char*)(0x427041BCUL))
#define bFM4_MFS2_LIN_FCR_FE1                  *((volatile unsigned char*)(0x42704280UL))
#define bFM4_MFS2_LIN_FCR_FE2                  *((volatile unsigned char*)(0x42704284UL))
#define bFM4_MFS2_LIN_FCR_FCL1                 *((volatile unsigned char*)(0x42704288UL))
#define bFM4_MFS2_LIN_FCR_FCL2                 *((volatile unsigned char*)(0x4270428CUL))
#define bFM4_MFS2_LIN_FCR_FSET                 *((volatile unsigned char*)(0x42704290UL))
#define bFM4_MFS2_LIN_FCR_FLD                  *((volatile unsigned char*)(0x42704294UL))
#define bFM4_MFS2_LIN_FCR_FLST                 *((volatile unsigned char*)(0x42704298UL))
#define bFM4_MFS2_LIN_FCR_FSEL                 *((volatile unsigned char*)(0x427042A0UL))
#define bFM4_MFS2_LIN_FCR_FTIE                 *((volatile unsigned char*)(0x427042A4UL))
#define bFM4_MFS2_LIN_FCR_FDRQ                 *((volatile unsigned char*)(0x427042A8UL))
#define bFM4_MFS2_LIN_FCR_FRIIE                *((volatile unsigned char*)(0x427042ACUL))
#define bFM4_MFS2_LIN_FCR_FLSTE                *((volatile unsigned char*)(0x427042B0UL))
#define bFM4_MFS2_LIN_FCR0_FE1                 *((volatile unsigned char*)(0x42704280UL))
#define bFM4_MFS2_LIN_FCR0_FE2                 *((volatile unsigned char*)(0x42704284UL))
#define bFM4_MFS2_LIN_FCR0_FCL1                *((volatile unsigned char*)(0x42704288UL))
#define bFM4_MFS2_LIN_FCR0_FCL2                *((volatile unsigned char*)(0x4270428CUL))
#define bFM4_MFS2_LIN_FCR0_FSET                *((volatile unsigned char*)(0x42704290UL))
#define bFM4_MFS2_LIN_FCR0_FLD                 *((volatile unsigned char*)(0x42704294UL))
#define bFM4_MFS2_LIN_FCR0_FLST                *((volatile unsigned char*)(0x42704298UL))
#define bFM4_MFS2_LIN_FCR1_FSEL                *((volatile unsigned char*)(0x427042A0UL))
#define bFM4_MFS2_LIN_FCR1_FTIE                *((volatile unsigned char*)(0x427042A4UL))
#define bFM4_MFS2_LIN_FCR1_FDRQ                *((volatile unsigned char*)(0x427042A8UL))
#define bFM4_MFS2_LIN_FCR1_FRIIE               *((volatile unsigned char*)(0x427042ACUL))
#define bFM4_MFS2_LIN_FCR1_FLSTE               *((volatile unsigned char*)(0x427042B0UL))
#define bFM4_MFS2_LIN_FBYTE_FD0                *((volatile unsigned char*)(0x42704300UL))
#define bFM4_MFS2_LIN_FBYTE_FD1                *((volatile unsigned char*)(0x42704304UL))
#define bFM4_MFS2_LIN_FBYTE_FD2                *((volatile unsigned char*)(0x42704308UL))
#define bFM4_MFS2_LIN_FBYTE_FD3                *((volatile unsigned char*)(0x4270430CUL))
#define bFM4_MFS2_LIN_FBYTE_FD4                *((volatile unsigned char*)(0x42704310UL))
#define bFM4_MFS2_LIN_FBYTE_FD5                *((volatile unsigned char*)(0x42704314UL))
#define bFM4_MFS2_LIN_FBYTE_FD6                *((volatile unsigned char*)(0x42704318UL))
#define bFM4_MFS2_LIN_FBYTE_FD7                *((volatile unsigned char*)(0x4270431CUL))
#define bFM4_MFS2_LIN_FBYTE_FD8                *((volatile unsigned char*)(0x42704320UL))
#define bFM4_MFS2_LIN_FBYTE_FD9                *((volatile unsigned char*)(0x42704324UL))
#define bFM4_MFS2_LIN_FBYTE_FD10               *((volatile unsigned char*)(0x42704328UL))
#define bFM4_MFS2_LIN_FBYTE_FD11               *((volatile unsigned char*)(0x4270432CUL))
#define bFM4_MFS2_LIN_FBYTE_FD12               *((volatile unsigned char*)(0x42704330UL))
#define bFM4_MFS2_LIN_FBYTE_FD13               *((volatile unsigned char*)(0x42704334UL))
#define bFM4_MFS2_LIN_FBYTE_FD14               *((volatile unsigned char*)(0x42704338UL))
#define bFM4_MFS2_LIN_FBYTE_FD15               *((volatile unsigned char*)(0x4270433CUL))
#define bFM4_MFS2_LIN_FBYTE1_FD0               *((volatile unsigned char*)(0x42704300UL))
#define bFM4_MFS2_LIN_FBYTE1_FD1               *((volatile unsigned char*)(0x42704304UL))
#define bFM4_MFS2_LIN_FBYTE1_FD2               *((volatile unsigned char*)(0x42704308UL))
#define bFM4_MFS2_LIN_FBYTE1_FD3               *((volatile unsigned char*)(0x4270430CUL))
#define bFM4_MFS2_LIN_FBYTE1_FD4               *((volatile unsigned char*)(0x42704310UL))
#define bFM4_MFS2_LIN_FBYTE1_FD5               *((volatile unsigned char*)(0x42704314UL))
#define bFM4_MFS2_LIN_FBYTE1_FD6               *((volatile unsigned char*)(0x42704318UL))
#define bFM4_MFS2_LIN_FBYTE1_FD7               *((volatile unsigned char*)(0x4270431CUL))
#define bFM4_MFS2_LIN_FBYTE2_FD8               *((volatile unsigned char*)(0x42704320UL))
#define bFM4_MFS2_LIN_FBYTE2_FD9               *((volatile unsigned char*)(0x42704324UL))
#define bFM4_MFS2_LIN_FBYTE2_FD10              *((volatile unsigned char*)(0x42704328UL))
#define bFM4_MFS2_LIN_FBYTE2_FD11              *((volatile unsigned char*)(0x4270432CUL))
#define bFM4_MFS2_LIN_FBYTE2_FD12              *((volatile unsigned char*)(0x42704330UL))
#define bFM4_MFS2_LIN_FBYTE2_FD13              *((volatile unsigned char*)(0x42704334UL))
#define bFM4_MFS2_LIN_FBYTE2_FD14              *((volatile unsigned char*)(0x42704338UL))
#define bFM4_MFS2_LIN_FBYTE2_FD15              *((volatile unsigned char*)(0x4270433CUL))

/* MFS I2C channel 2 registers */
#define bFM4_MFS2_I2C_SMR_TIE                  *((volatile unsigned char*)(0x42704008UL))
#define bFM4_MFS2_I2C_SMR_RIE                  *((volatile unsigned char*)(0x4270400CUL))
#define bFM4_MFS2_I2C_SMR_MD0                  *((volatile unsigned char*)(0x42704014UL))
#define bFM4_MFS2_I2C_SMR_MD1                  *((volatile unsigned char*)(0x42704018UL))
#define bFM4_MFS2_I2C_SMR_MD2                  *((volatile unsigned char*)(0x4270401CUL))
#define bFM4_MFS2_I2C_IBCR_INT                 *((volatile unsigned char*)(0x42704020UL))
#define bFM4_MFS2_I2C_IBCR_BER                 *((volatile unsigned char*)(0x42704024UL))
#define bFM4_MFS2_I2C_IBCR_INTE                *((volatile unsigned char*)(0x42704028UL))
#define bFM4_MFS2_I2C_IBCR_CNDE                *((volatile unsigned char*)(0x4270402CUL))
#define bFM4_MFS2_I2C_IBCR_WSEL                *((volatile unsigned char*)(0x42704030UL))
#define bFM4_MFS2_I2C_IBCR_ACKE                *((volatile unsigned char*)(0x42704034UL))
#define bFM4_MFS2_I2C_IBCR_ACT                 *((volatile unsigned char*)(0x42704038UL))
#define bFM4_MFS2_I2C_IBCR_SCC                 *((volatile unsigned char*)(0x42704038UL))
#define bFM4_MFS2_I2C_IBCR_MSS                 *((volatile unsigned char*)(0x4270403CUL))
#define bFM4_MFS2_I2C_IBSR_BB                  *((volatile unsigned char*)(0x42704080UL))
#define bFM4_MFS2_I2C_IBSR_SPC                 *((volatile unsigned char*)(0x42704084UL))
#define bFM4_MFS2_I2C_IBSR_RSC                 *((volatile unsigned char*)(0x42704088UL))
#define bFM4_MFS2_I2C_IBSR_AL                  *((volatile unsigned char*)(0x4270408CUL))
#define bFM4_MFS2_I2C_IBSR_TRX                 *((volatile unsigned char*)(0x42704090UL))
#define bFM4_MFS2_I2C_IBSR_RSA                 *((volatile unsigned char*)(0x42704094UL))
#define bFM4_MFS2_I2C_IBSR_RACK                *((volatile unsigned char*)(0x42704098UL))
#define bFM4_MFS2_I2C_IBSR_FBT                 *((volatile unsigned char*)(0x4270409CUL))
#define bFM4_MFS2_I2C_SSR_TBI                  *((volatile unsigned char*)(0x427040A0UL))
#define bFM4_MFS2_I2C_SSR_TDRE                 *((volatile unsigned char*)(0x427040A4UL))
#define bFM4_MFS2_I2C_SSR_RDRF                 *((volatile unsigned char*)(0x427040A8UL))
#define bFM4_MFS2_I2C_SSR_ORE                  *((volatile unsigned char*)(0x427040ACUL))
#define bFM4_MFS2_I2C_SSR_TBIE                 *((volatile unsigned char*)(0x427040B0UL))
#define bFM4_MFS2_I2C_SSR_DMA                  *((volatile unsigned char*)(0x427040B4UL))
#define bFM4_MFS2_I2C_SSR_TSET                 *((volatile unsigned char*)(0x427040B8UL))
#define bFM4_MFS2_I2C_SSR_REC                  *((volatile unsigned char*)(0x427040BCUL))
#define bFM4_MFS2_I2C_ISBA_SA0                 *((volatile unsigned char*)(0x42704200UL))
#define bFM4_MFS2_I2C_ISBA_SA1                 *((volatile unsigned char*)(0x42704204UL))
#define bFM4_MFS2_I2C_ISBA_SA2                 *((volatile unsigned char*)(0x42704208UL))
#define bFM4_MFS2_I2C_ISBA_SA3                 *((volatile unsigned char*)(0x4270420CUL))
#define bFM4_MFS2_I2C_ISBA_SA4                 *((volatile unsigned char*)(0x42704210UL))
#define bFM4_MFS2_I2C_ISBA_SA5                 *((volatile unsigned char*)(0x42704214UL))
#define bFM4_MFS2_I2C_ISBA_SA6                 *((volatile unsigned char*)(0x42704218UL))
#define bFM4_MFS2_I2C_ISBA_SAEN                *((volatile unsigned char*)(0x4270421CUL))
#define bFM4_MFS2_I2C_ISMK_SM0                 *((volatile unsigned char*)(0x42704220UL))
#define bFM4_MFS2_I2C_ISMK_SM1                 *((volatile unsigned char*)(0x42704224UL))
#define bFM4_MFS2_I2C_ISMK_SM2                 *((volatile unsigned char*)(0x42704228UL))
#define bFM4_MFS2_I2C_ISMK_SM3                 *((volatile unsigned char*)(0x4270422CUL))
#define bFM4_MFS2_I2C_ISMK_SM4                 *((volatile unsigned char*)(0x42704230UL))
#define bFM4_MFS2_I2C_ISMK_SM5                 *((volatile unsigned char*)(0x42704234UL))
#define bFM4_MFS2_I2C_ISMK_SM6                 *((volatile unsigned char*)(0x42704238UL))
#define bFM4_MFS2_I2C_ISMK_EN                  *((volatile unsigned char*)(0x4270423CUL))
#define bFM4_MFS2_I2C_FCR_FE1                  *((volatile unsigned char*)(0x42704280UL))
#define bFM4_MFS2_I2C_FCR_FE2                  *((volatile unsigned char*)(0x42704284UL))
#define bFM4_MFS2_I2C_FCR_FCL1                 *((volatile unsigned char*)(0x42704288UL))
#define bFM4_MFS2_I2C_FCR_FCL2                 *((volatile unsigned char*)(0x4270428CUL))
#define bFM4_MFS2_I2C_FCR_FSET                 *((volatile unsigned char*)(0x42704290UL))
#define bFM4_MFS2_I2C_FCR_FLD                  *((volatile unsigned char*)(0x42704294UL))
#define bFM4_MFS2_I2C_FCR_FLST                 *((volatile unsigned char*)(0x42704298UL))
#define bFM4_MFS2_I2C_FCR_FSEL                 *((volatile unsigned char*)(0x427042A0UL))
#define bFM4_MFS2_I2C_FCR_FTIE                 *((volatile unsigned char*)(0x427042A4UL))
#define bFM4_MFS2_I2C_FCR_FDRQ                 *((volatile unsigned char*)(0x427042A8UL))
#define bFM4_MFS2_I2C_FCR_FRIIE                *((volatile unsigned char*)(0x427042ACUL))
#define bFM4_MFS2_I2C_FCR_FLSTE                *((volatile unsigned char*)(0x427042B0UL))
#define bFM4_MFS2_I2C_FCR0_FE1                 *((volatile unsigned char*)(0x42704280UL))
#define bFM4_MFS2_I2C_FCR0_FE2                 *((volatile unsigned char*)(0x42704284UL))
#define bFM4_MFS2_I2C_FCR0_FCL1                *((volatile unsigned char*)(0x42704288UL))
#define bFM4_MFS2_I2C_FCR0_FCL2                *((volatile unsigned char*)(0x4270428CUL))
#define bFM4_MFS2_I2C_FCR0_FSET                *((volatile unsigned char*)(0x42704290UL))
#define bFM4_MFS2_I2C_FCR0_FLD                 *((volatile unsigned char*)(0x42704294UL))
#define bFM4_MFS2_I2C_FCR0_FLST                *((volatile unsigned char*)(0x42704298UL))
#define bFM4_MFS2_I2C_FCR1_FSEL                *((volatile unsigned char*)(0x427042A0UL))
#define bFM4_MFS2_I2C_FCR1_FTIE                *((volatile unsigned char*)(0x427042A4UL))
#define bFM4_MFS2_I2C_FCR1_FDRQ                *((volatile unsigned char*)(0x427042A8UL))
#define bFM4_MFS2_I2C_FCR1_FRIIE               *((volatile unsigned char*)(0x427042ACUL))
#define bFM4_MFS2_I2C_FCR1_FLSTE               *((volatile unsigned char*)(0x427042B0UL))
#define bFM4_MFS2_I2C_FBYTE_FD0                *((volatile unsigned char*)(0x42704300UL))
#define bFM4_MFS2_I2C_FBYTE_FD1                *((volatile unsigned char*)(0x42704304UL))
#define bFM4_MFS2_I2C_FBYTE_FD2                *((volatile unsigned char*)(0x42704308UL))
#define bFM4_MFS2_I2C_FBYTE_FD3                *((volatile unsigned char*)(0x4270430CUL))
#define bFM4_MFS2_I2C_FBYTE_FD4                *((volatile unsigned char*)(0x42704310UL))
#define bFM4_MFS2_I2C_FBYTE_FD5                *((volatile unsigned char*)(0x42704314UL))
#define bFM4_MFS2_I2C_FBYTE_FD6                *((volatile unsigned char*)(0x42704318UL))
#define bFM4_MFS2_I2C_FBYTE_FD7                *((volatile unsigned char*)(0x4270431CUL))
#define bFM4_MFS2_I2C_FBYTE_FD8                *((volatile unsigned char*)(0x42704320UL))
#define bFM4_MFS2_I2C_FBYTE_FD9                *((volatile unsigned char*)(0x42704324UL))
#define bFM4_MFS2_I2C_FBYTE_FD10               *((volatile unsigned char*)(0x42704328UL))
#define bFM4_MFS2_I2C_FBYTE_FD11               *((volatile unsigned char*)(0x4270432CUL))
#define bFM4_MFS2_I2C_FBYTE_FD12               *((volatile unsigned char*)(0x42704330UL))
#define bFM4_MFS2_I2C_FBYTE_FD13               *((volatile unsigned char*)(0x42704334UL))
#define bFM4_MFS2_I2C_FBYTE_FD14               *((volatile unsigned char*)(0x42704338UL))
#define bFM4_MFS2_I2C_FBYTE_FD15               *((volatile unsigned char*)(0x4270433CUL))
#define bFM4_MFS2_I2C_FBYTE1_FD0               *((volatile unsigned char*)(0x42704300UL))
#define bFM4_MFS2_I2C_FBYTE1_FD1               *((volatile unsigned char*)(0x42704304UL))
#define bFM4_MFS2_I2C_FBYTE1_FD2               *((volatile unsigned char*)(0x42704308UL))
#define bFM4_MFS2_I2C_FBYTE1_FD3               *((volatile unsigned char*)(0x4270430CUL))
#define bFM4_MFS2_I2C_FBYTE1_FD4               *((volatile unsigned char*)(0x42704310UL))
#define bFM4_MFS2_I2C_FBYTE1_FD5               *((volatile unsigned char*)(0x42704314UL))
#define bFM4_MFS2_I2C_FBYTE1_FD6               *((volatile unsigned char*)(0x42704318UL))
#define bFM4_MFS2_I2C_FBYTE1_FD7               *((volatile unsigned char*)(0x4270431CUL))
#define bFM4_MFS2_I2C_FBYTE2_FD8               *((volatile unsigned char*)(0x42704320UL))
#define bFM4_MFS2_I2C_FBYTE2_FD9               *((volatile unsigned char*)(0x42704324UL))
#define bFM4_MFS2_I2C_FBYTE2_FD10              *((volatile unsigned char*)(0x42704328UL))
#define bFM4_MFS2_I2C_FBYTE2_FD11              *((volatile unsigned char*)(0x4270432CUL))
#define bFM4_MFS2_I2C_FBYTE2_FD12              *((volatile unsigned char*)(0x42704330UL))
#define bFM4_MFS2_I2C_FBYTE2_FD13              *((volatile unsigned char*)(0x42704334UL))
#define bFM4_MFS2_I2C_FBYTE2_FD14              *((volatile unsigned char*)(0x42704338UL))
#define bFM4_MFS2_I2C_FBYTE2_FD15              *((volatile unsigned char*)(0x4270433CUL))

