MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C58L0AGL2000A/mcu.h
/* MFS UART channel 8 registers */
#define bFM4_MFS8_UART_SMR_SOE                 *((volatile unsigned char*)(0x42710000UL))
#define bFM4_MFS8_UART_SMR_BDS                 *((volatile unsigned char*)(0x42710008UL))
#define bFM4_MFS8_UART_SMR_SBL                 *((volatile unsigned char*)(0x4271000CUL))
#define bFM4_MFS8_UART_SMR_WUCR                *((volatile unsigned char*)(0x42710010UL))
#define bFM4_MFS8_UART_SMR_MD0                 *((volatile unsigned char*)(0x42710014UL))
#define bFM4_MFS8_UART_SMR_MD1                 *((volatile unsigned char*)(0x42710018UL))
#define bFM4_MFS8_UART_SMR_MD2                 *((volatile unsigned char*)(0x4271001CUL))
#define bFM4_MFS8_UART_SCR_TXE                 *((volatile unsigned char*)(0x42710020UL))
#define bFM4_MFS8_UART_SCR_RXE                 *((volatile unsigned char*)(0x42710024UL))
#define bFM4_MFS8_UART_SCR_TBIE                *((volatile unsigned char*)(0x42710028UL))
#define bFM4_MFS8_UART_SCR_TIE                 *((volatile unsigned char*)(0x4271002CUL))
#define bFM4_MFS8_UART_SCR_RIE                 *((volatile unsigned char*)(0x42710030UL))
#define bFM4_MFS8_UART_SCR_UPCL                *((volatile unsigned char*)(0x4271003CUL))
#define bFM4_MFS8_UART_ESCR_L0                 *((volatile unsigned char*)(0x42710080UL))
#define bFM4_MFS8_UART_ESCR_L1                 *((volatile unsigned char*)(0x42710084UL))
#define bFM4_MFS8_UART_ESCR_L2                 *((volatile unsigned char*)(0x42710088UL))
#define bFM4_MFS8_UART_ESCR_P                  *((volatile unsigned char*)(0x4271008CUL))
#define bFM4_MFS8_UART_ESCR_PEN                *((volatile unsigned char*)(0x42710090UL))
#define bFM4_MFS8_UART_ESCR_INV                *((volatile unsigned char*)(0x42710094UL))
#define bFM4_MFS8_UART_ESCR_ESBL               *((volatile unsigned char*)(0x42710098UL))
#define bFM4_MFS8_UART_ESCR_FLWEN              *((volatile unsigned char*)(0x4271009CUL))
#define bFM4_MFS8_UART_SSR_TBI                 *((volatile unsigned char*)(0x427100A0UL))
#define bFM4_MFS8_UART_SSR_TDRE                *((volatile unsigned char*)(0x427100A4UL))
#define bFM4_MFS8_UART_SSR_RDRF                *((volatile unsigned char*)(0x427100A8UL))
#define bFM4_MFS8_UART_SSR_ORE                 *((volatile unsigned char*)(0x427100ACUL))
#define bFM4_MFS8_UART_SSR_FRE                 *((volatile unsigned char*)(0x427100B0UL))
#define bFM4_MFS8_UART_SSR_PE                  *((volatile unsigned char*)(0x427100B4UL))
#define bFM4_MFS8_UART_SSR_REC                 *((volatile unsigned char*)(0x427100BCUL))
#define bFM4_MFS8_UART_BGR_EXT                 *((volatile unsigned char*)(0x427101BCUL))
#define bFM4_MFS8_UART_BGR1_EXT                *((volatile unsigned char*)(0x427101BCUL))
#define bFM4_MFS8_UART_FCR_FE1                 *((volatile unsigned char*)(0x42710280UL))
#define bFM4_MFS8_UART_FCR_FE2                 *((volatile unsigned char*)(0x42710284UL))
#define bFM4_MFS8_UART_FCR_FCL1                *((volatile unsigned char*)(0x42710288UL))
#define bFM4_MFS8_UART_FCR_FCL2                *((volatile unsigned char*)(0x4271028CUL))
#define bFM4_MFS8_UART_FCR_FSET                *((volatile unsigned char*)(0x42710290UL))
#define bFM4_MFS8_UART_FCR_FLD                 *((volatile unsigned char*)(0x42710294UL))
#define bFM4_MFS8_UART_FCR_FLST                *((volatile unsigned char*)(0x42710298UL))
#define bFM4_MFS8_UART_FCR_FSEL                *((volatile unsigned char*)(0x427102A0UL))
#define bFM4_MFS8_UART_FCR_FTIE                *((volatile unsigned char*)(0x427102A4UL))
#define bFM4_MFS8_UART_FCR_FDRQ                *((volatile unsigned char*)(0x427102A8UL))
#define bFM4_MFS8_UART_FCR_FRIIE               *((volatile unsigned char*)(0x427102ACUL))
#define bFM4_MFS8_UART_FCR_FLSTE               *((volatile unsigned char*)(0x427102B0UL))
#define bFM4_MFS8_UART_FCR0_FE1                *((volatile unsigned char*)(0x42710280UL))
#define bFM4_MFS8_UART_FCR0_FE2                *((volatile unsigned char*)(0x42710284UL))
#define bFM4_MFS8_UART_FCR0_FCL1               *((volatile unsigned char*)(0x42710288UL))
#define bFM4_MFS8_UART_FCR0_FCL2               *((volatile unsigned char*)(0x4271028CUL))
#define bFM4_MFS8_UART_FCR0_FSET               *((volatile unsigned char*)(0x42710290UL))
#define bFM4_MFS8_UART_FCR0_FLD                *((volatile unsigned char*)(0x42710294UL))
#define bFM4_MFS8_UART_FCR0_FLST               *((volatile unsigned char*)(0x42710298UL))
#define bFM4_MFS8_UART_FCR1_FSEL               *((volatile unsigned char*)(0x427102A0UL))
#define bFM4_MFS8_UART_FCR1_FTIE               *((volatile unsigned char*)(0x427102A4UL))
#define bFM4_MFS8_UART_FCR1_FDRQ               *((volatile unsigned char*)(0x427102A8UL))
#define bFM4_MFS8_UART_FCR1_FRIIE              *((volatile unsigned char*)(0x427102ACUL))
#define bFM4_MFS8_UART_FCR1_FLSTE              *((volatile unsigned char*)(0x427102B0UL))
#define bFM4_MFS8_UART_FBYTE_FD0               *((volatile unsigned char*)(0x42710300UL))
#define bFM4_MFS8_UART_FBYTE_FD1               *((volatile unsigned char*)(0x42710304UL))
#define bFM4_MFS8_UART_FBYTE_FD2               *((volatile unsigned char*)(0x42710308UL))
#define bFM4_MFS8_UART_FBYTE_FD3               *((volatile unsigned char*)(0x4271030CUL))
#define bFM4_MFS8_UART_FBYTE_FD4               *((volatile unsigned char*)(0x42710310UL))
#define bFM4_MFS8_UART_FBYTE_FD5               *((volatile unsigned char*)(0x42710314UL))
#define bFM4_MFS8_UART_FBYTE_FD6               *((volatile unsigned char*)(0x42710318UL))
#define bFM4_MFS8_UART_FBYTE_FD7               *((volatile unsigned char*)(0x4271031CUL))
#define bFM4_MFS8_UART_FBYTE_FD8               *((volatile unsigned char*)(0x42710320UL))
#define bFM4_MFS8_UART_FBYTE_FD9               *((volatile unsigned char*)(0x42710324UL))
#define bFM4_MFS8_UART_FBYTE_FD10              *((volatile unsigned char*)(0x42710328UL))
#define bFM4_MFS8_UART_FBYTE_FD11              *((volatile unsigned char*)(0x4271032CUL))
#define bFM4_MFS8_UART_FBYTE_FD12              *((volatile unsigned char*)(0x42710330UL))
#define bFM4_MFS8_UART_FBYTE_FD13              *((volatile unsigned char*)(0x42710334UL))
#define bFM4_MFS8_UART_FBYTE_FD14              *((volatile unsigned char*)(0x42710338UL))
#define bFM4_MFS8_UART_FBYTE_FD15              *((volatile unsigned char*)(0x4271033CUL))
#define bFM4_MFS8_UART_FBYTE1_FD0              *((volatile unsigned char*)(0x42710300UL))
#define bFM4_MFS8_UART_FBYTE1_FD1              *((volatile unsigned char*)(0x42710304UL))
#define bFM4_MFS8_UART_FBYTE1_FD2              *((volatile unsigned char*)(0x42710308UL))
#define bFM4_MFS8_UART_FBYTE1_FD3              *((volatile unsigned char*)(0x4271030CUL))
#define bFM4_MFS8_UART_FBYTE1_FD4              *((volatile unsigned char*)(0x42710310UL))
#define bFM4_MFS8_UART_FBYTE1_FD5              *((volatile unsigned char*)(0x42710314UL))
#define bFM4_MFS8_UART_FBYTE1_FD6              *((volatile unsigned char*)(0x42710318UL))
#define bFM4_MFS8_UART_FBYTE1_FD7              *((volatile unsigned char*)(0x4271031CUL))
#define bFM4_MFS8_UART_FBYTE2_FD8              *((volatile unsigned char*)(0x42710320UL))
#define bFM4_MFS8_UART_FBYTE2_FD9              *((volatile unsigned char*)(0x42710324UL))
#define bFM4_MFS8_UART_FBYTE2_FD10             *((volatile unsigned char*)(0x42710328UL))
#define bFM4_MFS8_UART_FBYTE2_FD11             *((volatile unsigned char*)(0x4271032CUL))
#define bFM4_MFS8_UART_FBYTE2_FD12             *((volatile unsigned char*)(0x42710330UL))
#define bFM4_MFS8_UART_FBYTE2_FD13             *((volatile unsigned char*)(0x42710334UL))
#define bFM4_MFS8_UART_FBYTE2_FD14             *((volatile unsigned char*)(0x42710338UL))
#define bFM4_MFS8_UART_FBYTE2_FD15             *((volatile unsigned char*)(0x4271033CUL))

