MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C58L0AGL2000A/mcu.h
/* MFS I2C channel 15 registers */
#define bFM4_MFS15_I2C_SMR_TIE                 *((volatile unsigned char*)(0x4271E008UL))
#define bFM4_MFS15_I2C_SMR_RIE                 *((volatile unsigned char*)(0x4271E00CUL))
#define bFM4_MFS15_I2C_SMR_MD0                 *((volatile unsigned char*)(0x4271E014UL))
#define bFM4_MFS15_I2C_SMR_MD1                 *((volatile unsigned char*)(0x4271E018UL))
#define bFM4_MFS15_I2C_SMR_MD2                 *((volatile unsigned char*)(0x4271E01CUL))
#define bFM4_MFS15_I2C_IBCR_INT                *((volatile unsigned char*)(0x4271E020UL))
#define bFM4_MFS15_I2C_IBCR_BER                *((volatile unsigned char*)(0x4271E024UL))
#define bFM4_MFS15_I2C_IBCR_INTE               *((volatile unsigned char*)(0x4271E028UL))
#define bFM4_MFS15_I2C_IBCR_CNDE               *((volatile unsigned char*)(0x4271E02CUL))
#define bFM4_MFS15_I2C_IBCR_WSEL               *((volatile unsigned char*)(0x4271E030UL))
#define bFM4_MFS15_I2C_IBCR_ACKE               *((volatile unsigned char*)(0x4271E034UL))
#define bFM4_MFS15_I2C_IBCR_ACT                *((volatile unsigned char*)(0x4271E038UL))
#define bFM4_MFS15_I2C_IBCR_SCC                *((volatile unsigned char*)(0x4271E038UL))
#define bFM4_MFS15_I2C_IBCR_MSS                *((volatile unsigned char*)(0x4271E03CUL))
#define bFM4_MFS15_I2C_IBSR_BB                 *((volatile unsigned char*)(0x4271E080UL))
#define bFM4_MFS15_I2C_IBSR_SPC                *((volatile unsigned char*)(0x4271E084UL))
#define bFM4_MFS15_I2C_IBSR_RSC                *((volatile unsigned char*)(0x4271E088UL))
#define bFM4_MFS15_I2C_IBSR_AL                 *((volatile unsigned char*)(0x4271E08CUL))
#define bFM4_MFS15_I2C_IBSR_TRX                *((volatile unsigned char*)(0x4271E090UL))
#define bFM4_MFS15_I2C_IBSR_RSA                *((volatile unsigned char*)(0x4271E094UL))
#define bFM4_MFS15_I2C_IBSR_RACK               *((volatile unsigned char*)(0x4271E098UL))
#define bFM4_MFS15_I2C_IBSR_FBT                *((volatile unsigned char*)(0x4271E09CUL))
#define bFM4_MFS15_I2C_SSR_TBI                 *((volatile unsigned char*)(0x4271E0A0UL))
#define bFM4_MFS15_I2C_SSR_TDRE                *((volatile unsigned char*)(0x4271E0A4UL))
#define bFM4_MFS15_I2C_SSR_RDRF                *((volatile unsigned char*)(0x4271E0A8UL))
#define bFM4_MFS15_I2C_SSR_ORE                 *((volatile unsigned char*)(0x4271E0ACUL))
#define bFM4_MFS15_I2C_SSR_TBIE                *((volatile unsigned char*)(0x4271E0B0UL))
#define bFM4_MFS15_I2C_SSR_DMA                 *((volatile unsigned char*)(0x4271E0B4UL))
#define bFM4_MFS15_I2C_SSR_TSET                *((volatile unsigned char*)(0x4271E0B8UL))
#define bFM4_MFS15_I2C_SSR_REC                 *((volatile unsigned char*)(0x4271E0BCUL))
#define bFM4_MFS15_I2C_ISBA_SA0                *((volatile unsigned char*)(0x4271E200UL))
#define bFM4_MFS15_I2C_ISBA_SA1                *((volatile unsigned char*)(0x4271E204UL))
#define bFM4_MFS15_I2C_ISBA_SA2                *((volatile unsigned char*)(0x4271E208UL))
#define bFM4_MFS15_I2C_ISBA_SA3                *((volatile unsigned char*)(0x4271E20CUL))
#define bFM4_MFS15_I2C_ISBA_SA4                *((volatile unsigned char*)(0x4271E210UL))
#define bFM4_MFS15_I2C_ISBA_SA5                *((volatile unsigned char*)(0x4271E214UL))
#define bFM4_MFS15_I2C_ISBA_SA6                *((volatile unsigned char*)(0x4271E218UL))
#define bFM4_MFS15_I2C_ISBA_SAEN               *((volatile unsigned char*)(0x4271E21CUL))
#define bFM4_MFS15_I2C_ISMK_SM0                *((volatile unsigned char*)(0x4271E220UL))
#define bFM4_MFS15_I2C_ISMK_SM1                *((volatile unsigned char*)(0x4271E224UL))
#define bFM4_MFS15_I2C_ISMK_SM2                *((volatile unsigned char*)(0x4271E228UL))
#define bFM4_MFS15_I2C_ISMK_SM3                *((volatile unsigned char*)(0x4271E22CUL))
#define bFM4_MFS15_I2C_ISMK_SM4                *((volatile unsigned char*)(0x4271E230UL))
#define bFM4_MFS15_I2C_ISMK_SM5                *((volatile unsigned char*)(0x4271E234UL))
#define bFM4_MFS15_I2C_ISMK_SM6                *((volatile unsigned char*)(0x4271E238UL))
#define bFM4_MFS15_I2C_ISMK_EN                 *((volatile unsigned char*)(0x4271E23CUL))
#define bFM4_MFS15_I2C_FCR_FE1                 *((volatile unsigned char*)(0x4271E280UL))
#define bFM4_MFS15_I2C_FCR_FE2                 *((volatile unsigned char*)(0x4271E284UL))
#define bFM4_MFS15_I2C_FCR_FCL1                *((volatile unsigned char*)(0x4271E288UL))
#define bFM4_MFS15_I2C_FCR_FCL2                *((volatile unsigned char*)(0x4271E28CUL))
#define bFM4_MFS15_I2C_FCR_FSET                *((volatile unsigned char*)(0x4271E290UL))
#define bFM4_MFS15_I2C_FCR_FLD                 *((volatile unsigned char*)(0x4271E294UL))
#define bFM4_MFS15_I2C_FCR_FLST                *((volatile unsigned char*)(0x4271E298UL))
#define bFM4_MFS15_I2C_FCR_FSEL                *((volatile unsigned char*)(0x4271E2A0UL))
#define bFM4_MFS15_I2C_FCR_FTIE                *((volatile unsigned char*)(0x4271E2A4UL))
#define bFM4_MFS15_I2C_FCR_FDRQ                *((volatile unsigned char*)(0x4271E2A8UL))
#define bFM4_MFS15_I2C_FCR_FRIIE               *((volatile unsigned char*)(0x4271E2ACUL))
#define bFM4_MFS15_I2C_FCR_FLSTE               *((volatile unsigned char*)(0x4271E2B0UL))
#define bFM4_MFS15_I2C_FCR0_FE1                *((volatile unsigned char*)(0x4271E280UL))
#define bFM4_MFS15_I2C_FCR0_FE2                *((volatile unsigned char*)(0x4271E284UL))
#define bFM4_MFS15_I2C_FCR0_FCL1               *((volatile unsigned char*)(0x4271E288UL))
#define bFM4_MFS15_I2C_FCR0_FCL2               *((volatile unsigned char*)(0x4271E28CUL))
#define bFM4_MFS15_I2C_FCR0_FSET               *((volatile unsigned char*)(0x4271E290UL))
#define bFM4_MFS15_I2C_FCR0_FLD                *((volatile unsigned char*)(0x4271E294UL))
#define bFM4_MFS15_I2C_FCR0_FLST               *((volatile unsigned char*)(0x4271E298UL))
#define bFM4_MFS15_I2C_FCR1_FSEL               *((volatile unsigned char*)(0x4271E2A0UL))
#define bFM4_MFS15_I2C_FCR1_FTIE               *((volatile unsigned char*)(0x4271E2A4UL))
#define bFM4_MFS15_I2C_FCR1_FDRQ               *((volatile unsigned char*)(0x4271E2A8UL))
#define bFM4_MFS15_I2C_FCR1_FRIIE              *((volatile unsigned char*)(0x4271E2ACUL))
#define bFM4_MFS15_I2C_FCR1_FLSTE              *((volatile unsigned char*)(0x4271E2B0UL))
#define bFM4_MFS15_I2C_FBYTE_FD0               *((volatile unsigned char*)(0x4271E300UL))
#define bFM4_MFS15_I2C_FBYTE_FD1               *((volatile unsigned char*)(0x4271E304UL))
#define bFM4_MFS15_I2C_FBYTE_FD2               *((volatile unsigned char*)(0x4271E308UL))
#define bFM4_MFS15_I2C_FBYTE_FD3               *((volatile unsigned char*)(0x4271E30CUL))
#define bFM4_MFS15_I2C_FBYTE_FD4               *((volatile unsigned char*)(0x4271E310UL))
#define bFM4_MFS15_I2C_FBYTE_FD5               *((volatile unsigned char*)(0x4271E314UL))
#define bFM4_MFS15_I2C_FBYTE_FD6               *((volatile unsigned char*)(0x4271E318UL))
#define bFM4_MFS15_I2C_FBYTE_FD7               *((volatile unsigned char*)(0x4271E31CUL))
#define bFM4_MFS15_I2C_FBYTE_FD8               *((volatile unsigned char*)(0x4271E320UL))
#define bFM4_MFS15_I2C_FBYTE_FD9               *((volatile unsigned char*)(0x4271E324UL))
#define bFM4_MFS15_I2C_FBYTE_FD10              *((volatile unsigned char*)(0x4271E328UL))
#define bFM4_MFS15_I2C_FBYTE_FD11              *((volatile unsigned char*)(0x4271E32CUL))
#define bFM4_MFS15_I2C_FBYTE_FD12              *((volatile unsigned char*)(0x4271E330UL))
#define bFM4_MFS15_I2C_FBYTE_FD13              *((volatile unsigned char*)(0x4271E334UL))
#define bFM4_MFS15_I2C_FBYTE_FD14              *((volatile unsigned char*)(0x4271E338UL))
#define bFM4_MFS15_I2C_FBYTE_FD15              *((volatile unsigned char*)(0x4271E33CUL))
#define bFM4_MFS15_I2C_FBYTE1_FD0              *((volatile unsigned char*)(0x4271E300UL))
#define bFM4_MFS15_I2C_FBYTE1_FD1              *((volatile unsigned char*)(0x4271E304UL))
#define bFM4_MFS15_I2C_FBYTE1_FD2              *((volatile unsigned char*)(0x4271E308UL))
#define bFM4_MFS15_I2C_FBYTE1_FD3              *((volatile unsigned char*)(0x4271E30CUL))
#define bFM4_MFS15_I2C_FBYTE1_FD4              *((volatile unsigned char*)(0x4271E310UL))
#define bFM4_MFS15_I2C_FBYTE1_FD5              *((volatile unsigned char*)(0x4271E314UL))
#define bFM4_MFS15_I2C_FBYTE1_FD6              *((volatile unsigned char*)(0x4271E318UL))
#define bFM4_MFS15_I2C_FBYTE1_FD7              *((volatile unsigned char*)(0x4271E31CUL))
#define bFM4_MFS15_I2C_FBYTE2_FD8              *((volatile unsigned char*)(0x4271E320UL))
#define bFM4_MFS15_I2C_FBYTE2_FD9              *((volatile unsigned char*)(0x4271E324UL))
#define bFM4_MFS15_I2C_FBYTE2_FD10             *((volatile unsigned char*)(0x4271E328UL))
#define bFM4_MFS15_I2C_FBYTE2_FD11             *((volatile unsigned char*)(0x4271E32CUL))
#define bFM4_MFS15_I2C_FBYTE2_FD12             *((volatile unsigned char*)(0x4271E330UL))
#define bFM4_MFS15_I2C_FBYTE2_FD13             *((volatile unsigned char*)(0x4271E334UL))
#define bFM4_MFS15_I2C_FBYTE2_FD14             *((volatile unsigned char*)(0x4271E338UL))
#define bFM4_MFS15_I2C_FBYTE2_FD15             *((volatile unsigned char*)(0x4271E33CUL))

/* CRC registers */
#define bFM4_CRC_CRCCR_INIT                    *((volatile unsigned char*)(0x42720000UL))
#define bFM4_CRC_CRCCR_CRC32                   *((volatile unsigned char*)(0x42720004UL))
#define bFM4_CRC_CRCCR_LTLEND                  *((volatile unsigned char*)(0x42720008UL))
#define bFM4_CRC_CRCCR_LSBFST                  *((volatile unsigned char*)(0x4272000CUL))
#define bFM4_CRC_CRCCR_CRCLTE                  *((volatile unsigned char*)(0x42720010UL))
#define bFM4_CRC_CRCCR_CRCLSF                  *((volatile unsigned char*)(0x42720014UL))
#define bFM4_CRC_CRCCR_FXOR                    *((volatile unsigned char*)(0x42720018UL))

