MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C58L0AGL2000A/mcu.h
/* I2S interface ch.0 registers */
#define bFM4_I2S0_RXFDAT_RXDATA0               *((volatile unsigned char*)(0x42D80000UL))
#define bFM4_I2S0_RXFDAT_RXDATA1               *((volatile unsigned char*)(0x42D80004UL))
#define bFM4_I2S0_RXFDAT_RXDATA2               *((volatile unsigned char*)(0x42D80008UL))
#define bFM4_I2S0_RXFDAT_RXDATA3               *((volatile unsigned char*)(0x42D8000CUL))
#define bFM4_I2S0_RXFDAT_RXDATA4               *((volatile unsigned char*)(0x42D80010UL))
#define bFM4_I2S0_RXFDAT_RXDATA5               *((volatile unsigned char*)(0x42D80014UL))
#define bFM4_I2S0_RXFDAT_RXDATA6               *((volatile unsigned char*)(0x42D80018UL))
#define bFM4_I2S0_RXFDAT_RXDATA7               *((volatile unsigned char*)(0x42D8001CUL))
#define bFM4_I2S0_RXFDAT_RXDATA8               *((volatile unsigned char*)(0x42D80020UL))
#define bFM4_I2S0_RXFDAT_RXDATA9               *((volatile unsigned char*)(0x42D80024UL))
#define bFM4_I2S0_RXFDAT_RXDATA10              *((volatile unsigned char*)(0x42D80028UL))
#define bFM4_I2S0_RXFDAT_RXDATA11              *((volatile unsigned char*)(0x42D8002CUL))
#define bFM4_I2S0_RXFDAT_RXDATA12              *((volatile unsigned char*)(0x42D80030UL))
#define bFM4_I2S0_RXFDAT_RXDATA13              *((volatile unsigned char*)(0x42D80034UL))
#define bFM4_I2S0_RXFDAT_RXDATA14              *((volatile unsigned char*)(0x42D80038UL))
#define bFM4_I2S0_RXFDAT_RXDATA15              *((volatile unsigned char*)(0x42D8003CUL))
#define bFM4_I2S0_RXFDAT_RXDATA16              *((volatile unsigned char*)(0x42D80040UL))
#define bFM4_I2S0_RXFDAT_RXDATA17              *((volatile unsigned char*)(0x42D80044UL))
#define bFM4_I2S0_RXFDAT_RXDATA18              *((volatile unsigned char*)(0x42D80048UL))
#define bFM4_I2S0_RXFDAT_RXDATA19              *((volatile unsigned char*)(0x42D8004CUL))
#define bFM4_I2S0_RXFDAT_RXDATA20              *((volatile unsigned char*)(0x42D80050UL))
#define bFM4_I2S0_RXFDAT_RXDATA21              *((volatile unsigned char*)(0x42D80054UL))
#define bFM4_I2S0_RXFDAT_RXDATA22              *((volatile unsigned char*)(0x42D80058UL))
#define bFM4_I2S0_RXFDAT_RXDATA23              *((volatile unsigned char*)(0x42D8005CUL))
#define bFM4_I2S0_RXFDAT_RXDATA24              *((volatile unsigned char*)(0x42D80060UL))
#define bFM4_I2S0_RXFDAT_RXDATA25              *((volatile unsigned char*)(0x42D80064UL))
#define bFM4_I2S0_RXFDAT_RXDATA26              *((volatile unsigned char*)(0x42D80068UL))
#define bFM4_I2S0_RXFDAT_RXDATA27              *((volatile unsigned char*)(0x42D8006CUL))
#define bFM4_I2S0_RXFDAT_RXDATA28              *((volatile unsigned char*)(0x42D80070UL))
#define bFM4_I2S0_RXFDAT_RXDATA29              *((volatile unsigned char*)(0x42D80074UL))
#define bFM4_I2S0_RXFDAT_RXDATA30              *((volatile unsigned char*)(0x42D80078UL))
#define bFM4_I2S0_RXFDAT_RXDATA31              *((volatile unsigned char*)(0x42D8007CUL))
#define bFM4_I2S0_TXFDAT_TXDATA0               *((volatile unsigned char*)(0x42D80080UL))
#define bFM4_I2S0_TXFDAT_TXDATA1               *((volatile unsigned char*)(0x42D80084UL))
#define bFM4_I2S0_TXFDAT_TXDATA2               *((volatile unsigned char*)(0x42D80088UL))
#define bFM4_I2S0_TXFDAT_TXDATA3               *((volatile unsigned char*)(0x42D8008CUL))
#define bFM4_I2S0_TXFDAT_TXDATA4               *((volatile unsigned char*)(0x42D80090UL))
#define bFM4_I2S0_TXFDAT_TXDATA5               *((volatile unsigned char*)(0x42D80094UL))
#define bFM4_I2S0_TXFDAT_TXDATA6               *((volatile unsigned char*)(0x42D80098UL))
#define bFM4_I2S0_TXFDAT_TXDATA7               *((volatile unsigned char*)(0x42D8009CUL))
#define bFM4_I2S0_TXFDAT_TXDATA8               *((volatile unsigned char*)(0x42D800A0UL))
#define bFM4_I2S0_TXFDAT_TXDATA9               *((volatile unsigned char*)(0x42D800A4UL))
#define bFM4_I2S0_TXFDAT_TXDATA10              *((volatile unsigned char*)(0x42D800A8UL))
#define bFM4_I2S0_TXFDAT_TXDATA11              *((volatile unsigned char*)(0x42D800ACUL))
#define bFM4_I2S0_TXFDAT_TXDATA12              *((volatile unsigned char*)(0x42D800B0UL))
#define bFM4_I2S0_TXFDAT_TXDATA13              *((volatile unsigned char*)(0x42D800B4UL))
#define bFM4_I2S0_TXFDAT_TXDATA14              *((volatile unsigned char*)(0x42D800B8UL))
#define bFM4_I2S0_TXFDAT_TXDATA15              *((volatile unsigned char*)(0x42D800BCUL))
#define bFM4_I2S0_TXFDAT_TXDATA16              *((volatile unsigned char*)(0x42D800C0UL))
#define bFM4_I2S0_TXFDAT_TXDATA17              *((volatile unsigned char*)(0x42D800C4UL))
#define bFM4_I2S0_TXFDAT_TXDATA18              *((volatile unsigned char*)(0x42D800C8UL))
#define bFM4_I2S0_TXFDAT_TXDATA19              *((volatile unsigned char*)(0x42D800CCUL))
#define bFM4_I2S0_TXFDAT_TXDATA20              *((volatile unsigned char*)(0x42D800D0UL))
#define bFM4_I2S0_TXFDAT_TXDATA21              *((volatile unsigned char*)(0x42D800D4UL))
#define bFM4_I2S0_TXFDAT_TXDATA22              *((volatile unsigned char*)(0x42D800D8UL))
#define bFM4_I2S0_TXFDAT_TXDATA23              *((volatile unsigned char*)(0x42D800DCUL))
#define bFM4_I2S0_TXFDAT_TXDATA24              *((volatile unsigned char*)(0x42D800E0UL))
#define bFM4_I2S0_TXFDAT_TXDATA25              *((volatile unsigned char*)(0x42D800E4UL))
#define bFM4_I2S0_TXFDAT_TXDATA26              *((volatile unsigned char*)(0x42D800E8UL))
#define bFM4_I2S0_TXFDAT_TXDATA27              *((volatile unsigned char*)(0x42D800ECUL))
#define bFM4_I2S0_TXFDAT_TXDATA28              *((volatile unsigned char*)(0x42D800F0UL))
#define bFM4_I2S0_TXFDAT_TXDATA29              *((volatile unsigned char*)(0x42D800F4UL))
#define bFM4_I2S0_TXFDAT_TXDATA30              *((volatile unsigned char*)(0x42D800F8UL))
#define bFM4_I2S0_TXFDAT_TXDATA31              *((volatile unsigned char*)(0x42D800FCUL))
#define bFM4_I2S0_CNTREG_FSPL                  *((volatile unsigned char*)(0x42D80100UL))
#define bFM4_I2S0_CNTREG_FSLN                  *((volatile unsigned char*)(0x42D80104UL))
#define bFM4_I2S0_CNTREG_FSPH                  *((volatile unsigned char*)(0x42D80108UL))
#define bFM4_I2S0_CNTREG_CPOL                  *((volatile unsigned char*)(0x42D8010CUL))
#define bFM4_I2S0_CNTREG_SMPL                  *((volatile unsigned char*)(0x42D80110UL))
#define bFM4_I2S0_CNTREG_RXDIS                 *((volatile unsigned char*)(0x42D80114UL))
#define bFM4_I2S0_CNTREG_TXDIS                 *((volatile unsigned char*)(0x42D80118UL))
#define bFM4_I2S0_CNTREG_MLSB                  *((volatile unsigned char*)(0x42D8011CUL))
#define bFM4_I2S0_CNTREG_FRUN                  *((volatile unsigned char*)(0x42D80120UL))
#define bFM4_I2S0_CNTREG_BEXT                  *((volatile unsigned char*)(0x42D80124UL))
#define bFM4_I2S0_CNTREG_ECKM                  *((volatile unsigned char*)(0x42D80128UL))
#define bFM4_I2S0_CNTREG_RHLL                  *((volatile unsigned char*)(0x42D8012CUL))
#define bFM4_I2S0_CNTREG_SBFN                  *((volatile unsigned char*)(0x42D80130UL))
#define bFM4_I2S0_CNTREG_MSMD                  *((volatile unsigned char*)(0x42D80134UL))
#define bFM4_I2S0_CNTREG_MSKB                  *((volatile unsigned char*)(0x42D80138UL))
#define bFM4_I2S0_CNTREG_OVHD0                 *((volatile unsigned char*)(0x42D80140UL))
#define bFM4_I2S0_CNTREG_OVHD1                 *((volatile unsigned char*)(0x42D80144UL))
#define bFM4_I2S0_CNTREG_OVHD2                 *((volatile unsigned char*)(0x42D80148UL))
#define bFM4_I2S0_CNTREG_OVHD3                 *((volatile unsigned char*)(0x42D8014CUL))
#define bFM4_I2S0_CNTREG_OVHD4                 *((volatile unsigned char*)(0x42D80150UL))
#define bFM4_I2S0_CNTREG_OVHD5                 *((volatile unsigned char*)(0x42D80154UL))
#define bFM4_I2S0_CNTREG_OVHD6                 *((volatile unsigned char*)(0x42D80158UL))
#define bFM4_I2S0_CNTREG_OVHD7                 *((volatile unsigned char*)(0x42D8015CUL))
#define bFM4_I2S0_CNTREG_OVHD8                 *((volatile unsigned char*)(0x42D80160UL))
#define bFM4_I2S0_CNTREG_OVHD9                 *((volatile unsigned char*)(0x42D80164UL))
#define bFM4_I2S0_CNTREG_CKRT0                 *((volatile unsigned char*)(0x42D80168UL))
#define bFM4_I2S0_CNTREG_CKRT1                 *((volatile unsigned char*)(0x42D8016CUL))
#define bFM4_I2S0_CNTREG_CKRT2                 *((volatile unsigned char*)(0x42D80170UL))
#define bFM4_I2S0_CNTREG_CKRT3                 *((volatile unsigned char*)(0x42D80174UL))
#define bFM4_I2S0_CNTREG_CKRT4                 *((volatile unsigned char*)(0x42D80178UL))
#define bFM4_I2S0_CNTREG_CKRT5                 *((volatile unsigned char*)(0x42D8017CUL))
#define bFM4_I2S0_MCR0REG_S0WDL0               *((volatile unsigned char*)(0x42D80180UL))
#define bFM4_I2S0_MCR0REG_S0WDL1               *((volatile unsigned char*)(0x42D80184UL))
#define bFM4_I2S0_MCR0REG_S0WDL2               *((volatile unsigned char*)(0x42D80188UL))
#define bFM4_I2S0_MCR0REG_S0WDL3               *((volatile unsigned char*)(0x42D8018CUL))
#define bFM4_I2S0_MCR0REG_S0WDL4               *((volatile unsigned char*)(0x42D80190UL))
#define bFM4_I2S0_MCR0REG_S0CHL0               *((volatile unsigned char*)(0x42D80194UL))
#define bFM4_I2S0_MCR0REG_S0CHL1               *((volatile unsigned char*)(0x42D80198UL))
#define bFM4_I2S0_MCR0REG_S0CHL2               *((volatile unsigned char*)(0x42D8019CUL))
#define bFM4_I2S0_MCR0REG_S0CHL3               *((volatile unsigned char*)(0x42D801A0UL))
#define bFM4_I2S0_MCR0REG_S0CHL4               *((volatile unsigned char*)(0x42D801A4UL))
#define bFM4_I2S0_MCR0REG_S0CHN0               *((volatile unsigned char*)(0x42D801A8UL))
#define bFM4_I2S0_MCR0REG_S0CHN1               *((volatile unsigned char*)(0x42D801ACUL))
#define bFM4_I2S0_MCR0REG_S0CHN2               *((volatile unsigned char*)(0x42D801B0UL))
#define bFM4_I2S0_MCR0REG_S0CHN3               *((volatile unsigned char*)(0x42D801B4UL))
#define bFM4_I2S0_MCR0REG_S0CHN4               *((volatile unsigned char*)(0x42D801B8UL))
#define bFM4_I2S0_MCR0REG_S1WDL0               *((volatile unsigned char*)(0x42D801C0UL))
#define bFM4_I2S0_MCR0REG_S1WDL1               *((volatile unsigned char*)(0x42D801C4UL))
#define bFM4_I2S0_MCR0REG_S1WDL2               *((volatile unsigned char*)(0x42D801C8UL))
#define bFM4_I2S0_MCR0REG_S1WDL3               *((volatile unsigned char*)(0x42D801CCUL))
#define bFM4_I2S0_MCR0REG_S1WDL4               *((volatile unsigned char*)(0x42D801D0UL))
#define bFM4_I2S0_MCR0REG_S1CHL0               *((volatile unsigned char*)(0x42D801D4UL))
#define bFM4_I2S0_MCR0REG_S1CHL1               *((volatile unsigned char*)(0x42D801D8UL))
#define bFM4_I2S0_MCR0REG_S1CHL2               *((volatile unsigned char*)(0x42D801DCUL))
#define bFM4_I2S0_MCR0REG_S1CHL3               *((volatile unsigned char*)(0x42D801E0UL))
#define bFM4_I2S0_MCR0REG_S1CHL4               *((volatile unsigned char*)(0x42D801E4UL))
#define bFM4_I2S0_MCR0REG_S1CHN0               *((volatile unsigned char*)(0x42D801E8UL))
#define bFM4_I2S0_MCR0REG_S1CHN1               *((volatile unsigned char*)(0x42D801ECUL))
#define bFM4_I2S0_MCR0REG_S1CHN2               *((volatile unsigned char*)(0x42D801F0UL))
#define bFM4_I2S0_MCR0REG_S1CHN3               *((volatile unsigned char*)(0x42D801F4UL))
#define bFM4_I2S0_MCR0REG_S1CHN4               *((volatile unsigned char*)(0x42D801F8UL))
#define bFM4_I2S0_MCR1REG_S0CH00               *((volatile unsigned char*)(0x42D80200UL))
#define bFM4_I2S0_MCR1REG_S0CH01               *((volatile unsigned char*)(0x42D80204UL))
#define bFM4_I2S0_MCR1REG_S0CH02               *((volatile unsigned char*)(0x42D80208UL))
#define bFM4_I2S0_MCR1REG_S0CH03               *((volatile unsigned char*)(0x42D8020CUL))
#define bFM4_I2S0_MCR1REG_S0CH04               *((volatile unsigned char*)(0x42D80210UL))
#define bFM4_I2S0_MCR1REG_S0CH05               *((volatile unsigned char*)(0x42D80214UL))
#define bFM4_I2S0_MCR1REG_S0CH06               *((volatile unsigned char*)(0x42D80218UL))
#define bFM4_I2S0_MCR1REG_S0CH07               *((volatile unsigned char*)(0x42D8021CUL))
#define bFM4_I2S0_MCR1REG_S0CH08               *((volatile unsigned char*)(0x42D80220UL))
#define bFM4_I2S0_MCR1REG_S0CH09               *((volatile unsigned char*)(0x42D80224UL))
#define bFM4_I2S0_MCR1REG_S0CH10               *((volatile unsigned char*)(0x42D80228UL))
#define bFM4_I2S0_MCR1REG_S0CH11               *((volatile unsigned char*)(0x42D8022CUL))
#define bFM4_I2S0_MCR1REG_S0CH12               *((volatile unsigned char*)(0x42D80230UL))
#define bFM4_I2S0_MCR1REG_S0CH13               *((volatile unsigned char*)(0x42D80234UL))
#define bFM4_I2S0_MCR1REG_S0CH14               *((volatile unsigned char*)(0x42D80238UL))
#define bFM4_I2S0_MCR1REG_S0CH15               *((volatile unsigned char*)(0x42D8023CUL))
#define bFM4_I2S0_MCR1REG_S0CH16               *((volatile unsigned char*)(0x42D80240UL))
#define bFM4_I2S0_MCR1REG_S0CH17               *((volatile unsigned char*)(0x42D80244UL))
#define bFM4_I2S0_MCR1REG_S0CH18               *((volatile unsigned char*)(0x42D80248UL))
#define bFM4_I2S0_MCR1REG_S0CH19               *((volatile unsigned char*)(0x42D8024CUL))
#define bFM4_I2S0_MCR1REG_S0CH20               *((volatile unsigned char*)(0x42D80250UL))
#define bFM4_I2S0_MCR1REG_S0CH21               *((volatile unsigned char*)(0x42D80254UL))
#define bFM4_I2S0_MCR1REG_S0CH22               *((volatile unsigned char*)(0x42D80258UL))
#define bFM4_I2S0_MCR1REG_S0CH23               *((volatile unsigned char*)(0x42D8025CUL))
#define bFM4_I2S0_MCR1REG_S0CH24               *((volatile unsigned char*)(0x42D80260UL))
#define bFM4_I2S0_MCR1REG_S0CH25               *((volatile unsigned char*)(0x42D80264UL))
#define bFM4_I2S0_MCR1REG_S0CH26               *((volatile unsigned char*)(0x42D80268UL))
#define bFM4_I2S0_MCR1REG_S0CH27               *((volatile unsigned char*)(0x42D8026CUL))
#define bFM4_I2S0_MCR1REG_S0CH28               *((volatile unsigned char*)(0x42D80270UL))
#define bFM4_I2S0_MCR1REG_S0CH29               *((volatile unsigned char*)(0x42D80274UL))
#define bFM4_I2S0_MCR1REG_S0CH30               *((volatile unsigned char*)(0x42D80278UL))
#define bFM4_I2S0_MCR1REG_S0CH31               *((volatile unsigned char*)(0x42D8027CUL))
#define bFM4_I2S0_MCR2REG_S1CH00               *((volatile unsigned char*)(0x42D80280UL))
#define bFM4_I2S0_MCR2REG_S1CH01               *((volatile unsigned char*)(0x42D80284UL))
#define bFM4_I2S0_MCR2REG_S1CH02               *((volatile unsigned char*)(0x42D80288UL))
#define bFM4_I2S0_MCR2REG_S1CH03               *((volatile unsigned char*)(0x42D8028CUL))
#define bFM4_I2S0_MCR2REG_S1CH04               *((volatile unsigned char*)(0x42D80290UL))
#define bFM4_I2S0_MCR2REG_S1CH05               *((volatile unsigned char*)(0x42D80294UL))
#define bFM4_I2S0_MCR2REG_S1CH06               *((volatile unsigned char*)(0x42D80298UL))
#define bFM4_I2S0_MCR2REG_S1CH07               *((volatile unsigned char*)(0x42D8029CUL))
#define bFM4_I2S0_MCR2REG_S1CH08               *((volatile unsigned char*)(0x42D802A0UL))
#define bFM4_I2S0_MCR2REG_S1CH09               *((volatile unsigned char*)(0x42D802A4UL))
#define bFM4_I2S0_MCR2REG_S1CH10               *((volatile unsigned char*)(0x42D802A8UL))
#define bFM4_I2S0_MCR2REG_S1CH11               *((volatile unsigned char*)(0x42D802ACUL))
#define bFM4_I2S0_MCR2REG_S1CH12               *((volatile unsigned char*)(0x42D802B0UL))
#define bFM4_I2S0_MCR2REG_S1CH13               *((volatile unsigned char*)(0x42D802B4UL))
#define bFM4_I2S0_MCR2REG_S1CH14               *((volatile unsigned char*)(0x42D802B8UL))
#define bFM4_I2S0_MCR2REG_S1CH15               *((volatile unsigned char*)(0x42D802BCUL))
#define bFM4_I2S0_MCR2REG_S1CH16               *((volatile unsigned char*)(0x42D802C0UL))
#define bFM4_I2S0_MCR2REG_S1CH17               *((volatile unsigned char*)(0x42D802C4UL))
#define bFM4_I2S0_MCR2REG_S1CH18               *((volatile unsigned char*)(0x42D802C8UL))
#define bFM4_I2S0_MCR2REG_S1CH19               *((volatile unsigned char*)(0x42D802CCUL))
#define bFM4_I2S0_MCR2REG_S1CH20               *((volatile unsigned char*)(0x42D802D0UL))
#define bFM4_I2S0_MCR2REG_S1CH21               *((volatile unsigned char*)(0x42D802D4UL))
#define bFM4_I2S0_MCR2REG_S1CH22               *((volatile unsigned char*)(0x42D802D8UL))
#define bFM4_I2S0_MCR2REG_S1CH23               *((volatile unsigned char*)(0x42D802DCUL))
#define bFM4_I2S0_MCR2REG_S1CH24               *((volatile unsigned char*)(0x42D802E0UL))
#define bFM4_I2S0_MCR2REG_S1CH25               *((volatile unsigned char*)(0x42D802E4UL))
#define bFM4_I2S0_MCR2REG_S1CH26               *((volatile unsigned char*)(0x42D802E8UL))
#define bFM4_I2S0_MCR2REG_S1CH27               *((volatile unsigned char*)(0x42D802ECUL))
#define bFM4_I2S0_MCR2REG_S1CH28               *((volatile unsigned char*)(0x42D802F0UL))
#define bFM4_I2S0_MCR2REG_S1CH29               *((volatile unsigned char*)(0x42D802F4UL))
#define bFM4_I2S0_MCR2REG_S1CH30               *((volatile unsigned char*)(0x42D802F8UL))
#define bFM4_I2S0_MCR2REG_S1CH31               *((volatile unsigned char*)(0x42D802FCUL))
#define bFM4_I2S0_OPRREG_START                 *((volatile unsigned char*)(0x42D80300UL))
#define bFM4_I2S0_OPRREG_TXENB                 *((volatile unsigned char*)(0x42D80340UL))
#define bFM4_I2S0_OPRREG_RXENB                 *((volatile unsigned char*)(0x42D80360UL))
#define bFM4_I2S0_SRST_SRST                    *((volatile unsigned char*)(0x42D80380UL))
#define bFM4_I2S0_INTCNT_RFTH0                 *((volatile unsigned char*)(0x42D80400UL))
#define bFM4_I2S0_INTCNT_RFTH1                 *((volatile unsigned char*)(0x42D80404UL))
#define bFM4_I2S0_INTCNT_RFTH2                 *((volatile unsigned char*)(0x42D80408UL))
#define bFM4_I2S0_INTCNT_RFTH3                 *((volatile unsigned char*)(0x42D8040CUL))
#define bFM4_I2S0_INTCNT_RPTMR0                *((volatile unsigned char*)(0x42D80410UL))
#define bFM4_I2S0_INTCNT_RPTMR1                *((volatile unsigned char*)(0x42D80414UL))
#define bFM4_I2S0_INTCNT_TFTH0                 *((volatile unsigned char*)(0x42D80420UL))
#define bFM4_I2S0_INTCNT_TFTH1                 *((volatile unsigned char*)(0x42D80424UL))
#define bFM4_I2S0_INTCNT_TFTH2                 *((volatile unsigned char*)(0x42D80428UL))
#define bFM4_I2S0_INTCNT_TFTH3                 *((volatile unsigned char*)(0x42D8042CUL))
#define bFM4_I2S0_INTCNT_RXFIM                 *((volatile unsigned char*)(0x42D80440UL))
#define bFM4_I2S0_INTCNT_RXFDM                 *((volatile unsigned char*)(0x42D80444UL))
#define bFM4_I2S0_INTCNT_EOPM                  *((volatile unsigned char*)(0x42D80448UL))
#define bFM4_I2S0_INTCNT_RXOVM                 *((volatile unsigned char*)(0x42D8044CUL))
#define bFM4_I2S0_INTCNT_RXUDM                 *((volatile unsigned char*)(0x42D80450UL))
#define bFM4_I2S0_INTCNT_RBERM                 *((volatile unsigned char*)(0x42D80454UL))
#define bFM4_I2S0_INTCNT_TXFIM                 *((volatile unsigned char*)(0x42D80460UL))
#define bFM4_I2S0_INTCNT_TXFDM                 *((volatile unsigned char*)(0x42D80464UL))
#define bFM4_I2S0_INTCNT_TXOVM                 *((volatile unsigned char*)(0x42D80468UL))
#define bFM4_I2S0_INTCNT_TXUD0M                *((volatile unsigned char*)(0x42D8046CUL))
#define bFM4_I2S0_INTCNT_FERRM                 *((volatile unsigned char*)(0x42D80470UL))
#define bFM4_I2S0_INTCNT_TBERM                 *((volatile unsigned char*)(0x42D80474UL))
#define bFM4_I2S0_INTCNT_TXUD1M                *((volatile unsigned char*)(0x42D80478UL))
#define bFM4_I2S0_STATUS_RXNUM0                *((volatile unsigned char*)(0x42D80480UL))
#define bFM4_I2S0_STATUS_RXNUM1                *((volatile unsigned char*)(0x42D80484UL))
#define bFM4_I2S0_STATUS_RXNUM2                *((volatile unsigned char*)(0x42D80488UL))
#define bFM4_I2S0_STATUS_RXNUM3                *((volatile unsigned char*)(0x42D8048CUL))
#define bFM4_I2S0_STATUS_RXNUM4                *((volatile unsigned char*)(0x42D80490UL))
#define bFM4_I2S0_STATUS_RXNUM5                *((volatile unsigned char*)(0x42D80494UL))
#define bFM4_I2S0_STATUS_RXNUM6                *((volatile unsigned char*)(0x42D80498UL))
#define bFM4_I2S0_STATUS_RXNUM7                *((volatile unsigned char*)(0x42D8049CUL))
#define bFM4_I2S0_STATUS_TXNUM0                *((volatile unsigned char*)(0x42D804A0UL))
#define bFM4_I2S0_STATUS_TXNUM1                *((volatile unsigned char*)(0x42D804A4UL))
#define bFM4_I2S0_STATUS_TXNUM2                *((volatile unsigned char*)(0x42D804A8UL))
#define bFM4_I2S0_STATUS_TXNUM3                *((volatile unsigned char*)(0x42D804ACUL))
#define bFM4_I2S0_STATUS_TXNUM4                *((volatile unsigned char*)(0x42D804B0UL))
#define bFM4_I2S0_STATUS_TXNUM5                *((volatile unsigned char*)(0x42D804B4UL))
#define bFM4_I2S0_STATUS_TXNUM6                *((volatile unsigned char*)(0x42D804B8UL))
#define bFM4_I2S0_STATUS_TXNUM7                *((volatile unsigned char*)(0x42D804BCUL))
#define bFM4_I2S0_STATUS_RXFI                  *((volatile unsigned char*)(0x42D804C0UL))
#define bFM4_I2S0_STATUS_TXFI                  *((volatile unsigned char*)(0x42D804C4UL))
#define bFM4_I2S0_STATUS_BSY                   *((volatile unsigned char*)(0x42D804C8UL))
#define bFM4_I2S0_STATUS_EOPI                  *((volatile unsigned char*)(0x42D804CCUL))
#define bFM4_I2S0_STATUS_RXOVR                 *((volatile unsigned char*)(0x42D804E0UL))
#define bFM4_I2S0_STATUS_RXUDR                 *((volatile unsigned char*)(0x42D804E4UL))
#define bFM4_I2S0_STATUS_TXOVR                 *((volatile unsigned char*)(0x42D804E8UL))
#define bFM4_I2S0_STATUS_TXUDR0                *((volatile unsigned char*)(0x42D804ECUL))
#define bFM4_I2S0_STATUS_TXUDR1                *((volatile unsigned char*)(0x42D804F0UL))
#define bFM4_I2S0_STATUS_FERR                  *((volatile unsigned char*)(0x42D804F4UL))
#define bFM4_I2S0_STATUS_RBERR                 *((volatile unsigned char*)(0x42D804F8UL))
#define bFM4_I2S0_STATUS_TBERR                 *((volatile unsigned char*)(0x42D804FCUL))
#define bFM4_I2S0_DMAACT_RDMACT                *((volatile unsigned char*)(0x42D80500UL))
#define bFM4_I2S0_DMAACT_RL1E0                 *((volatile unsigned char*)(0x42D80520UL))
#define bFM4_I2S0_DMAACT_TDMACT                *((volatile unsigned char*)(0x42D80540UL))
#define bFM4_I2S0_DMAACT_TL1E0                 *((volatile unsigned char*)(0x42D80560UL))
#define bFM4_I2S0_TSTREG_LBMD                  *((volatile unsigned char*)(0x42D80580UL))

