MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C58L0AGL2000A/mcu.h
/* High-Speed Quad SPI registers */
#define bFM4_HSSPI_MCTRL_MEN                   *((volatile unsigned char*)(0x1242000000UL))
#define bFM4_HSSPI_MCTRL_CSEN                  *((volatile unsigned char*)(0x1242000004UL))
#define bFM4_HSSPI_MCTRL_MES                   *((volatile unsigned char*)(0x1242000010UL))
#define bFM4_HSSPI_MCTRL_SYNCON                *((volatile unsigned char*)(0x1242000014UL))
#define bFM4_HSSPI_PCC0_CPHA                   *((volatile unsigned char*)(0x1242000080UL))
#define bFM4_HSSPI_PCC0_CPOL                   *((volatile unsigned char*)(0x1242000084UL))
#define bFM4_HSSPI_PCC0_ACES                   *((volatile unsigned char*)(0x1242000088UL))
#define bFM4_HSSPI_PCC0_RTM                    *((volatile unsigned char*)(0x124200008CUL))
#define bFM4_HSSPI_PCC0_SSPOL                  *((volatile unsigned char*)(0x1242000090UL))
#define bFM4_HSSPI_PCC0_SS2CD0                 *((volatile unsigned char*)(0x1242000094UL))
#define bFM4_HSSPI_PCC0_SS2CD1                 *((volatile unsigned char*)(0x1242000098UL))
#define bFM4_HSSPI_PCC0_SDIR                   *((volatile unsigned char*)(0x124200009CUL))
#define bFM4_HSSPI_PCC0_SENDIAN                *((volatile unsigned char*)(0x12420000A0UL))
#define bFM4_HSSPI_PCC0_CDRS0                  *((volatile unsigned char*)(0x12420000A4UL))
#define bFM4_HSSPI_PCC0_CDRS1                  *((volatile unsigned char*)(0x12420000A8UL))
#define bFM4_HSSPI_PCC0_CDRS2                  *((volatile unsigned char*)(0x12420000ACUL))
#define bFM4_HSSPI_PCC0_CDRS3                  *((volatile unsigned char*)(0x12420000B0UL))
#define bFM4_HSSPI_PCC0_CDRS4                  *((volatile unsigned char*)(0x12420000B4UL))
#define bFM4_HSSPI_PCC0_CDRS5                  *((volatile unsigned char*)(0x12420000B8UL))
#define bFM4_HSSPI_PCC0_CDRS6                  *((volatile unsigned char*)(0x12420000BCUL))
#define bFM4_HSSPI_PCC0_SAFESYNC               *((volatile unsigned char*)(0x12420000C0UL))
#define bFM4_HSSPI_PCC0_WRDSEL0                *((volatile unsigned char*)(0x12420000C4UL))
#define bFM4_HSSPI_PCC0_WRDSEL1                *((volatile unsigned char*)(0x12420000C8UL))
#define bFM4_HSSPI_PCC0_WRDSEL2                *((volatile unsigned char*)(0x12420000CCUL))
#define bFM4_HSSPI_PCC0_WRDSEL3                *((volatile unsigned char*)(0x12420000D0UL))
#define bFM4_HSSPI_PCC0_RDDSEL0                *((volatile unsigned char*)(0x12420000D4UL))
#define bFM4_HSSPI_PCC0_RDDSEL1                *((volatile unsigned char*)(0x12420000D8UL))
#define bFM4_HSSPI_PCC1_CPHA                   *((volatile unsigned char*)(0x1242000100UL))
#define bFM4_HSSPI_PCC1_CPOL                   *((volatile unsigned char*)(0x1242000104UL))
#define bFM4_HSSPI_PCC1_ACES                   *((volatile unsigned char*)(0x1242000108UL))
#define bFM4_HSSPI_PCC1_RTM                    *((volatile unsigned char*)(0x124200010CUL))
#define bFM4_HSSPI_PCC1_SSPOL                  *((volatile unsigned char*)(0x1242000110UL))
#define bFM4_HSSPI_PCC1_SS2CD0                 *((volatile unsigned char*)(0x1242000114UL))
#define bFM4_HSSPI_PCC1_SS2CD1                 *((volatile unsigned char*)(0x1242000118UL))
#define bFM4_HSSPI_PCC1_SDIR                   *((volatile unsigned char*)(0x124200011CUL))
#define bFM4_HSSPI_PCC1_SENDIAN                *((volatile unsigned char*)(0x1242000120UL))
#define bFM4_HSSPI_PCC1_CDRS0                  *((volatile unsigned char*)(0x1242000124UL))
#define bFM4_HSSPI_PCC1_CDRS1                  *((volatile unsigned char*)(0x1242000128UL))
#define bFM4_HSSPI_PCC1_CDRS2                  *((volatile unsigned char*)(0x124200012CUL))
#define bFM4_HSSPI_PCC1_CDRS3                  *((volatile unsigned char*)(0x1242000130UL))
#define bFM4_HSSPI_PCC1_CDRS4                  *((volatile unsigned char*)(0x1242000134UL))
#define bFM4_HSSPI_PCC1_CDRS5                  *((volatile unsigned char*)(0x1242000138UL))
#define bFM4_HSSPI_PCC1_CDRS6                  *((volatile unsigned char*)(0x124200013CUL))
#define bFM4_HSSPI_PCC1_SAFESYNC               *((volatile unsigned char*)(0x1242000140UL))
#define bFM4_HSSPI_PCC1_WRDSEL0                *((volatile unsigned char*)(0x1242000144UL))
#define bFM4_HSSPI_PCC1_WRDSEL1                *((volatile unsigned char*)(0x1242000148UL))
#define bFM4_HSSPI_PCC1_WRDSEL2                *((volatile unsigned char*)(0x124200014CUL))
#define bFM4_HSSPI_PCC1_WRDSEL3                *((volatile unsigned char*)(0x1242000150UL))
#define bFM4_HSSPI_PCC1_RDDSEL0                *((volatile unsigned char*)(0x1242000154UL))
#define bFM4_HSSPI_PCC1_RDDSEL1                *((volatile unsigned char*)(0x1242000158UL))
#define bFM4_HSSPI_PCC2_CPHA                   *((volatile unsigned char*)(0x1242000180UL))
#define bFM4_HSSPI_PCC2_CPOL                   *((volatile unsigned char*)(0x1242000184UL))
#define bFM4_HSSPI_PCC2_ACES                   *((volatile unsigned char*)(0x1242000188UL))
#define bFM4_HSSPI_PCC2_RTM                    *((volatile unsigned char*)(0x124200018CUL))
#define bFM4_HSSPI_PCC2_SSPOL                  *((volatile unsigned char*)(0x1242000190UL))
#define bFM4_HSSPI_PCC2_SS2CD0                 *((volatile unsigned char*)(0x1242000194UL))
#define bFM4_HSSPI_PCC2_SS2CD1                 *((volatile unsigned char*)(0x1242000198UL))
#define bFM4_HSSPI_PCC2_SDIR                   *((volatile unsigned char*)(0x124200019CUL))
#define bFM4_HSSPI_PCC2_SENDIAN                *((volatile unsigned char*)(0x12420001A0UL))
#define bFM4_HSSPI_PCC2_CDRS0                  *((volatile unsigned char*)(0x12420001A4UL))
#define bFM4_HSSPI_PCC2_CDRS1                  *((volatile unsigned char*)(0x12420001A8UL))
#define bFM4_HSSPI_PCC2_CDRS2                  *((volatile unsigned char*)(0x12420001ACUL))
#define bFM4_HSSPI_PCC2_CDRS3                  *((volatile unsigned char*)(0x12420001B0UL))
#define bFM4_HSSPI_PCC2_CDRS4                  *((volatile unsigned char*)(0x12420001B4UL))
#define bFM4_HSSPI_PCC2_CDRS5                  *((volatile unsigned char*)(0x12420001B8UL))
#define bFM4_HSSPI_PCC2_CDRS6                  *((volatile unsigned char*)(0x12420001BCUL))
#define bFM4_HSSPI_PCC2_SAFESYNC               *((volatile unsigned char*)(0x12420001C0UL))
#define bFM4_HSSPI_PCC2_WRDSEL0                *((volatile unsigned char*)(0x12420001C4UL))
#define bFM4_HSSPI_PCC2_WRDSEL1                *((volatile unsigned char*)(0x12420001C8UL))
#define bFM4_HSSPI_PCC2_WRDSEL2                *((volatile unsigned char*)(0x12420001CCUL))
#define bFM4_HSSPI_PCC2_WRDSEL3                *((volatile unsigned char*)(0x12420001D0UL))
#define bFM4_HSSPI_PCC2_RDDSEL0                *((volatile unsigned char*)(0x12420001D4UL))
#define bFM4_HSSPI_PCC2_RDDSEL1                *((volatile unsigned char*)(0x12420001D8UL))
#define bFM4_HSSPI_PCC3_CPHA                   *((volatile unsigned char*)(0x1242000200UL))
#define bFM4_HSSPI_PCC3_CPOL                   *((volatile unsigned char*)(0x1242000204UL))
#define bFM4_HSSPI_PCC3_ACES                   *((volatile unsigned char*)(0x1242000208UL))
#define bFM4_HSSPI_PCC3_RTM                    *((volatile unsigned char*)(0x124200020CUL))
#define bFM4_HSSPI_PCC3_SSPOL                  *((volatile unsigned char*)(0x1242000210UL))
#define bFM4_HSSPI_PCC3_SS2CD0                 *((volatile unsigned char*)(0x1242000214UL))
#define bFM4_HSSPI_PCC3_SS2CD1                 *((volatile unsigned char*)(0x1242000218UL))
#define bFM4_HSSPI_PCC3_SDIR                   *((volatile unsigned char*)(0x124200021CUL))
#define bFM4_HSSPI_PCC3_SENDIAN                *((volatile unsigned char*)(0x1242000220UL))
#define bFM4_HSSPI_PCC3_CDRS0                  *((volatile unsigned char*)(0x1242000224UL))
#define bFM4_HSSPI_PCC3_CDRS1                  *((volatile unsigned char*)(0x1242000228UL))
#define bFM4_HSSPI_PCC3_CDRS2                  *((volatile unsigned char*)(0x124200022CUL))
#define bFM4_HSSPI_PCC3_CDRS3                  *((volatile unsigned char*)(0x1242000230UL))
#define bFM4_HSSPI_PCC3_CDRS4                  *((volatile unsigned char*)(0x1242000234UL))
#define bFM4_HSSPI_PCC3_CDRS5                  *((volatile unsigned char*)(0x1242000238UL))
#define bFM4_HSSPI_PCC3_CDRS6                  *((volatile unsigned char*)(0x124200023CUL))
#define bFM4_HSSPI_PCC3_SAFESYNC               *((volatile unsigned char*)(0x1242000240UL))
#define bFM4_HSSPI_PCC3_WRDSEL0                *((volatile unsigned char*)(0x1242000244UL))
#define bFM4_HSSPI_PCC3_WRDSEL1                *((volatile unsigned char*)(0x1242000248UL))
#define bFM4_HSSPI_PCC3_WRDSEL2                *((volatile unsigned char*)(0x124200024CUL))
#define bFM4_HSSPI_PCC3_WRDSEL3                *((volatile unsigned char*)(0x1242000250UL))
#define bFM4_HSSPI_PCC3_RDDSEL0                *((volatile unsigned char*)(0x1242000254UL))
#define bFM4_HSSPI_PCC3_RDDSEL1                *((volatile unsigned char*)(0x1242000258UL))
#define bFM4_HSSPI_TXF_TFFS                    *((volatile unsigned char*)(0x1242000280UL))
#define bFM4_HSSPI_TXF_TFES                    *((volatile unsigned char*)(0x1242000284UL))
#define bFM4_HSSPI_TXF_TFOS                    *((volatile unsigned char*)(0x1242000288UL))
#define bFM4_HSSPI_TXF_TFUS                    *((volatile unsigned char*)(0x124200028CUL))
#define bFM4_HSSPI_TXF_TFLETS                  *((volatile unsigned char*)(0x1242000290UL))
#define bFM4_HSSPI_TXF_TFMTS                   *((volatile unsigned char*)(0x1242000294UL))
#define bFM4_HSSPI_TXF_TSSRS                   *((volatile unsigned char*)(0x1242000298UL))
#define bFM4_HSSPI_TXE_TFFE                    *((volatile unsigned char*)(0x1242000300UL))
#define bFM4_HSSPI_TXE_TFEE                    *((volatile unsigned char*)(0x1242000304UL))
#define bFM4_HSSPI_TXE_TFOE                    *((volatile unsigned char*)(0x1242000308UL))
#define bFM4_HSSPI_TXE_TFUE                    *((volatile unsigned char*)(0x124200030CUL))
#define bFM4_HSSPI_TXE_TFLETE                  *((volatile unsigned char*)(0x1242000310UL))
#define bFM4_HSSPI_TXE_TFMTE                   *((volatile unsigned char*)(0x1242000314UL))
#define bFM4_HSSPI_TXE_TSSRE                   *((volatile unsigned char*)(0x1242000318UL))
#define bFM4_HSSPI_TXC_TFFC                    *((volatile unsigned char*)(0x1242000380UL))
#define bFM4_HSSPI_TXC_TFEC                    *((volatile unsigned char*)(0x1242000384UL))
#define bFM4_HSSPI_TXC_TFOC                    *((volatile unsigned char*)(0x1242000388UL))
#define bFM4_HSSPI_TXC_TFUC                    *((volatile unsigned char*)(0x124200038CUL))
#define bFM4_HSSPI_TXC_TFLETC                  *((volatile unsigned char*)(0x1242000390UL))
#define bFM4_HSSPI_TXC_TFMTC                   *((volatile unsigned char*)(0x1242000394UL))
#define bFM4_HSSPI_TXC_TSSRC                   *((volatile unsigned char*)(0x1242000398UL))
#define bFM4_HSSPI_RXF_RFFS                    *((volatile unsigned char*)(0x1242000400UL))
#define bFM4_HSSPI_RXF_RFES                    *((volatile unsigned char*)(0x1242000404UL))
#define bFM4_HSSPI_RXF_RFOS                    *((volatile unsigned char*)(0x1242000408UL))
#define bFM4_HSSPI_RXF_RFUS                    *((volatile unsigned char*)(0x124200040CUL))
#define bFM4_HSSPI_RXF_RFLETS                  *((volatile unsigned char*)(0x1242000410UL))
#define bFM4_HSSPI_RXF_RFMTS                   *((volatile unsigned char*)(0x1242000414UL))
#define bFM4_HSSPI_RXF_RSSRS                   *((volatile unsigned char*)(0x1242000418UL))
#define bFM4_HSSPI_RXE_RFFE                    *((volatile unsigned char*)(0x1242000480UL))
#define bFM4_HSSPI_RXE_RFEE                    *((volatile unsigned char*)(0x1242000484UL))
#define bFM4_HSSPI_RXE_RFOE                    *((volatile unsigned char*)(0x1242000488UL))
#define bFM4_HSSPI_RXE_RFUE                    *((volatile unsigned char*)(0x124200048CUL))
#define bFM4_HSSPI_RXE_RFLETE                  *((volatile unsigned char*)(0x1242000490UL))
#define bFM4_HSSPI_RXE_RFMTE                   *((volatile unsigned char*)(0x1242000494UL))
#define bFM4_HSSPI_RXE_RSSRE                   *((volatile unsigned char*)(0x1242000498UL))
#define bFM4_HSSPI_RXC_RFFC                    *((volatile unsigned char*)(0x1242000500UL))
#define bFM4_HSSPI_RXC_RFEC                    *((volatile unsigned char*)(0x1242000504UL))
#define bFM4_HSSPI_RXC_RFOC                    *((volatile unsigned char*)(0x1242000508UL))
#define bFM4_HSSPI_RXC_RFUC                    *((volatile unsigned char*)(0x124200050CUL))
#define bFM4_HSSPI_RXC_RFLETC                  *((volatile unsigned char*)(0x1242000510UL))
#define bFM4_HSSPI_RXC_RFMTC                   *((volatile unsigned char*)(0x1242000514UL))
#define bFM4_HSSPI_RXC_RSSRC                   *((volatile unsigned char*)(0x1242000518UL))
#define bFM4_HSSPI_FAULTF_UMAFS                *((volatile unsigned char*)(0x1242000580UL))
#define bFM4_HSSPI_FAULTF_WAFS                 *((volatile unsigned char*)(0x1242000584UL))
#define bFM4_HSSPI_FAULTF_PVFS                 *((volatile unsigned char*)(0x1242000588UL))
#define bFM4_HSSPI_FAULTF_DWCBSFS              *((volatile unsigned char*)(0x124200058CUL))
#define bFM4_HSSPI_FAULTF_DRCBSFS              *((volatile unsigned char*)(0x1242000590UL))
#define bFM4_HSSPI_FAULTC_UMAFC                *((volatile unsigned char*)(0x1242000600UL))
#define bFM4_HSSPI_FAULTC_WAFC                 *((volatile unsigned char*)(0x1242000604UL))
#define bFM4_HSSPI_FAULTC_PVFC                 *((volatile unsigned char*)(0x1242000608UL))
#define bFM4_HSSPI_FAULTC_DWCBSFC              *((volatile unsigned char*)(0x124200060CUL))
#define bFM4_HSSPI_FAULTC_DRCBSFC              *((volatile unsigned char*)(0x1242000610UL))
#define bFM4_HSSPI_DMCFG_SSDC                  *((volatile unsigned char*)(0x1242000684UL))
#define bFM4_HSSPI_DMDMAEN_RXDMAEN             *((volatile unsigned char*)(0x12420006A0UL))
#define bFM4_HSSPI_DMDMAEN_TXDMAEN             *((volatile unsigned char*)(0x12420006A4UL))
#define bFM4_HSSPI_DMSTART_START               *((volatile unsigned char*)(0x1242000700UL))
#define bFM4_HSSPI_DMSTOP_STOP                 *((volatile unsigned char*)(0x1242000720UL))
#define bFM4_HSSPI_DMPSEL_PSEL0                *((volatile unsigned char*)(0x1242000740UL))
#define bFM4_HSSPI_DMPSEL_PSEL1                *((volatile unsigned char*)(0x1242000744UL))
#define bFM4_HSSPI_DMTRP_TRP0                  *((volatile unsigned char*)(0x1242000760UL))
#define bFM4_HSSPI_DMTRP_TRP1                  *((volatile unsigned char*)(0x1242000764UL))
#define bFM4_HSSPI_DMTRP_TRP2                  *((volatile unsigned char*)(0x1242000768UL))
#define bFM4_HSSPI_DMTRP_TRP3                  *((volatile unsigned char*)(0x124200076CUL))
#define bFM4_HSSPI_DMSTATUS_RXACTIVE           *((volatile unsigned char*)(0x1242000800UL))
#define bFM4_HSSPI_DMSTATUS_TXACTIVE           *((volatile unsigned char*)(0x1242000804UL))
#define bFM4_HSSPI_DMSTATUS_RXFLEVEL0          *((volatile unsigned char*)(0x1242000820UL))
#define bFM4_HSSPI_DMSTATUS_RXFLEVEL1          *((volatile unsigned char*)(0x1242000824UL))
#define bFM4_HSSPI_DMSTATUS_RXFLEVEL2          *((volatile unsigned char*)(0x1242000828UL))
#define bFM4_HSSPI_DMSTATUS_RXFLEVEL3          *((volatile unsigned char*)(0x124200082CUL))
#define bFM4_HSSPI_DMSTATUS_RXFLEVEL4          *((volatile unsigned char*)(0x1242000830UL))
#define bFM4_HSSPI_DMSTATUS_TXFLEVEL0          *((volatile unsigned char*)(0x1242000840UL))
#define bFM4_HSSPI_DMSTATUS_TXFLEVEL1          *((volatile unsigned char*)(0x1242000844UL))
#define bFM4_HSSPI_DMSTATUS_TXFLEVEL2          *((volatile unsigned char*)(0x1242000848UL))
#define bFM4_HSSPI_DMSTATUS_TXFLEVEL3          *((volatile unsigned char*)(0x124200084CUL))
#define bFM4_HSSPI_DMSTATUS_TXFLEVEL4          *((volatile unsigned char*)(0x1242000850UL))
#define bFM4_HSSPI_FIFOCFG_RXFTH0              *((volatile unsigned char*)(0x1242000980UL))
#define bFM4_HSSPI_FIFOCFG_RXFTH1              *((volatile unsigned char*)(0x1242000984UL))
#define bFM4_HSSPI_FIFOCFG_RXFTH2              *((volatile unsigned char*)(0x1242000988UL))
#define bFM4_HSSPI_FIFOCFG_RXFTH3              *((volatile unsigned char*)(0x124200098CUL))
#define bFM4_HSSPI_FIFOCFG_TXFTH0              *((volatile unsigned char*)(0x1242000990UL))
#define bFM4_HSSPI_FIFOCFG_TXFTH1              *((volatile unsigned char*)(0x1242000994UL))
#define bFM4_HSSPI_FIFOCFG_TXFTH2              *((volatile unsigned char*)(0x1242000998UL))
#define bFM4_HSSPI_FIFOCFG_TXFTH3              *((volatile unsigned char*)(0x124200099CUL))
#define bFM4_HSSPI_FIFOCFG_FWIDTH0             *((volatile unsigned char*)(0x12420009A0UL))
#define bFM4_HSSPI_FIFOCFG_FWIDTH1             *((volatile unsigned char*)(0x12420009A4UL))
#define bFM4_HSSPI_FIFOCFG_TXCTRL              *((volatile unsigned char*)(0x12420009A8UL))
#define bFM4_HSSPI_FIFOCFG_RXFLSH              *((volatile unsigned char*)(0x12420009ACUL))
#define bFM4_HSSPI_FIFOCFG_TXFLSH              *((volatile unsigned char*)(0x12420009B0UL))
#define bFM4_HSSPI_CSCFG_SRAM                  *((volatile unsigned char*)(0x1242001A00UL))
#define bFM4_HSSPI_CSCFG_MBM0                  *((volatile unsigned char*)(0x1242001A04UL))
#define bFM4_HSSPI_CSCFG_MBM1                  *((volatile unsigned char*)(0x1242001A08UL))
#define bFM4_HSSPI_CSCFG_SSEL0EN               *((volatile unsigned char*)(0x1242001A20UL))
#define bFM4_HSSPI_CSCFG_SSEL1EN               *((volatile unsigned char*)(0x1242001A24UL))
#define bFM4_HSSPI_CSCFG_SSEL2EN               *((volatile unsigned char*)(0x1242001A28UL))
#define bFM4_HSSPI_CSCFG_SSEL3EN               *((volatile unsigned char*)(0x1242001A2CUL))
#define bFM4_HSSPI_CSCFG_MSEL0                 *((volatile unsigned char*)(0x1242001A40UL))
#define bFM4_HSSPI_CSCFG_MSEL1                 *((volatile unsigned char*)(0x1242001A44UL))
#define bFM4_HSSPI_CSCFG_MSEL2                 *((volatile unsigned char*)(0x1242001A48UL))
#define bFM4_HSSPI_CSCFG_MSEL3                 *((volatile unsigned char*)(0x1242001A4CUL))
#define bFM4_HSSPI_RDCSDC0_DEC                 *((volatile unsigned char*)(0x1242001B80UL))
#define bFM4_HSSPI_RDCSDC0_TRP0                *((volatile unsigned char*)(0x1242001B84UL))
#define bFM4_HSSPI_RDCSDC0_TRP1                *((volatile unsigned char*)(0x1242001B88UL))
#define bFM4_HSSPI_RDCSDC0_CONT                *((volatile unsigned char*)(0x1242001B8CUL))
#define bFM4_HSSPI_RDCSDC1_DEC                 *((volatile unsigned char*)(0x1242001BC0UL))
#define bFM4_HSSPI_RDCSDC1_TRP0                *((volatile unsigned char*)(0x1242001BC4UL))
#define bFM4_HSSPI_RDCSDC1_TRP1                *((volatile unsigned char*)(0x1242001BC8UL))
#define bFM4_HSSPI_RDCSDC1_CONT                *((volatile unsigned char*)(0x1242001BCCUL))
#define bFM4_HSSPI_RDCSDC2_DEC                 *((volatile unsigned char*)(0x1242001C00UL))
#define bFM4_HSSPI_RDCSDC2_TRP0                *((volatile unsigned char*)(0x1242001C04UL))
#define bFM4_HSSPI_RDCSDC2_TRP1                *((volatile unsigned char*)(0x1242001C08UL))
#define bFM4_HSSPI_RDCSDC2_CONT                *((volatile unsigned char*)(0x1242001C0CUL))
#define bFM4_HSSPI_RDCSDC3_DEC                 *((volatile unsigned char*)(0x1242001C40UL))
#define bFM4_HSSPI_RDCSDC3_TRP0                *((volatile unsigned char*)(0x1242001C44UL))
#define bFM4_HSSPI_RDCSDC3_TRP1                *((volatile unsigned char*)(0x1242001C48UL))
#define bFM4_HSSPI_RDCSDC3_CONT                *((volatile unsigned char*)(0x1242001C4CUL))
#define bFM4_HSSPI_RDCSDC4_DEC                 *((volatile unsigned char*)(0x1242001C80UL))
#define bFM4_HSSPI_RDCSDC4_TRP0                *((volatile unsigned char*)(0x1242001C84UL))
#define bFM4_HSSPI_RDCSDC4_TRP1                *((volatile unsigned char*)(0x1242001C88UL))
#define bFM4_HSSPI_RDCSDC4_CONT                *((volatile unsigned char*)(0x1242001C8CUL))
#define bFM4_HSSPI_RDCSDC5_DEC                 *((volatile unsigned char*)(0x1242001CC0UL))
#define bFM4_HSSPI_RDCSDC5_TRP0                *((volatile unsigned char*)(0x1242001CC4UL))
#define bFM4_HSSPI_RDCSDC5_TRP1                *((volatile unsigned char*)(0x1242001CC8UL))
#define bFM4_HSSPI_RDCSDC5_CONT                *((volatile unsigned char*)(0x1242001CCCUL))
#define bFM4_HSSPI_RDCSDC6_DEC                 *((volatile unsigned char*)(0x1242001D00UL))
#define bFM4_HSSPI_RDCSDC6_TRP0                *((volatile unsigned char*)(0x1242001D04UL))
#define bFM4_HSSPI_RDCSDC6_TRP1                *((volatile unsigned char*)(0x1242001D08UL))
#define bFM4_HSSPI_RDCSDC6_CONT                *((volatile unsigned char*)(0x1242001D0CUL))
#define bFM4_HSSPI_RDCSDC7_DEC                 *((volatile unsigned char*)(0x1242001D40UL))
#define bFM4_HSSPI_RDCSDC7_TRP0                *((volatile unsigned char*)(0x1242001D44UL))
#define bFM4_HSSPI_RDCSDC7_TRP1                *((volatile unsigned char*)(0x1242001D48UL))
#define bFM4_HSSPI_RDCSDC7_CONT                *((volatile unsigned char*)(0x1242001D4CUL))
#define bFM4_HSSPI_WRCSDC0_DEC                 *((volatile unsigned char*)(0x1242001D80UL))
#define bFM4_HSSPI_WRCSDC0_TRP0                *((volatile unsigned char*)(0x1242001D84UL))
#define bFM4_HSSPI_WRCSDC0_TRP1                *((volatile unsigned char*)(0x1242001D88UL))
#define bFM4_HSSPI_WRCSDC0_CONT                *((volatile unsigned char*)(0x1242001D8CUL))
#define bFM4_HSSPI_WRCSDC1_DEC                 *((volatile unsigned char*)(0x1242001DC0UL))
#define bFM4_HSSPI_WRCSDC1_TRP0                *((volatile unsigned char*)(0x1242001DC4UL))
#define bFM4_HSSPI_WRCSDC1_TRP1                *((volatile unsigned char*)(0x1242001DC8UL))
#define bFM4_HSSPI_WRCSDC1_CONT                *((volatile unsigned char*)(0x1242001DCCUL))
#define bFM4_HSSPI_WRCSDC2_DEC                 *((volatile unsigned char*)(0x1242001E00UL))
#define bFM4_HSSPI_WRCSDC2_TRP0                *((volatile unsigned char*)(0x1242001E04UL))
#define bFM4_HSSPI_WRCSDC2_TRP1                *((volatile unsigned char*)(0x1242001E08UL))
#define bFM4_HSSPI_WRCSDC2_CONT                *((volatile unsigned char*)(0x1242001E0CUL))
#define bFM4_HSSPI_WRCSDC3_DEC                 *((volatile unsigned char*)(0x1242001E40UL))
#define bFM4_HSSPI_WRCSDC3_TRP0                *((volatile unsigned char*)(0x1242001E44UL))
#define bFM4_HSSPI_WRCSDC3_TRP1                *((volatile unsigned char*)(0x1242001E48UL))
#define bFM4_HSSPI_WRCSDC3_CONT                *((volatile unsigned char*)(0x1242001E4CUL))
#define bFM4_HSSPI_WRCSDC4_DEC                 *((volatile unsigned char*)(0x1242001E80UL))
#define bFM4_HSSPI_WRCSDC4_TRP0                *((volatile unsigned char*)(0x1242001E84UL))
#define bFM4_HSSPI_WRCSDC4_TRP1                *((volatile unsigned char*)(0x1242001E88UL))
#define bFM4_HSSPI_WRCSDC4_CONT                *((volatile unsigned char*)(0x1242001E8CUL))
#define bFM4_HSSPI_WRCSDC5_DEC                 *((volatile unsigned char*)(0x1242001EC0UL))
#define bFM4_HSSPI_WRCSDC5_TRP0                *((volatile unsigned char*)(0x1242001EC4UL))
#define bFM4_HSSPI_WRCSDC5_TRP1                *((volatile unsigned char*)(0x1242001EC8UL))
#define bFM4_HSSPI_WRCSDC5_CONT                *((volatile unsigned char*)(0x1242001ECCUL))
#define bFM4_HSSPI_WRCSDC6_DEC                 *((volatile unsigned char*)(0x1242001F00UL))
#define bFM4_HSSPI_WRCSDC6_TRP0                *((volatile unsigned char*)(0x1242001F04UL))
#define bFM4_HSSPI_WRCSDC6_TRP1                *((volatile unsigned char*)(0x1242001F08UL))
#define bFM4_HSSPI_WRCSDC6_CONT                *((volatile unsigned char*)(0x1242001F0CUL))
#define bFM4_HSSPI_WRCSDC7_DEC                 *((volatile unsigned char*)(0x1242001F40UL))
#define bFM4_HSSPI_WRCSDC7_TRP0                *((volatile unsigned char*)(0x1242001F44UL))
#define bFM4_HSSPI_WRCSDC7_TRP1                *((volatile unsigned char*)(0x1242001F48UL))
#define bFM4_HSSPI_WRCSDC7_CONT                *((volatile unsigned char*)(0x1242001F4CUL))
#define bFM4_HSSPI_DBCNT_RXDBEN                *((volatile unsigned char*)(0x1242008080UL))
#define bFM4_HSSPI_DBCNT_TXDBEN                *((volatile unsigned char*)(0x1242008084UL))

#ifdef __cplusplus
}
#endif

#endif /* _S6E2C5_H_ */
